
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>去「界外」看看 | yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x7684;&amp;#x751F;&amp;#x6D3B;&amp;#x5927;&amp;#x90E8;&amp;#x5206;&amp;#x65F6;&amp;#x95F4;&amp;#x90FD;&amp;#x662F;&amp;#x5904;&amp;#x4E8E;&amp;#x516C;&amp;#x53F8;-&amp;#x5BB6;&amp;#x7684;&amp;#x4E24;&amp;#x70B9;&amp;#x4E00;&amp;#x7EBF;&amp;#x7684;&amp;#x72B6">
<meta property="og:type" content="article">
<meta property="og:title" content="去「界外」看看">
<meta property="og:url" content="http://zhengyi.me/2016/09/29/go-out-border/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x7684;&amp;#x751F;&amp;#x6D3B;&amp;#x5927;&amp;#x90E8;&amp;#x5206;&amp;#x65F6;&amp;#x95F4;&amp;#x90FD;&amp;#x662F;&amp;#x5904;&amp;#x4E8E;&amp;#x516C;&amp;#x53F8;-&amp;#x5BB6;&amp;#x7684;&amp;#x4E24;&amp;#x70B9;&amp;#x4E00;&amp;#x7EBF;&amp;#x7684;&amp;#x72B6">
<meta property="og:updated_time" content="2016-10-05T13:18:00.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="去「界外」看看">
<meta name="twitter:description" content="&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x7684;&amp;#x751F;&amp;#x6D3B;&amp;#x5927;&amp;#x90E8;&amp;#x5206;&amp;#x65F6;&amp;#x95F4;&amp;#x90FD;&amp;#x662F;&amp;#x5904;&amp;#x4E8E;&amp;#x516C;&amp;#x53F8;-&amp;#x5BB6;&amp;#x7684;&amp;#x4E24;&amp;#x70B9;&amp;#x4E00;&amp;#x7EBF;&amp;#x7684;&amp;#x72B6">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/09/29/go-out-border/" title="去「界外」看看" itemprop="url">去「界外」看看</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-09-29T13:14:40.000Z" itemprop="datePublished"> 发表于 2016-09-29</time>
    
  </p>
</header>
	<div class="article-content">
		
		<p>&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x5904;&#x4E8E;&#x516C;&#x53F8;-&#x5BB6;&#x7684;&#x4E24;&#x70B9;&#x4E00;&#x7EBF;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x7ECF;&#x5386;&#x3002;&#x67D0;&#x4E00;&#x5929;&#xFF0C;&#x4F60;&#x5F00;&#x8F66;&#x5F00;&#x9519;&#x8DEF;&#x6216;&#x8005;&#x5750;&#x516C;&#x4EA4;&#x5750;&#x8FC7;&#x7AD9;&#x4E86;&#xFF0C;&#x7A81;&#x7136;&#x60CA;&#x5947;&#x7684;&#x53D1;&#x73B0;&#x5C31;&#x5728;&#x4F60;&#x9644;&#x8FD1;&#x7684;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x8DDF;&#x4F60;&#x60F3;&#x8C61;&#x7684;&#x4E0D;&#x5927;&#x4E00;&#x6837;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x5F88;&#x597D;&#x73A9;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x67D0;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x5728;&#x5BB6;&#x9644;&#x8FD1;&#x5403;&#x5B8C;&#x665A;&#x996D;&#xFF0C;&#x7A81;&#x53D1;&#x5947;&#x60F3;&#x5F80;&#x4ECE;&#x6765;&#x90FD;&#x6709;&#x53BB;&#x8FC7;&#x7684;&#x8857;&#x7684;&#x53E6;&#x4E00;&#x5934;&#x6563;&#x6B65;&#x8D70;&#x53BB;&#x3002;&#x8D70;&#x51FA;&#x4E0D;&#x5230;&#x4E24;&#x516C;&#x91CC;&#xFF0C;&#x60CA;&#x5947;&#x7684;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x79BB;&#x6211;&#x5BB6;&#x8FD9;&#x4E48;&#x8FD1;&#x7684;&#x5730;&#x65B9;&#x7ADF;&#x7136;&#x8FD8;&#x6709;&#x4E00;&#x5904;&#x8FF7;&#x4F60;&#x7684;&#x516C;&#x56ED;&#x3002;&#x7A81;&#x7136;&#x5FC3;&#x751F;&#x611F;&#x6168;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x7F8E;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x80FD;&#x5C31;&#x5728;&#x4F60;&#x9644;&#x8FD1;&#xFF0C;&#x53EA;&#x662F;&#x4F60;&#x4E00;&#x76F4;&#x88AB;&#x4E00;&#x4E2A;&#x9690;&#x5F62;&#x7684;&#x8FB9;&#x754C;&#x9650;&#x5B9A;&#x4F4F;&#x4E86;&#x4F60;&#x63A2;&#x7D22;&#x7684;&#x811A;&#x6B65;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#x662F;&#x201C;&#x65C5;&#x6E38;&#x5C31;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x4F60;&#x719F;&#x6089;&#x7684;&#x5730;&#x65B9;&#x8DD1;&#x5230;&#x4F60;&#x4E00;&#x4E2A;&#x522B;&#x4EBA;&#x719F;&#x6089;&#x7684;&#x5730;&#x65B9;&#x201D;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x4EBA;&#x559C;&#x6B22;&#x65C5;&#x6E38;&#xFF1F;&#x56E0;&#x4E3A;&#x5728;&#x4E00;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4EBA;&#x4EEC;&#x5F80;&#x5F80;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F60;&#x53BB;&#x7684;&#x5730;&#x65B9;&#x79BB;&#x4F60;&#x8D8A;&#x8FDC;&#x53EF;&#x80FD;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x80FD;&#x591F;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x7684;&#x51B2;&#x51FB;&#x4E5F;&#x5C31;&#x8D8A;&#x5F3A;&#x3002;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x7684;&#x4EBA;&#x5230;&#x4F60;&#x6240;&#x751F;&#x6D3B;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x540C;&#x6837;&#x4F1A;&#x53D7;&#x5230;&#x7C7B;&#x4F3C;&#x7684;&#x51B2;&#x51FB;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4EBA;&#x4EEC;&#x7684;&#x5404;&#x4E2A;&#x611F;&#x5B98;&#x90FD;&#x5904;&#x5728;&#x5174;&#x594B;&#x3001;&#x7126;&#x8651;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x6781;&#x529B;&#x5F97;&#x53BB;&#x5438;&#x53D6;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x7136;&#x540E;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x98DE;&#x901F;&#x7684;&#x8FD0;&#x7B97;&#x3002;&#x8D70;&#x5728;&#x4E00;&#x4E2A;&#x5F02;&#x56FD;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x53EF;&#x80FD;&#x8DEF;&#x8FB9;&#x7684;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x6876;&#x3001;&#x4E00;&#x4E2A;&#x6D41;&#x6D6A;&#x6C49;&#x3001;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x62DB;&#x724C;&#x90FD;&#x80FD;&#x591F;&#x5438;&#x5F15;&#x4F60;&#x9A7B;&#x8DB3;&#x53BB;&#x89C2;&#x5BDF;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4ECE;&#x6765;&#x6CA1;&#x89C1;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F46;&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x5F85;&#x4E0A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x53D8;&#x5F97;&#x8DDF;&#x672C;&#x5730;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x201C;&#x611F;&#x5B98;&#x201D;&#x5173;&#x95ED;&#x4E86;&#xFF0C;&#x4E0D;&#x518D;&#x62B1;&#x6709;&#x6781;&#x5927;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x53BB;&#x89C2;&#x5BDF;&#x5468;&#x906D;&#x7684;&#x4E8B;&#x7269;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x517B;&#x6210;&#x4E86;&#x4E60;&#x60EF;&#xFF0C;&#x4E60;&#x60EF;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x7701;&#x53BB;&#x5F88;&#x591A;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x8BA9;&#x4F60;&#x5F88;&#x8F7B;&#x677E;&#x7684;&#x53BB;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x4ECE;&#x5730;&#x94C1;&#x7AD9;&#x51FA;&#x6765;&#x4E0D;&#x7528;&#x601D;&#x8003;&#x662F;&#x5F80;&#x5DE6;&#x8D70;&#x8FD8;&#x662F;&#x5F80;&#x53F3;&#x8D70;&#xFF0C;&#x4F60;&#x7684;&#x4E60;&#x60EF;&#x4F1A;&#x628A;&#x4F60;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x5E26;&#x56DE;&#x5BB6;&#x3002;</p>
<p>&#x65C5;&#x6E38;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x9664;&#x4E86;&#x65C5;&#x6E38;&#x4EE5;&#x5916;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#x8FD8;&#x6709;&#x975E;&#x5E38;&#x591A;&#x7684;&#x7C7B;&#x4F3C;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x5728;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4F60;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x90FD;&#x662F;&#x5B58;&#x5728;&#x7684;&#x3002;&#x5C0F;&#x5230;&#x5237;&#x7259;&#x6D17;&#x8138;&#xFF0C;&#x5927;&#x5230;&#x516C;&#x53F8;&#x51B3;&#x7B56;&#xFF0C;&#x90FD;&#x6216;&#x591A;&#x6216;&#x5C11;&#x7684;&#x6536;&#x5230;&#x4E60;&#x60EF;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5F88;&#x806A;&#x660E;&#x4E5F;&#x5F88;&#x61D2;&#xFF0C;&#x5B83;&#x5E2E;&#x6211;&#x4EEC;&#x517B;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5904;&#x5904;&#x8FDB;&#x884C;&#x601D;&#x8003;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x8DDF;&#x7740;&#x719F;&#x6089;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x80FD;&#x591F;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x5927;&#x8111;&#x7684;&#x806A;&#x660E;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5728;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x4EEC;&#x53D8;&#x5F97;&#x66F4;&#x8F7B;&#x677E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x806A;&#x660E;&#x4E5F;&#x4E3A;&#x6211;&#x4EEC;&#x8BBE;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x65E0;&#x5F62;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x4E0D;&#x7559;&#x610F;&#x53EF;&#x80FD;&#x90FD;&#x4E0D;&#x4F1A;&#x53BB;&#x6CE8;&#x610F;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FB9;&#x754C;&#x5185;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x201D;&#x5B89;&#x5168;&#x201D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x8DEF;&#x5F84;&#x5DF2;&#x7ECF;&#x88AB;&#x591A;&#x6B21;&#x8BC1;&#x660E;&#x8FC7;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;</p>
<p>&#x7136;&#x800C;&#x4E00;&#x6761;&#x201C;&#x5B89;&#x5168;&#x201D;&#x53EF;&#x884C;&#x7684;&#x8DEF;&#x5F84;&#x4E0D;&#x4EE3;&#x8868;&#x8FD9;&#x6761;&#x8DEF;&#x5F84;&#x662F;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5F53;&#x4E0B;&#x662F;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x4EE3;&#x8868;&#x5B83;&#x5728;&#x5916;&#x90E8;&#x6761;&#x4EF6;&#x53D8;&#x5316;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F9D;&#x7136;&#x662F;&#x6700;&#x4F18;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#x8FD9;&#x79CD;&#x5B89;&#x5168;&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5916;&#x754C;&#x7684;&#x6761;&#x4EF6;&#x4E0D;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E0D;&#x53D8;&#x3002;&#x800C;&#x4E14;&#x4E60;&#x60EF;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x60EF;&#x6027;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4E60;&#x60EF;&#x4F60;&#x575A;&#x6301;&#x7684;&#x8D8A;&#x4E45;&#x5B83;&#x7684;&#x60EF;&#x6027;&#x5C31;&#x8D8A;&#x5927;&#xFF0C;&#x4F60;&#x8981;&#x6539;&#x53D8;&#x5B83;&#x7684;&#x96BE;&#x5EA6;&#x53CA;&#x6240;&#x5E26;&#x6765;&#x7684;&#x75DB;&#x82E6;&#x4E5F;&#x5C31;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x7684;&#x7ED3;&#x8BBA;&#x662F;<strong>&#x8981;&#x9700;&#x8981;&#x7ECF;&#x5E38;&#x53BB;&#x300C;&#x754C;&#x5916;&#x300D;&#x770B;&#x770B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x968F;&#x65F6;&#x6539;&#x53D8;&#x8DEF;&#x5F84;&#x7684;&#x80FD;&#x529B;</strong>&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#x5C31;&#x5F15;&#x51FA;&#x4E86;&#x53E6;&#x5916;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8EAB;&#x5904;&#x4E8E;&#x8FB9;&#x754C;&#x91CC;&#x9762;&#x7684;&#x4EBA;&#x5982;&#x4F55;&#x53BB;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x8FB9;&#x754C;&#x3002;&#x90FD;&#x8BF4;&#x8981;Think out of box&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;box&#xFF1F;</li>
<li>&#x53D1;&#x73B0;&#x4EE5;&#x540E;&#x5230;&#x5916;&#x9762;&#x770B;&#x770B;&#xFF0C;&#x80AF;&#x5B9A;&#x4E0D;&#x80FD;&#x662F;&#x7B80;&#x5355;&#x5730;&#x770B;&#x770B;&#x5C31;&#x5B8C;&#x4E86;&#x3002;&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x7684;&#x5FC3;&#x6001;&#x53BB;&#x770B;&#x5F85;&#x754C;&#x5916;&#x7684;&#x4E8B;&#x7269;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x624D;&#x80FD;&#x591F;&#x62D3;&#x5BBD;&#x81EA;&#x5DF1;&#x7684;&#x8FB9;&#x754C;&#xFF1F;</li>
</ol>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5BB9;&#x6211;&#x518D;&#x60F3;&#x60F3;&#x3002;</p>
<center><em>== end of  file ==</em></center>  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">


  <div class="article-tags">
  
  <span></span> <a href="/tags/随想/">随想</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://zhengyi.me/2016/09/29/go-out-border/" data-title="去「界外」看看 | yi&#39;s weblog" data-tsina="null" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/10/05/udacity-responsive-web-design-notes/" title="[学习笔记] Udacity - Responsive Web Design Fundamentals?">
  <strong>上一篇：</strong><br/>
  <span>
  [学习笔记] Udacity - Responsive Web Design Fundamentals?</span>
</a>
</div>


<div class="next">
<a href="/2016/09/06/effective-cpp-reading-notes-5/"  title="《Effective C++》读书笔记(5)">
 <strong>下一篇：</strong><br/> 
 <span>《Effective C++》读书笔记(5)
</span>
</a>
</div>

</nav>

	

<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>11</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程语言/" title="编程语言">编程语言<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/编程语言/" title="编程语言">编程语言<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/随想/" title="随想">随想<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/Udacity/" title="Udacity">Udacity<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
          <li>
            
            	<a href="http://www.cnblogs.com/imjustice/" target="_blank" title="博客园主页">博客园主页</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>




<script type="text/javascript">

var disqus_shortname = '2power10';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
