
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta property="og:type" content="website">
<meta property="og:title" content="yi's weblog">
<meta property="og:url" content="http://zhengyi.me/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="yi's weblog">
<meta name="twitter:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/09/06/effective-cpp-reading-notes-5/" title="《Effective C++》读书笔记(5)" itemprop="url">《Effective C++》读书笔记(5)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-09-06T13:15:57.000Z" itemprop="datePublished"> 发表于 2016-09-06</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="4-&#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;"><a href="#4-&#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;" class="headerlink" title="4. &#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;"></a>4. &#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;</h2><h3 id="&#x6761;&#x6B3E;18&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;"><a href="#&#x6761;&#x6B3E;18&#xFF1A;&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;" class="headerlink" title="&#x6761;&#x6B3E;18&#xFF1A;&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;"></a>&#x6761;&#x6B3E;18&#xFF1A;&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;</h3><blockquote>
<ul>
<li>&#x597D;&#x7684;&#x501F;&#x53E3;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x88AB;&#x8BEF;&#x7528;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x4F60;&#x7684;&#x6240;&#x6709;&#x63A5;&#x53E3;&#x4E2D;&#x52AA;&#x529B;&#x8FBE;&#x6210;&#x8FD9;&#x4E9B;&#x6027;&#x8D28;&#x3002;</li>
<li>&#x201C;&#x4FC3;&#x8FDB;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x201D;&#x7684;&#x529E;&#x6CD5;&#x5305;&#x62EC;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x7684;&#x884C;&#x4E3A;&#x517C;&#x5BB9;&#x3002;</li>
<li>&#x201C;&#x963B;&#x6B62;&#x8BEF;&#x7528;&#x201D;&#x7684;&#x529E;&#x6CD5;&#x5305;&#x62EC;&#x5EFA;&#x7ACB;&#x65B0;&#x7C7B;&#x578B;&#x3001;&#x9650;&#x5236;&#x7C7B;&#x578B;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x675F;&#x7F1A;&#x5BF9;&#x8C61;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x6D88;&#x9664;&#x5BA2;&#x6237;&#x7684;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x8D23;&#x4EFB;&#x3002;</li>
<li>std::shared_ptr&#x652F;&#x6301;&#x5B9A;&#x5236;&#x578B;&#x5220;&#x9664;&#x5668;&#xFF08;custom deleter&#xFF09;&#x3002;&#x53EF;&#x9632;&#x8303;DLL&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x88AB;&#x7528;&#x6765;&#x81EA;&#x52A8;&#x89E3;&#x9664;&#x4E92;&#x65A5;&#x9501;&#x7B49;&#x7B49;&#x3002;</li>
</ul>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x6761;&#x6B3E;&#x7684;&#x601D;&#x60F3;&#x5176;&#x5B9E;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x88AB;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x8C03;&#x7528;&#xFF0C;&#x4F60;&#x90FD;&#x9700;&#x8981;&#x8003;&#x8651;&#x63A5;&#x53E3;&#x7684;&#x6613;&#x7528;&#x6027;&#x3002;&#x5373;&#x4F7F;&#x4E0D;&#x66B4;&#x9732;&#xFF0C;&#x826F;&#x597D;&#x7684;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x4E5F;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x4F5C;&#x8005;&#x63D0;&#x51FA;&#x7684;&#x8FD9;&#x51E0;&#x70B9;&#x53EA;&#x662F;&#x5728;C++&#x8FD9;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x4E9B;&#x5C0F;&#x70B9;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x6613;&#x7528;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4EC5;&#x4EC5;&#x505A;&#x5230;&#x8FD9;&#x51E0;&#x70B9;&#x8FD8;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x3002;</p>
<p><strong>&#x63A5;&#x53E3;&#x4E00;&#x81F4;&#x6027;</strong></p>
<p>&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#x9664;&#x975E;&#x6709;&#x5145;&#x5206;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x5426;&#x5219;&#x6700;&#x597D;&#x8BA9;&#x7C7B;&#x578B;&#x4E0E;&#x5185;&#x7F6E;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x884C;&#x4E3A;&#x5C3D;&#x91CF;&#x4E00;&#x81F4;&#x3002;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x4F7F;&#x7528;&#x8005;&#x9519;&#x8BEF;&#x4F7F;&#x7528;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8865;&#x5145;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x63D0;&#x4F9B;&#x4E00;&#x6574;&#x5957;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x63A5;&#x53E3;&#x76F8;&#x4E92;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x98CE;&#x683C;&#x3002;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#xFF1A;&#x51FD;&#x6570;&#x7684;&#x547D;&#x540D;&#x98CE;&#x683C;&#x3001;&#x51FD;&#x6570;&#x7684;&#x884C;&#x4E3A;&#x5C3D;&#x91CF;&#x4FDD;&#x6301;&#x7EDF;&#x4E00;&#x7684;&#x98CE;&#x683C;&#x3002;</p>
<p><strong>&#x9632;&#x6B62;&#x8BEF;&#x7528;</strong></p>
<blockquote>
<p>&#x4EFB;&#x4F55;&#x63A5;&#x53E3;&#x5982;&#x679C;&#x8981;&#x6C42;&#x5BA2;&#x6237;&#x5FC5;&#x987B;&#x8BB0;&#x5F97;&#x505A;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x6709;&#x7740;&#x201C;&#x4E0D;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x201D;&#x7684;&#x503E;&#x5411;&#xFF0C;&#x56E0;&#x4E3A;&#x5BA2;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x5FD8;&#x8BB0;&#x505A;&#x90A3;&#x4EF6;&#x4E8B;&#x3002;</p>
</blockquote>
<h3 id="&#x6761;&#x6B3E;19&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type"><a href="#&#x6761;&#x6B3E;19&#xFF1A;&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type" class="headerlink" title="&#x6761;&#x6B3E;19&#xFF1A;&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type"></a>&#x6761;&#x6B3E;19&#xFF1A;&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type</h3><blockquote>
<p>Class &#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x662F;type&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5728;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;type&#x4E4B;&#x524D;&#xFF0C;&#x786E;&#x4FDD;&#x9605;&#x8BFB;&#x4E86;&#x672C;&#x6761;&#x76EE;&#x7684;&#x6240;&#x6709;&#x8BA8;&#x8BBA;&#x4E3B;&#x9898;&#x3002;</p>
</blockquote>
<ul>
<li><strong>&#x65B0;type&#x7684;&#x5BF9;&#x8C61;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x88AB;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#xFF1F;</strong> &#x8FD9;&#x4E2A;&#x6D89;&#x53CA;&#x5230;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4EE5;&#x53CA;operator new, operator delete, operator new[], operator delete[]&#x3002;</li>
<li><strong>&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x5316;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x8D4B;&#x503C;&#x8BE5;&#x6709;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5DEE;&#x522B;&#xFF1F;</strong>&#x8FD9;&#x4E2A;&#x4E3B;&#x8981;&#x662F;&#x8981;&#x8003;&#x8651;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x7B26;&#x7684;&#x884C;&#x4E3A;&#x3002;</li>
<li><strong>&#x65B0;type&#x7684;&#x5BF9;&#x8C61;&#x5982;&#x679C;&#x88AB;passed by value&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF1F;</strong></li>
<li><strong>&#x4EC0;&#x4E48;&#x4E8B;&#x65B0;type&#x7684;&#x201C;&#x5408;&#x6CD5;&#x503C;&#x201D;&#xFF1F;</strong>&#x8FD9;&#x70B9;&#x4E3B;&#x8981;&#x662F;&#x8981;&#x6CE8;&#x610F;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x548C;&#x5408;&#x6CD5;&#x6027;&#x68C0;&#x67E5;&#x3002;</li>
<li><strong>&#x4F60;&#x7684;&#x65B0;type&#x9700;&#x8981;&#x914D;&#x5408;&#x67D0;&#x4E2A;&#x7EE7;&#x627F;&#x56FE;&#x7CFB;&#x5417;&#xFF1F;</strong>&#x5982;&#x679C;&#x4F60;&#x7EE7;&#x627F;&#x5176;&#x4ED6;&#x7684;&#x7C7B;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5B83;&#x4EEC;&#x7684;&#x51FD;&#x6570;virtual&#x548C;non-virtual&#x6027;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7C7B;&#x53EF;&#x80FD;&#x88AB;&#x7EE7;&#x627F;&#x5C31;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4F60;&#x58F0;&#x660E;&#x7684;&#x51FD;&#x6570;&#x2014;&#x2014;&#x5C24;&#x5176;&#x662F;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;</li>
<li><strong>&#x4F60;&#x7684;&#x65B0;type&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8F6C;&#x6362;&#xFF1F;</strong>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7C7B;&#x578B;&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;&#x5176;&#x4ED6;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5B9A;&#x4E49;&#x663E;&#x5F0F;&#x8F6C;&#x6362;&#x6216;&#x8005;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x7684;&#x51FD;&#x6570;&#x3002;</li>
<li><strong>&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x7B26;&#x548C;&#x51FD;&#x6570;&#x5BF9;&#x6B64;&#x65B0;type&#x800C;&#x8A00;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF1F;</strong>&#x53C2;&#x8003;&#x6761;&#x6B3E;23&#xFF0C;24&#xFF0C;26.</li>
<li><strong>&#x8C01;&#x8BE5;&#x53D6;&#x7528;&#x65B0;type&#x7684;&#x6210;&#x5458;&#xFF1F;</strong>&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x5224;&#x65AD;&#x54EA;&#x4E00;&#x4E9B;&#x6210;&#x5458;&#x4E3A;public&#xFF0C;&#x54EA;&#x4E2A;&#x4E3A;protected&#x3002;</li>
<li><strong>&#x4F60;&#x7684;&#x65B0;type&#x6709;&#x591A;&#x4E48;&#x4E00;&#x822C;&#x5316;&#xFF08;generic&#xFF09;&#xFF1F;</strong>&#x5982;&#x679C;&#x5F88;&#x4E00;&#x822C;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;class template&#x3002;</li>
<li><strong>&#x4F60;&#x771F;&#x7684;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x65B0;type&#x5427;&#xFF1F;</strong>&#x5982;&#x679C;&#x53EA;&#x662F;&#x5B9A;&#x4E49;&#x65B0;&#x7684;derived class&#x4EE5;&#x4FBF;&#x4E3A;&#x65E2;&#x6709;&#x7684;class&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x8BF4;&#x4E0D;&#x5B9A;&#x5355;&#x7EAF;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;non-member&#x51FD;&#x6570;&#x6216;template&#x66F4;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x76EE;&#x6807;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x56DE;&#x7B54;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019;&#x5C3D;&#x91CF;&#x7684;&#x53BB;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x8BBE;&#x8BA1;&#x51FA;&#x4E00;&#x4E2A;&#x6613;&#x7528;&#x5408;&#x7406;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;20&#x5B81;&#x4EE5;-pass-by-reference-to-const-&#x66FF;&#x6362;-pass-by-value"><a href="#&#x6761;&#x6B3E;20&#xFF1A;&#x5B81;&#x4EE5;-pass-by-reference-to-const-&#x66FF;&#x6362;-pass-by-value" class="headerlink" title="&#x6761;&#x6B3E;20&#xFF1A;&#x5B81;&#x4EE5; pass-by-reference-to-const &#x66FF;&#x6362; pass-by-value"></a>&#x6761;&#x6B3E;20&#xFF1A;&#x5B81;&#x4EE5; pass-by-reference-to-const &#x66FF;&#x6362; pass-by-value</h3><blockquote>
<ul>
<li>&#x5C3D;&#x91CF;&#x4EE5;pass-by-reference-to-const &#x66FF;&#x6362; pass-by-value&#x3002;&#x524D;&#x8005;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x641E;&#x7B11;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5207;&#x5272;&#x95EE;&#x9898;&#xFF08;slicing problem&#xFF09;&#x3002;</li>
<li>&#x4EE5;&#x4E0A;&#x89C4;&#x5219;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;STL&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x548C;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x3002;&#x5BF9;&#x4E8E;&#x5B83;&#x4EEC;&#x800C;&#x8A00;&#xFF0C;pass-by-value&#x5F80;&#x5F80;&#x6BD4;&#x8F83;&#x9002;&#x5F53;&#x3002;</li>
</ul>
</blockquote>
<p>C++&#x9ED8;&#x8BA4;&#x7684;&#x4F20;&#x9012;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x662F;by-value&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6709;&#x5F88;&#x591A;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x6216;&#x8005;&#x6709;&#x5F88;&#x6DF1;&#x7684;&#x7EE7;&#x627F;&#x7ED3;&#x6784;&#x3002;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x548C;&#x9500;&#x6BC1;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x7684;&#x5F00;&#x9500;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7528;pass by reference&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x80FD;&#x591F;&#x8282;&#x7701;&#x4E0B;&#x8FD9;&#x79CD;&#x5F00;&#x59CB;&#x3002;&#x52A0;&#x4E0A;const&#x662F;&#x907F;&#x514D;&#x5BF9;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;</p>
<p>Pass by value&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x5207;&#x5272;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x4EE5;pass-by-value&#x7684;&#x5F62;&#x5F0F;&#x4F20;&#x9012;&#x5230;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x5C06;&#x4F1A;&#x88AB;&#x5207;&#x5272;&#x800C;&#x5931;&#x53BB;&#x5B50;&#x7C7B;&#x7279;&#x6709;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x5931;&#x53BB;&#x591A;&#x6001;&#x6027;&#x3002;pass-by-reference&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;reference&#x5F80;&#x5F80;&#x4EE5;&#x6307;&#x9488;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x622A;&#x65AD;&#x5BF9;&#x8C61;&#x4E5F;&#x540C;&#x65F6;&#x4F1A;&#x4FDD;&#x6709;&#x591A;&#x6001;&#x6027;&#x3002;</p>
<p>&#x51B3;&#x5B9A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;pass by value&#x8FD8;&#x662F;pass by reference&#x7684;&#x4F9D;&#x636E;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#x6570;&#x91CF;&#xFF0C;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x5728;&#x62F7;&#x8D1D;&#x7684;&#x65F6;&#x5019;&#x662F;&#x5426;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6602;&#x8D35;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E9B;&#x4F8B;&#x5916;&#xFF0C;&#x5373;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;STL&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x548C;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916; pass-by-reference-to-const &#x4F18;&#x4E8E; pass-by-value&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;21&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference"><a href="#&#x6761;&#x6B3E;21&#xFF1A;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#xFF0C;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference" class="headerlink" title="&#x6761;&#x6B3E;21&#xFF1A;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#xFF0C;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference"></a>&#x6761;&#x6B3E;21&#xFF1A;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#xFF0C;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference</h3><blockquote>
<ul>
<li>&#x7EDD;&#x4E0D;&#x8981;&#x8FD4;&#x56DE;pointer&#x6216;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;local stack&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8FD4;&#x56DE;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;heap-allocated&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8FD4;&#x56DE;pointer&#x6216;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;local static&#x5BF9;&#x8C61;&#x800C;&#x6709;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
</ul>
</blockquote>
<p>&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;pointer&#x6216;&#x8005;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;local stack&#x5BF9;&#x8C61;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;local stack&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8FD4;&#x56DE;&#x7684;&#x90A3;&#x4E2A;&#x6307;&#x9488;&#x6216;&#x8005;&#x5F15;&#x7528;&#x5C06;&#x4F1A;&#x6307;&#x5411;&#x4E00;&#x5757;&#x88AB;&#x9500;&#x6BC1;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x6307;&#x5411;&#x4E00;&#x4E2A;heap-allocated&#x7684;&#x5BF9;&#x8C61;&#x4E5F;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x628A;&#x9500;&#x6BC1;&#x5BF9;&#x8C61;&#x7684;&#x4EFB;&#x52A1;&#x79FB;&#x4EA4;&#x7ED9;&#x4E86;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x7684;&#x4EBA;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4EBA;&#x4EEC;&#x4F1A;&#x5FD8;&#x8BB0;&#x3002;&#x6216;&#x8005;&#x8BF4;&#x6240;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x5E76;&#x6CA1;&#x6709;&#x8BA9;&#x4ED6;&#x6709;&#x673A;&#x4F1A;&#x53BB;&#x9500;&#x6BC1;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">const Rational&amp; operator * (const Rational&amp; lhs,</span><br><span class="line">							const Rational&amp; rhs) {</span><br><span class="line">	...</span><br><span class="line">	return *result;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">Rational w, x, y, z;</span><br><span class="line">w = x * y * z;</span><br></pre></td></tr></table></figure>
<p>&#x53EA;&#x6709;&#x5728;&#x7C7B;&#x4F3C;&#x4E8E;&#x5355;&#x4F8B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;static&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x6761;&#x6B3E;4&#x4E2D;FileSystem&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;22&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private"><a href="#&#x6761;&#x6B3E;22&#xFF1A;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private" class="headerlink" title="&#x6761;&#x6B3E;22&#xFF1A;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private"></a>&#x6761;&#x6B3E;22&#xFF1A;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private</h3><blockquote>
<ul>
<li>&#x5207;&#x8BB0;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private&#xFF0C;&#x8FD9;&#x53EF;&#x8D4B;&#x4E88;&#x5BA2;&#x6237;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3001;&#x53EF;&#x7EC6;&#x5FAE;&#x5212;&#x5206;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x3001;&#x5141;&#x8BFA;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x83B7;&#x5F97;&#x4FDD;&#x8BC1;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;class&#x4F5C;&#x8005;&#x4EE5;&#x5145;&#x5206;&#x7684;&#x5B9E;&#x73B0;&#x5F39;&#x6027;&#x3002;</li>
<li>protected &#x5E76;&#x4E0D;&#x6BD4;public&#x66F4;&#x5177;&#x5C01;&#x88C5;&#x6027;&#x3002;</li>
</ul>
</blockquote>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;public&#x4E0D;&#x597D;&#xFF1F;</strong></p>
<p>public&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x7834;&#x574F;&#x4E86;&#x7C7B;&#x7684;&#x5C01;&#x88C5;&#x6027;&#xFF0C;&#x5B83;&#x5C06;&#x6210;&#x5458;&#x76F4;&#x63A5;&#x66B4;&#x9732;&#x7ED9;&#x5BA2;&#x6237;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x672A;&#x6765;&#x4FEE;&#x6539;&#x5B57;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x4F7F;&#x7528;&#x8005;&#x3002;</p>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;protected&#x4E5F;&#x4E0D;&#x597D;&#xFF1F;</strong></p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x5373;<em>&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x5C01;&#x88C5;&#x6027;&#x4E0E;&#x201C;&#x5176;&#x5185;&#x5BB9;&#x6539;&#x53D8;&#x65F6;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x7834;&#x574F;&#x91CF;&#x201D;&#x6210;&#x53CD;&#x6BD4;&#x3002;</em>&#x5982;&#x679C;&#x4ECE;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x51FA;&#x53D1;&#x7684;&#x8BDD;&#xFF0C;protected&#x867D;&#x7136;&#x6BD4;public&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x597D;&#x592A;&#x591A;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x8BF4;&#x4F60;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x662F;&#x5BF9;&#x5916;&#x66B4;&#x9732;&#x7684;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x963B;&#x6B62;&#x7528;&#x6237;&#x7EE7;&#x627F;&#x4F60;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF08;C++&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x7C7B;&#x4F3C;&#x4E8E;final class&#x7684;&#x6982;&#x5FF5;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x8BF4;protected&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x4E5F;&#x4E0D;&#x597D;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/09/06/effective-cpp-reading-notes-5/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/08/15/effective-cpp-reading-notes-4/" title="《Effective C++》读书笔记(4)" itemprop="url">《Effective C++》读书笔记(4)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-08-15T13:06:32.000Z" itemprop="datePublished"> 发表于 2016-08-15</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="2-&#x6784;&#x9020;&#x6790;&#x6784;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"><a href="#2-&#x6784;&#x9020;-&#x6790;&#x6784;-&#x8D4B;&#x503C;&#x8FD0;&#x7B97;" class="headerlink" title="2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"></a>2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;</h2><h3 id="&#x6761;&#x6B3E;10&#x4EE4;-operator-&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;-reference-to-this"><a href="#&#x6761;&#x6B3E;10&#xFF1A;&#x4EE4;-operator-&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;-reference-to-this" class="headerlink" title="&#x6761;&#x6B3E;10&#xFF1A;&#x4EE4; operator= &#x8FD4;&#x56DE;&#x4E00;&#x4E2A; reference to *this"></a>&#x6761;&#x6B3E;10&#xFF1A;&#x4EE4; operator= &#x8FD4;&#x56DE;&#x4E00;&#x4E2A; reference to *this</h3><blockquote>
<ul>
<li>&#x4EE4;&#x8D4B;&#x503C;&#xFF08;assignment&#xFF09;&#x64CD;&#x4F5C;&#x7B26;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; reference to *this&#x3002;</li>
</ul>
</blockquote>
<p>&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF1A;</p>
<ol>
<li>&#x5141;&#x8BB8;&#x8FDE;&#x9501;&#x8D4B;&#x503C;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;<code>int x, y, z; x = y = z;</code></li>
<li>&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x88AB;&#x666E;&#x904D;&#x7684;&#x9075;&#x5B88;&#xFF08;&#x5305;&#x62EC;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x7684;&#x5F88;&#x591A;&#x7C7B;&#x578B;&#xFF09;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x7C7B;&#x7684;&#x884C;&#x4E3A;&#x4E0E;&#x5176;&#x4ED6;&#x7C7B;&#x4E00;&#x81F4;&#x6027;&#x3002;</li>
</ol>
<h3 id="&#x6761;&#x6B3E;11&#x5728;operator&#x4E2D;&#x5904;&#x7406;&#x81EA;&#x6211;&#x8D4B;&#x503C;"><a href="#&#x6761;&#x6B3E;11&#xFF1A;&#x5728;operator-&#x4E2D;&#x5904;&#x7406;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x201D;" class="headerlink" title="&#x6761;&#x6B3E;11&#xFF1A;&#x5728;operator=&#x4E2D;&#x5904;&#x7406;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x201D;"></a>&#x6761;&#x6B3E;11&#xFF1A;&#x5728;operator=&#x4E2D;&#x5904;&#x7406;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x201D;</h3><blockquote>
<ul>
<li>&#x786E;&#x4FDD;&#x5F53;&#x5BF9;&#x8C61;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x65F6;operator=&#x6709;&#x826F;&#x597D;&#x884C;&#x4E3A;&#x3002;&#x5176;&#x4E2D;&#x6280;&#x672F;&#x5305;&#x62EC;&#x6BD4;&#x8F83;&#x201C;&#x6765;&#x6E90;&#x5BF9;&#x8C61;&#x201D;&#x548C;&#x201C;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x201D;&#x7684;&#x5730;&#x5740;&#x3001;&#x7CBE;&#x5FC3;&#x5468;&#x5230;&#x7684;&#x8BED;&#x53E5;&#x987A;&#x5E8F;&#x3001;&#x4EE5;&#x53CA;copy-and-swap&#x3002;</li>
<li>&#x786E;&#x5B9A;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5176;&#x884C;&#x4E3A;&#x4E3A;&#x4ECD;&#x7136;&#x6B63;&#x786E;&#x3002;</li>
</ul>
</blockquote>
<p>&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x88AB;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">Widget w[];</span><br><span class="line">// some operation</span><br><span class="line">w[i] = w[j];	//w[i]&#x548C;w[j]&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;</span><br></pre></td></tr></table></figure></p>
<p>&#x53EF;&#x4EE5;&#x5728;operator= &#x64CD;&#x4F5C;&#x4E2D;&#x505A;&#x4E00;&#x4E0B;&#x7B80;&#x5355;&#x7684;&#x6307;&#x9488;&#x6BD4;&#x8F83;&#x6765;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x64CD;&#x4F5C;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">Widget&amp; Widget::operator=(const Widget&amp; rhs) {</span><br><span class="line">    if (this == &amp;rhs) return *this;</span><br><span class="line">    ...</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5728;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x4E2D;&#x505A;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x63A7;&#x5236;&#x903B;&#x8F91;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x8D77;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x5B89;&#x5168;&#x6027;&#x201D;&#x8FD8;&#x8981;&#x4FDD;&#x8BC1;&#x201C;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x6027;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x4F1A;&#x5728;&#x6761;&#x6B3E;xx&#x4E2D;&#x5177;&#x4F53;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;12&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;"><a href="#&#x6761;&#x6B3E;12&#xFF1A;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;" class="headerlink" title="&#x6761;&#x6B3E;12&#xFF1A;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;"></a>&#x6761;&#x6B3E;12&#xFF1A;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;</h3><blockquote>
<ul>
<li>Copying &#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x786E;&#x4FDD;&#x590D;&#x5236;&#x201C;&#x5BF9;&#x8C61;&#x5185;&#x7684;&#x6240;&#x6709;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x201D;&#x53CA;&#x201C;&#x6240;&#x6709;base class&#x6210;&#x5206;&#x201D;</li>
<li>&#x4E0D;&#x8981;&#x5C1D;&#x8BD5;&#x4EE5;&#x67D0;&#x4E2A;copying&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x53E6;&#x4E00;&#x4E2A;copying&#x51FD;&#x6570;&#x3002;&#x5E94;&#x8BE5;&#x5C06;&#x5171;&#x540C;&#x673A;&#x80FD;&#x653E;&#x8FDB;&#x7B2C;&#x4E09;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x5E76;&#x7531;&#x4E24;&#x4E2A;copying&#x51FD;&#x6570;&#x5171;&#x540C;&#x8C03;&#x7528;&#x3002;</li>
</ul>
</blockquote>
<p>copy&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;copy assignment&#x64CD;&#x4F5C;&#x7B26;&#x6211;&#x4EEC;&#x7EDF;&#x79F0;&#x4E3A;copying&#x51FD;&#x6570;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;copying&#x52A1;&#x5FC5;&#x8981;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x5B57;&#x6BB5;&#x90FD;&#x8FDB;&#x884C;&#x4E86;&#x590D;&#x5236;&#xFF0C;&#x540C;&#x4E8B;&#x5982;&#x679C;&#x6709;&#x57FA;&#x7C7B;&#x8981;&#x4FDD;&#x8BC1;&#x76F8;&#x5BF9;&#x5E94;&#x7684;copying&#x51FD;&#x6570;&#x88AB;&#x6B63;&#x786E;&#x5F97;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#x867D;&#x7136;&#x8BF4;copy&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;copy assignment&#x64CD;&#x4F5C;&#x7B26;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x4EE5;&#x67D0;&#x4E00;&#x4E2A;copying&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;copying&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x5E76;&#x4E0D;&#x5408;&#x7406;&#x3002;</p>
<h2 id="3-&#x8D44;&#x6E90;&#x7BA1;&#x7406;"><a href="#3-&#x8D44;&#x6E90;&#x7BA1;&#x7406;" class="headerlink" title="3. &#x8D44;&#x6E90;&#x7BA1;&#x7406;"></a>3. &#x8D44;&#x6E90;&#x7BA1;&#x7406;</h2><h3 id="&#x6761;&#x6B3E;13-&#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;"><a href="#&#x6761;&#x6B3E;13&#xFF1A;-&#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;" class="headerlink" title="&#x6761;&#x6B3E;13&#xFF1A; &#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;"></a>&#x6761;&#x6B3E;13&#xFF1A; &#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;</h3><blockquote>
<ul>
<li>&#x4E3A;&#x9632;&#x6B62;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;RAII&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x83B7;&#x5F97;&#x8D44;&#x6E90;&#x5E76;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x3002;</li>
<li>&#x4E24;&#x4E2A;&#x5E38;&#x88AB;&#x4F7F;&#x7528;&#x7684;RAII classes&#x5206;&#x522B;&#x662F;<code>tr1::shared_ptr</code>&#x548C;<code>auto_ptr</code>(C++ 11 &#x4E2D;&#x6709;<code>std::shared_ptr</code>&#x548C;<code>std::auto_ptr</code>)</li>
</ul>
</blockquote>
<p>&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x548C;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x5185;&#x5B58;/&#x8D44;&#x6E90;&#x5206;&#x914D;&#x5728;&#x5806;&#x4E0A;&#xFF0C;&#x88AB;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x63A7;&#x5236;&#x6D41;&#x79BB;&#x5F00;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x91CA;&#x653E;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5F15;&#x8D77;&#x7684;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x8D44;&#x6E90;&#x5305;&#x88C5;&#x6210;&#x5BF9;&#x8C61;&#x6765;&#x5B9E;&#x73B0;&#x5408;&#x7406;&#x7684;&#x91CA;&#x653E;&#x3002;</p>
<p>&#x201C;&#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#x201D; &#x901A;&#x5E38;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x201D;&#x8D44;&#x6E90;&#x53D6;&#x5F97;&#x65F6;&#x673A;&#x4FBF;&#x662F;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x673A;&#x201D;&#xFF08;<em>Resource Acquisition Is Initialization: RAII</em>&#xFF09;&#x3002;RAII&#x7684;&#x4E24;&#x4E2A;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF1A;</p>
<ul>
<li>&#x83B7;&#x5F97;&#x8D44;&#x6E90;&#x540E;&#x7ACB;&#x523B;&#x653E;&#x8FDB;&#x7BA1;&#x7406;&#x5BF9;&#x8C61;&#x5185;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5BF9;&#x8C61;&#x8FD0;&#x7528;&#x6790;&#x6784;&#x51FD;&#x6570;&#x786E;&#x4FDD;&#x8D44;&#x6E90;&#x5F97;&#x5230;&#x91CA;&#x653E;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x5B9A;&#x5236;RAII&#x7C7B;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x667A;&#x80FD;&#x6307;&#x9488;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4F5C;&#x4E3A;&#x7BA1;&#x7406;&#x5BF9;&#x8C61;&#x3002;</p>
<ul>
<li><code>auto_ptr</code> - <code>auto_ptr</code>&#x88AB;&#x9500;&#x6BC1;&#x65F6;&#x4F1A;&#x81EA;&#x52A8;&#x5220;&#x9664;&#x5B83;&#x6240;&#x6307;&#x4E4B;&#x7269;&#x3002;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x591A;&#x4E2A;<code>auto_ptr</code>&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#x4E00;&#x6B21;&#x4EE5;&#x4E0A;&#x3002;&#x53E6;&#x5916;&#x901A;&#x8FC7;copy&#x6784;&#x9020;&#x51FD;&#x6570;&#x6216;copy assignment&#x64CD;&#x4F5C;&#x7B26;&#x590D;&#x5236;&#x5B83;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x53D8;&#x6210;null&#x3002;</li>
<li><code>shared_ptr</code> -  <code>shared_ptr</code>&#x662F;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x539F;&#x7406;&#x7684;&#x667A;&#x80FD;&#x6307;&#x9488;&#x3002;&#x5B83;&#x80FD;&#x591F;&#x6301;&#x7EED;&#x8FFD;&#x8E2A;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x5BF9;&#x8C61;&#x6307;&#x5411;&#x67D0;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x7684;&#x590D;&#x5236;&#x884C;&#x4E3A;&#x4E5F;&#x770B;&#x4E0A;&#x53BB;&#x6B63;&#x5E38;&#x8BB8;&#x591A;&#x3002;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x65E0;&#x6CD5;&#x6253;&#x7834;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<h3 id="&#x6761;&#x6B3E;14&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;"><a href="#&#x6761;&#x6B3E;14&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;" class="headerlink" title="&#x6761;&#x6B3E;14&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;"></a>&#x6761;&#x6B3E;14&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;</h3><blockquote>
<ul>
<li>&#x590D;&#x5236;RAII&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x4E00;&#x5E76;&#x590D;&#x5236;&#x5B83;&#x6240;&#x7BA1;&#x7406;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x8D44;&#x6E90;&#x7684;copying&#x884C;&#x4E3A;&#x51B3;&#x5B9A;RAII&#x5BF9;&#x8C61;&#x7684;copying&#x884C;&#x4E3A;&#x3002;</li>
<li>&#x666E;&#x904D;&#x800C;&#x5E38;&#x89C1;&#x7684;RAII class copying&#x884C;&#x4E3A;&#x662F;&#xFF1A;&#x7981;&#x6B62;copying&#x3001;&#x65BD;&#x884C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#xFF08;reference counting&#xFF09;&#x3002;&#x4E0D;&#x8FC7;&#x5176;&#x4ED6;&#x884C;&#x4E3A;&#x4E5F;&#x90FD;&#x53EF;&#x80FD;&#x88AB;&#x5B9E;&#x73B0;&#x3002;</li>
</ul>
</blockquote>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5B9A;&#x5236;RAII&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x9700;&#x6C42;&#x6765;&#x63A7;&#x5236;&#x5176;&#x62F7;&#x8D1D;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4E0D;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x201C;&#x4E0D;&#x6109;&#x5FEB;&#x201D;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x62F7;&#x8D1D;&#x7684;&#x884C;&#x4E3A;&#x57FA;&#x672C;&#x6709;&#x4E0B;&#x9762;&#x51E0;&#x79CD;&#xFF1A;</p>
<ul>
<li><p><strong>&#x7981;&#x6B62;&#x590D;&#x5236;&#x3002;</strong> &#x5F88;&#x591A;&#x60C5;&#x51B5;&#x5BF9;RAII&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x590D;&#x5236;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4E00;&#x4E2A;Lock&#x7C7B;&#xFF0C;&#x4FDD;&#x5B58;&#x7740;&#x4E00;&#x4E2A;&#x9501;&#x3002;&#x5408;&#x7406;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x7981;&#x6B62;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x590D;&#x5236;&#x884C;&#x4E3A;&#x3002;</p>
</li>
<li><p><strong>&#x5BF9;&#x5E95;&#x5C42;&#x8D44;&#x6E90;&#x796D;&#x51FA;&#x201C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#x201D;&#x3002;</strong> &#x5982;&#x679C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4FDD;&#x6709;&#x8D44;&#x6E90;&#xFF0C;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x8005;&#x88AB;&#x9500;&#x6BC1;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x5C31;&#x5E94;&#x8BE5;&#x5728;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6765;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>shared_ptr</code>&#x6765;&#x505A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;</p>
</li>
<li><p><strong>&#x590D;&#x5236;&#x5E95;&#x90E8;&#x8D44;&#x6E90;&#x3002;</strong>  &#x62F7;&#x8D1D;&#x65F6;&#x5C06;&#x5185;&#x90E8;&#x7684;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6DF1;&#x5C42;&#x62F7;&#x8D1D;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x88AB;&#x590D;&#x5236;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x8981;&#x590D;&#x5236;&#x6307;&#x5411;&#x5185;&#x5B58;&#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5E94;&#x8BE5;&#x590D;&#x5236;&#x5BF9;&#x5E94;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5185;&#x5B58;&#x3002;</p>
</li>
<li><p><strong>&#x8F6C;&#x79FB;&#x5E95;&#x5C42;&#x8D44;&#x6E90;&#x7684;&#x62E5;&#x6709;&#x6743;</strong> &#x5728;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#x7684;&#x573A;&#x5408;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;RAII&#x5BF9;&#x8C61;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x5F53;&#x88AB;&#x590D;&#x5236;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8D44;&#x6E90;&#x7684;&#x62E5;&#x6709;&#x6743;&#x5C06;&#x4F1A;&#x8FDB;&#x884C;&#x8F6C;&#x79FB;&#x3002;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x8DDF;<code>auto_ptr</code>&#x7684;&#x884C;&#x4E3A;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
</li>
</ul>
<h3 id="&#x6761;&#x6B3E;15&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;"><a href="#&#x6761;&#x6B3E;15&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;" class="headerlink" title="&#x6761;&#x6B3E;15&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;"></a>&#x6761;&#x6B3E;15&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;</h3><blockquote>
<ul>
<li>APIs &#x5F80;&#x5F80;&#x8981;&#x6C42;&#x8BBF;&#x95EE;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#xFF08;raw resources&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E00;&#x4E2A;RAII classes&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x201C;&#x53D6;&#x5F97;&#x5176;&#x6240;&#x7BA1;&#x7406;&#x4E4B;&#x8D44;&#x6E90;&#x201D;&#x7684;&#x529E;&#x6CD5;&#x3002;</li>
<li>&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#x53EF;&#x80FD;&#x7ECF;&#x7531;&#x663E;&#x5F0F;&#x8F6C;&#x6362;&#x6216;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#x663E;&#x793A;&#x8F6C;&#x6362;&#x6BD4;&#x8F83;&#x5B89;&#x5168;&#xFF0C;&#x4F46;&#x662F;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x5BF9;&#x5BA2;&#x6237;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x3002;</li>
</ul>
</blockquote>
<p>&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x7684;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x770B;&#x4E0A;&#x53BB;&#x7834;&#x574F;&#x4E86;&#x5C01;&#x88C5;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x8BBE;&#x8BA1;&#x7684;&#x521D;&#x8877;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;&#xFF0C;&#x5E76;&#x975E;&#x5BF9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x5B8C;&#x5168;&#x7684;&#x5C01;&#x88C5;&#x3002;&#x6240;&#x4EE5;&#x63D0;&#x4F9B;&#x83B7;&#x53D6;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x7684;&#x505A;&#x6CD5;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x663E;&#x5F0F;&#x548C;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>&#x663E;&#x5F0F;&#x8F6C;&#x6362;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">class Font {</span><br><span class="line">public:</span><br><span class="line">    ...</span><br><span class="line">    FontHandle get() const { return f; }</span><br><span class="line">    ...</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p><strong>&#x9690;&#x5F0F;&#x8F6C;&#x6362;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">class Font {</span><br><span class="line">public:</span><br><span class="line">    ...</span><br><span class="line">    operator FontHandle() const { return f; }</span><br><span class="line">    ...</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x867D;&#x7136;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x90FD;&#x53EF;&#x884C;&#xFF0C;&#x4F46;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x663E;&#x5F0F;&#x7684;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5F88;&#x591A;&#x4E0D;&#x5C0F;&#x5FC3;&#x8FDB;&#x884C;&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x663E;&#x5F0F;&#x7684;&#x8C03;&#x7528;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;16&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;"><a href="#&#x6761;&#x6B3E;16&#xFF1A;&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;" class="headerlink" title="&#x6761;&#x6B3E;16&#xFF1A;&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;"></a>&#x6761;&#x6B3E;16&#xFF1A;&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;</h3><blockquote>
<p>&#x5982;&#x679C;&#x4F60;&#x5728;new&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;[]&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x76F8;&#x5BF9;&#x5E94;&#x7684;delete&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4E5F;&#x4F7F;&#x7528;[]&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;new&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4E0D;&#x4F7F;&#x7528;[]&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x5728;&#x76F8;&#x5BF9;&#x5E94;&#x7684;delete&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;[]</p>
</blockquote>
<h3 id="&#x6761;&#x6B3E;17&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;"><a href="#&#x6761;&#x6B3E;17&#xFF1A;&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;" class="headerlink" title="&#x6761;&#x6B3E;17&#xFF1A;&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;"></a>&#x6761;&#x6B3E;17&#xFF1A;&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;</h3><blockquote>
<p>&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x4E8E;&#x667A;&#x80FD;&#x6307;&#x9488;&#x5185;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4E00;&#x65E6;&#x5F02;&#x5E38;&#x88AB;&#x629B;&#x51FA;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x96BE;&#x4EE5;&#x5BDF;&#x89C9;&#x7684;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#x3002;</p>
</blockquote>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">int priority();</span><br><span class="line">void processWidget(std::shared_ptr&lt;Widget&gt; pw, int p);</span><br><span class="line"></span><br><span class="line">// Bad</span><br><span class="line">processWidget(std::shared_ptr&lt;Widget&gt;(new Widget), priority());</span><br><span class="line"></span><br><span class="line">// Good</span><br><span class="line">std::shared_ptr&lt;Widget&gt; pw(new Widget)</span><br><span class="line">processWidget(pw, priority());</span><br></pre></td></tr></table></figure>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6709;&#x95EE;&#x9898;&#xFF1F;&#x56E0;&#x4E3A;&#x5728;C++&#x7F16;&#x8BD1;&#x5668;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4EE5;&#x4E0B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<ol>
<li>&#x6267;&#x884C;&#x201D;new Widget&#x201D;</li>
<li>&#x8C03;&#x7528;priority()</li>
<li>&#x8C03;&#x7528;std::shared_ptr&#x6784;&#x9020;&#x51FD;&#x6570;</li>
</ol>
<p>&#x5982;&#x679C;&#x7B2C;&#x4E8C;&#x90E8;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;&#x4E00;&#x6B65;&#x7533;&#x8BF7;&#x51FA;&#x6765;&#x7684;&#x8D44;&#x6E90;&#x8FD8;&#x672A;&#x653E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;&#x5185;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x4EBA;&#x53BB;&#x91CA;&#x653E;&#x5B83;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x9020;&#x6210;&#x4E86;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/08/15/effective-cpp-reading-notes-4/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/07/06/effective-cpp-reading-notes-3/" title="《Effective C++》读书笔记(3)" itemprop="url">《Effective C++》读书笔记(3)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-07-06T13:13:10.000Z" itemprop="datePublished"> 发表于 2016-07-06</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="2-&#x6784;&#x9020;&#x6790;&#x6784;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"><a href="#2-&#x6784;&#x9020;-&#x6790;&#x6784;-&#x8D4B;&#x503C;&#x8FD0;&#x7B97;" class="headerlink" title="2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"></a>2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;</h2><h3 id="&#x6761;&#x6B3E;05&#x4E86;&#x89E3;c&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;"><a href="#&#x6761;&#x6B3E;05&#xFF1A;&#x4E86;&#x89E3;C-&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;" class="headerlink" title="&#x6761;&#x6B3E;05&#xFF1A;&#x4E86;&#x89E3;C++&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;"></a>&#x6761;&#x6B3E;05&#xFF1A;&#x4E86;&#x89E3;C++&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;</h3><blockquote>
<p>&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x6697;&#x81EA;&#x4E3A;class&#x521B;&#x5EFA;<em>default</em>&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;<em>copy</em>&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;<em>copy assignment</em>&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x4EE5;&#x53CA;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;</p>
</blockquote>
<p>&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5565;&#x4E5F;&#x6CA1;&#x6709;&#x7684;&#x7C7B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">class Empty { }</span><br></pre></td></tr></table></figure>
<p>&#x7F16;&#x8BD1;&#x5668;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5E2E;&#x4F60;&#x751F;&#x6210;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">class Empty {</span><br><span class="line">public:</span><br><span class="line">  Empty() {...}     //&#x9ED8;&#x8BA4;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">  Empty(const Empty&amp; rhs) {...} //&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">  ~Empty(){...}     //&#x6790;&#x6784;&#x51FD;&#x6570;</span><br><span class="line">  Empty&amp; operator=(const Empty&amp; rhs) {...} // copy assignment&#x64CD;&#x4F5C;&#x7B26;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x662F;&#x5426;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x53D6;&#x51B3;&#x4E8E;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x662F;&#x5426;&#x9700;&#x8981;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5C31;&#x7528;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">Empty e1;		//&#x9ED8;&#x8BA4;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">				//&#x6790;&#x6784;&#x51FD;&#x6570;</span><br><span class="line">Empty e2(e1);	//&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">e2 = e1;		//copy assignment&#x64CD;&#x4F5C;&#x7B26;</span><br></pre></td></tr></table></figure>
<h3 id="&#x6761;&#x6B3E;06&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;"><a href="#&#x6761;&#x6B3E;06&#xFF1A;&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;" class="headerlink" title="&#x6761;&#x6B3E;06&#xFF1A;&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;"></a>&#x6761;&#x6B3E;06&#xFF1A;&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;</h3><blockquote>
<ul>
<li>&#x4E3A;&#x9A73;&#x56DE;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#xFF08;&#x6697;&#x81EA;&#xFF09;&#x63D0;&#x4F9B;&#x7684;&#x673A;&#x80FD;&#xFF0C;&#x53EF;&#x5C06;&#x76F8;&#x5E94;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E3A;private&#x5E76;&#x4E14;&#x4E0D;&#x4E88;&#x5B9E;&#x73B0;&#x3002;&#x4F7F;&#x7528;&#x50CF;<code>Uncopyable</code>&#x8FD9;&#x6837;&#x7684;base class&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x505A;&#x6CD5;&#x3002;</li>
</ul>
</blockquote>
<p>&#x6B63;&#x5982;&#x6761;&#x6B3E;5&#x4E2D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x663E;&#x793A;&#x5B9A;&#x4E49;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x9ED8;&#x8BA4;&#x4F1A;&#x4E3A;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x3002;&#x800C;&#x5728;&#x67D0;&#x4E00;&#x4E9B;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x6240;&#x5E26;&#x6765;&#x7684;&#x884C;&#x4E3A;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x5E94;&#x8BE5;&#x628A;&#x4F60;&#x60F3;&#x8981;&#x9690;&#x85CF;&#x7684;&#x65B9;&#x6CD5;&#x58F0;&#x660E;&#x4E3A;private&#x5E76;&#x4E0D;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x6837;&#x4EFB;&#x4F55;&#x5C1D;&#x8BD5;&#x53BB;&#x4F7F;&#x7528;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x9519;&#x8BEF;&#x3002;</p>
<p><strong><em>&#x4EC0;&#x4E48;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF1F;</em></strong></p>
<ul>
<li>private &#x6784;&#x9020;&#x51FD;&#x6570;<br>&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x591F;&#x968F;&#x610F;&#x7684;&#x81EA;&#x5DF1;&#x53BB;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3002;</li>
<li>private &#x6790;&#x6784;&#x51FD;&#x6570;<br>&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x6765;&#x7BA1;&#x7406;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4F60;&#x7684;&#x5B9E;&#x4F8B;&#x4F7F;&#x7528;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;0&#x5219;&#x4E0D;&#x80FD;&#x591F;&#x6790;&#x6784;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;Acquire&#xFF0C;Release&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x679C;&#x53EA;&#x662F;reference count&#x7684;&#x8BDD;&#xFF0C;&#x5229;&#x7528;shared_ptr&#x4E5F;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x3002;<br>&#x53C2;&#x8003;&#x94FE;&#x63A5;&#xFF1A;<a href="https://blogs.msdn.microsoft.com/larryosterman/2005/07/01/private-destructors/" target="_blank" rel="external">Private Destructors</a></li>
<li>private &#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;copy assignment &#x64CD;&#x4F5C;&#x7B26;<br>&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x53EF;&#x62F7;&#x8D1D;&#x7684;&#x65F6;&#x5019;&#x3002;<br>Example: <figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">Class Uncopyable {</span><br><span class="line">...</span><br><span class="line">private:</span><br><span class="line">    Uncopyable(const Uncopyable&amp;);</span><br><span class="line">    ~Uncopyable&amp; operator=(const Uncopyable&amp;);</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
</li>
</ul>
<h3 id="&#x6761;&#x6B3E;07&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;"><a href="#&#x6761;&#x6B3E;07&#xFF1A;&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;" class="headerlink" title="&#x6761;&#x6B3E;07&#xFF1A;&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;"></a>&#x6761;&#x6B3E;07&#xFF1A;&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;</h3><blockquote>
<ul>
<li>polymoriphic&#xFF08;&#x5E26;&#x591A;&#x6001;&#x6027;&#x8D28;&#x7684;&#xFF09;base classes&#x5E94;&#x8BE5;&#x58F0;&#x660E;&#x4E00;&#x4E2A;virtual&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;class&#x5E26;&#x6709;&#x4EFB;&#x4F55;virtual&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5C31;&#x5E94;&#x8BE5;&#x62E5;&#x6709;&#x4E00;&#x4E2A;virtual&#x6790;&#x6784;&#x51FD;&#x6570;</li>
<li>Classes&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x7684;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x4F5C;&#x4E3A;base classes&#x4F7F;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x5177;&#x5907;&#x591A;&#x6001;&#x6027;&#xFF08;polymorphically&#xFF09;&#xFF0C;&#x5C31;&#x4E0D;&#x8BE5;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;</li>
</ul>
</blockquote>
<p><strong><em>&#x4E3A;&#x4EC0;&#x4E48;&#x5E26;&#x6709;&#x591A;&#x6001;&#x6027;&#x8D28;&#x7684;&#x57FA;&#x7C7B;&#x5E94;&#x8BE5;&#x58F0;&#x660E;&#x4E00;&#x4E2A;virtual&#x6790;&#x6784;&#x51FD;&#x6570;&#xFF1F;</em></strong></p>
<p>&#x5E26;&#x6709;&#x591A;&#x6001;&#x6027;&#x8D28;&#x7684;&#x57FA;&#x7C7B;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x57FA;&#x7C7B;&#x7684;&#x6307;&#x9488;&#x53EF;&#x80FD;&#x5B58;&#x653E;&#x7740;&#x5B50;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5982;&#x679C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x6CA1;&#x6709;&#x58F0;&#x660E;&#x4E3A;virtual&#x7684;&#x8BDD;&#xFF0C;delete&#x4E00;&#x4E2A;&#x57FA;&#x7C7B;&#x6307;&#x9488;&#x4E0D;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x7684;&#x8C03;&#x7528;&#x5230;&#x5B50;&#x7C7B;&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4F1A;&#x9020;&#x6210;&#x8D44;&#x6E90;&#x7684;&#x6CC4;&#x9732;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x60F3;&#x8BA9;&#x522B;&#x7684;&#x7C7B;&#x7EE7;&#x627F;&#xFF0C;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7EE7;&#x627F;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x8D44;&#x6E90;&#x7684;&#x6CC4;&#x9732;&#x3002;&#x56E0;&#x4E3A;C++&#x5728;&#x8BED;&#x8A00;&#x5C42;&#x9762;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x4E8E;C# seal&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x675C;&#x7EDD;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E0D;&#x662F;virtual&#x7684;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x53BB;&#x7EE7;&#x627F;&#x5B83;&#x3002;</p>
<p>&#x53CD;&#x8FC7;&#x6765;&#x770B;&#x5C31;&#x66F4;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x662F;&#x4F5C;&#x4E3A;&#x57FA;&#x7C7B;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5B83;&#x7684;&#x6307;&#x9488;&#x4E0D;&#x53EF;&#x80FD;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x90A3;&#x4E48;&#x58F0;&#x660E;&#x6210;virtual&#x7684;&#x5C31;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5FC5;&#x8981;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x56E0;&#x4E3A;virtual&#x800C;&#x589E;&#x957F;&#x4E86;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;08&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;"><a href="#&#x6761;&#x6B3E;08&#xFF1A;&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;" class="headerlink" title="&#x6761;&#x6B3E;08&#xFF1A;&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;"></a>&#x6761;&#x6B3E;08&#xFF1A;&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;</h3><blockquote>
<ul>
<li>&#x6790;&#x6784;&#x51FD;&#x6570;&#x7EDD;&#x5BF9;&#x4E0D;&#x8981;&#x5410;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x88AB;&#x6790;&#x6784;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x6355;&#x6349;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#xFF0C;&#x7136;&#x540E;&#x541E;&#x4E0B;&#x5B83;&#x4EEC;&#xFF08;&#x4E0D;&#x4F20;&#x64AD;&#xFF09;&#x6216;&#x8005;&#x7ED3;&#x675F;&#x7A0B;&#x5E8F;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5BA2;&#x6237;&#x9700;&#x8981;&#x5BF9;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x51FD;&#x6570;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x90A3;&#x4E48;class&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x51FD;&#x6570;&#xFF08;&#x800C;&#x975E;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#xFF09;&#x6267;&#x884C;&#x8BE5;&#x64CD;&#x4F5C;&#x3002;</li>
</ul>
</blockquote>
<p><strong><em>&#x4E3A;&#x4EC0;&#x4E48;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x4E0D;&#x597D;&#xFF1F;</em></strong></p>
<ol>
<li>&#x6790;&#x6784;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x5730;&#x65B9;&#x4E0D;&#x597D;&#x63A7;&#x5236;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x597D;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x6790;&#x6784;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x5BF9;&#x5F02;&#x5E38;&#x8FDB;&#x884C;&#x6355;&#x6349;&#x3002;&#xFF08;&#x81EA;&#x5DF1;&#x8865;&#x5145;&#x7684;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x6240;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x672A;&#x5904;&#x7406;&#x4F1A;&#x5BFC;&#x81F4;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x3002;</li>
</ol>
<p>&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x6709;&#x53EF;&#x80FD;&#x6267;&#x884C;&#x5230;&#x4E00;&#x4E9B;&#x4F1A;&#x629B;&#x5F02;&#x5E38;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6355;&#x6349;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x5F02;&#x5E38;&#x53EF;&#x4EE5;&#x5FCD;&#x53D7;&#x5219;&#x9ED8;&#x9ED8;&#x541E;&#x4E0B;&#xFF0C;&#x8BB0;&#x4E0B;log&#xFF0C;&#x5426;&#x5219;&#x8BB0;&#x4E0B;log&#x7136;&#x540E;&#x76F4;&#x63A5;&#x7ED3;&#x675F;&#x7A0B;&#x5E8F;&#x3002;</p>
<p><strong><em>&#x6709;&#x4EC0;&#x4E48;&#x66F4;&#x597D;&#x7684;&#x529E;&#x6CD5;&#xFF1F;</em></strong></p>
<p>&#x5982;&#x679C;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x91CC;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x67D0;&#x4E2A;&#x53EF;&#x80FD;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x65B9;&#x6CD5;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x6837;&#x5B50;&#x7528;&#x6237;&#x5C31;&#x6709;&#x673A;&#x4F1A;&#x81EA;&#x5DF1;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br></pre></td><td class="code"><pre><span class="line">class DBConn {</span><br><span class="line">public:</span><br><span class="line">   ~DBConn() {</span><br><span class="line">     db.close();   //bad, may throw exception</span><br><span class="line">   }</span><br><span class="line">private:</span><br><span class="line">  DBConnection db;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">class DBConn {</span><br><span class="line">public:</span><br><span class="line">   void close() {</span><br><span class="line">     db.close();</span><br><span class="line">     closed = true;</span><br><span class="line">   }</span><br><span class="line">   ~DBConn() {</span><br><span class="line">     if (!closed) {</span><br><span class="line">       try {</span><br><span class="line">	     db.close();   //good, catch exception and provide normal method to close</span><br><span class="line">	   }</span><br><span class="line">	   catch (...) {</span><br><span class="line">		   //log</span><br><span class="line">	   }</span><br><span class="line">     }</span><br><span class="line">   }</span><br><span class="line">private:</span><br><span class="line">  DBConnection db;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/07/06/effective-cpp-reading-notes-3/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/06/28/effective-cpp-reading-notes-2/" title="《Effective C++》读书笔记(2)" itemprop="url">《Effective C++》读书笔记(2)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-06-28T13:55:42.000Z" itemprop="datePublished"> 发表于 2016-06-28</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h3 id="&#x6761;&#x6B3E;4&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x88AB;&#x4F7F;&#x7528;&#x524D;&#x5DF2;&#x5148;&#x88AB;&#x521D;&#x59CB;&#x5316;"><a href="#&#x6761;&#x6B3E;4&#xFF1A;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x88AB;&#x4F7F;&#x7528;&#x524D;&#x5DF2;&#x5148;&#x88AB;&#x521D;&#x59CB;&#x5316;" class="headerlink" title="&#x6761;&#x6B3E;4&#xFF1A;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x88AB;&#x4F7F;&#x7528;&#x524D;&#x5DF2;&#x5148;&#x88AB;&#x521D;&#x59CB;&#x5316;"></a>&#x6761;&#x6B3E;4&#xFF1A;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x88AB;&#x4F7F;&#x7528;&#x524D;&#x5DF2;&#x5148;&#x88AB;&#x521D;&#x59CB;&#x5316;</h3><blockquote>
<ul>
<li>&#x4E3A;&#x5185;&#x7F6E;&#x578B;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x624B;&#x5DE5;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;C++&#x4E0D;&#x4FDD;&#x8BC1;&#x521D;&#x59CB;&#x5316;&#x5B83;&#x4EEC;&#x3002;</li>
<li>&#x6784;&#x9020;&#x51FD;&#x6570;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x6210;&#x5458;&#x521D;&#x503C;&#x5217;&#xFF08;member initialization list&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x672C;&#x4F53;&#x5185;&#x4F7F;&#x7528;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#xFF08;assignment&#xFF09;&#x3002;&#x521D;&#x503C;&#x5217;&#x5217;&#x51FA;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x8D77;&#x6392;&#x5E8F;&#x6B21;&#x5E8F;&#x5E94;&#x8BE5;&#x548C;&#x5B83;&#x4EEC;&#x5728;class&#x4E2D;&#x7684;&#x58F0;&#x660E;&#x6B21;&#x5E8F;&#x76F8;&#x540C;&#x3002;</li>
<li>&#x4E3A;&#x4E86;&#x514D;&#x9664;&#x201C;&#x8DE8;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x4E4B;&#x521D;&#x59CB;&#x5316;&#x6B21;&#x5E8F;&#x201D;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x4EE5;local static&#x5BF9;&#x8C61;&#x66FF;&#x6362;non-local static&#x5BF9;&#x8C61;&#x3002;</li>
</ul>
</blockquote>
<p>&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x6307;&#x7684;&#x662F;C++&#x81EA;&#x5E26;&#x7684;&#x7C7B;&#x4F3C;&#x4E8E;int&#xFF0C;double&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5176;&#x503C;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x660E;&#x786E;&#x7684;&#x884C;&#x4E3A;&#xFF08;undefined behavior&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x8981;&#x4FDD;&#x8BC1;&#x8BFB;&#x53D6;&#x5185;&#x7F6E;&#x5BF9;&#x8C61;&#x524D;&#xFF0C;&#x5176;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x8FC7;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">int x; 		// bad code</span><br><span class="line">int x = 0; 	// good code</span><br></pre></td></tr></table></figure>
<p>&#x5BF9;&#x4E8E;&#x975E;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x7684;&#x4EFB;&#x52A1;&#x5219;&#x662F;&#x7531;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8D1F;&#x8D23;&#x7684;&#x3002;&#x5305;&#x62EC;STL&#x5E93;&#x91CC;&#x7684;&#x4E00;&#x4E9B;&#x7C7B;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">std::string str;		//it&apos;s ok</span><br><span class="line">std::string str = &quot;&quot;; 	//it&apos;s also ok</span><br><span class="line">Class1 obj;</span><br></pre></td></tr></table></figure>
<p><strong>&#x7C7B;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x521D;&#x59CB;&#x5316; vs &#x8D4B;&#x503C;</strong></p>
<p>&#x7C7B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x5728;&#x8FDB;&#x5165;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x5DF2;&#x7ECF;&#x88AB;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5185;&#x8FDB;&#x884C;&#x201D;&#x521D;&#x59CB;&#x5316;&#x201C;&#x7684;&#x7684;&#x8BDD;&#x5176;&#x5B9E;&#x662F;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#xFF0C;&#x4F1A;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">class Entry {</span><br><span class="line">public:</span><br><span class="line">	Entry();</span><br><span class="line">private:</span><br><span class="line">	std::string name;</span><br><span class="line">	int value;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">Entry::Entry() {</span><br><span class="line">	name = &quot;default&quot;; //</span><br><span class="line">	value = 0;        // not good </span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">Entry::Entry()</span><br><span class="line">  : name(&quot;default&quot;)</span><br><span class="line">  , value(0)</span><br></pre></td></tr></table></figure>
<p>&#x81F3;&#x4E8E;&#x4F5C;&#x8005;&#x63D0;&#x5230;&#x7684;&#x521D;&#x503C;&#x5217;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x9700;&#x8981;&#x4E0E;class&#x5185;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x7684;&#x987A;&#x5E8F;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x662F;&#x56E0;&#x4E3A;c++&#x603B;&#x662F;&#x6309;&#x7167;class&#x5185;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x7684;&#x987A;&#x5E8F;&#x5BF9;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5E26;&#x6765;&#x8FF7;&#x60D1;&#x4EE5;&#x53CA;&#x5BB9;&#x6613;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6F0F;&#x6389;&#x53D8;&#x91CF;&#x672A;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x6700;&#x597D;&#x5C06;&#x521D;&#x503C;&#x5217;&#x987A;&#x5E8F;&#x4E0E;class&#x5185;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x987A;&#x5E8F;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p>
<p><strong>non-local static &#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x5316;</strong></p>
<p>&#x4E0D;&#x540C;<strong>&#x7F16;&#x8BD1;&#x5355;&#x5143;</strong>&#x5185;&#x5B9A;&#x4E49;&#x7684;<strong>non-local static</strong>&#x5BF9;&#x8C61;&#x521D;&#x59CB;&#x5316;&#x6B21;&#x5E8F;&#x672A;&#x5B9A;&#x4E49;&#x3002;</p>
<p><em>&#x7F16;&#x8BD1;&#x5355;&#x5143;</em></p>
<p>&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x662F;&#x6307;&#x4EA7;&#x51FA;&#x5355;&#x4E00;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#xFF08;object file&#xFF09;&#x7684;&#x90A3;&#x4E9B;&#x6E90;&#x7801;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x5B83;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x52A0;&#x4E0A;&#x5176;&#x6240;&#x542B;&#x5165;&#x7684;&#x5934;&#x6587;&#x4EF6;&#x3002;</p>
<p><em>non-local static &#x5BF9;&#x8C61;</em></p>
<p>&#x9664;&#x4E86;&#x5B9A;&#x4E49;&#x5728;&#x51FD;&#x6570;&#x5185;&#x7684;static&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x4ED6;&#x7684;static&#x53D8;&#x91CF;&#x5747;&#x662F;non-local static&#x5BF9;&#x8C61;&#xFF0C;&#x5305;&#x62EC;global&#x5BF9;&#x8C61;&#x3001;&#x5B9A;&#x4E49;&#x57DF;namespace&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x7684;&#x5BF9;&#x8C61;&#x3001;class&#x5185;&#x7684;&#x3001;&#x6587;&#x4EF6;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x7684;static&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x6B21;&#x5E8F;&#x672A;&#x5B9A;&#x4E49;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x5185;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x7684;&#x9759;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x5219;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F60;&#x5728;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5176;&#x8FD8;&#x6CA1;&#x6709;&#x521D;&#x59CB;&#x5316;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;local static&#x53D8;&#x91CF;&#x7684;reference&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5F97;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5355;&#x4F8B;&#x7684;&#x5E38;&#x89C1;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">FileSystem &amp;tfs() {</span><br><span class="line">   static FileSystem fs;</span><br><span class="line">   return &amp;fs</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x4F46;&#x8FD9;&#x4E2A;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;static&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x5728;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#x5148;&#x4EE5;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x8C03;&#x7528;&#x4E00;&#x904D;&#x3002;</p>
<p><strong>&#x603B;&#x4E4B;</strong>&#xFF0C;non-local static&#x5BF9;&#x8C61;&#x6700;&#x597D;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x5185;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x8DE8;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x4F7F;&#x7528;&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x66FF;&#x4EE3;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/06/28/effective-cpp-reading-notes-2/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/06/24/effective-cpp-reading-notes-1/" title="《Effective C++》读书笔记(1)" itemprop="url">《Effective C++》读书笔记(1)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-06-24T12:31:22.000Z" itemprop="datePublished"> 发表于 2016-06-24</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="&#x8BA9;&#x81EA;&#x5DF1;&#x4E60;&#x60EF;c"><a href="#&#x8BA9;&#x81EA;&#x5DF1;&#x4E60;&#x60EF;C" class="headerlink" title="&#x8BA9;&#x81EA;&#x5DF1;&#x4E60;&#x60EF;C++"></a>&#x8BA9;&#x81EA;&#x5DF1;&#x4E60;&#x60EF;C++</h2><h3 id="&#x6761;&#x6B3E;01&#x89C6;c&#x4E3A;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x8054;&#x90A6;"><a href="#&#x6761;&#x6B3E;01&#xFF1A;&#x89C6;C-&#x4E3A;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x8054;&#x90A6;" class="headerlink" title="&#x6761;&#x6B3E;01&#xFF1A;&#x89C6;C++&#x4E3A;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x8054;&#x90A6;"></a>&#x6761;&#x6B3E;01&#xFF1A;&#x89C6;C++&#x4E3A;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x8054;&#x90A6;</h3><blockquote>
<ul>
<li>C++ &#x9AD8;&#x6548;&#x7F16;&#x7A0B;&#x5B88;&#x5219;&#x662F;&#x72B6;&#x51B5;&#x800C;&#x53D8;&#x5316;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x4F7F;&#x7528;C++&#x7684;&#x54EA;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x3002;</li>
</ul>
</blockquote>
<p>C++&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x8303;&#x5F0F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x540C;&#x65F6;&#x652F;&#x6301;&#x8FC7;&#x7A0B;&#x5F62;&#x5F0F;&#xFF08;procedural&#xFF09;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BBE;&#x8BA1;&#xFF08;object-oriented&#xFF09;&#x3001;&#x51FD;&#x6570;&#x5F62;&#x5F0F;&#xFF08;functional&#xFF09;&#x3001;&#x6CDB;&#x578B;&#x5F62;&#x5F0F;&#xFF08;generic&#xFF09;&#xFF0C;&#x5143;&#x7F16;&#x7A0B;&#x5F62;&#x5F0F;&#xFF08;meta-programming&#xFF09;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#x5E76;&#x4E0D;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x90FD;&#x662F;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E9B;&#x8303;&#x5F0F;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;C++&#x8BED;&#x8A00;&#x5206;&#x4E3A;&#x4E00;&#x4E0B;&#x51E0;&#x79CD;&#x6B21;&#x8BED;&#x8A00;&#xFF1A;</p>
<ul>
<li>C</li>
<li>Object-Oriented C++</li>
<li>Template C++</li>
<li>STL</li>
</ul>
<h3 id="&#x6761;&#x6B3E;02&#x5C3D;&#x91CF;&#x4EE5;constenuminline&#x66FF;&#x6362;define"><a href="#&#x6761;&#x6B3E;02&#xFF1A;&#x5C3D;&#x91CF;&#x4EE5;const&#xFF0C;enum&#xFF0C;inline&#x66FF;&#x6362;-define" class="headerlink" title="&#x6761;&#x6B3E;02&#xFF1A;&#x5C3D;&#x91CF;&#x4EE5;const&#xFF0C;enum&#xFF0C;inline&#x66FF;&#x6362;#define"></a>&#x6761;&#x6B3E;02&#xFF1A;&#x5C3D;&#x91CF;&#x4EE5;const&#xFF0C;enum&#xFF0C;inline&#x66FF;&#x6362;#define</h3><blockquote>
<ul>
<li>&#x5BF9;&#x4E8E;&#x5355;&#x7EAF;&#x5E38;&#x91CF;&#xFF0C;&#x6700;&#x597D;&#x4EE5;const&#x5BF9;&#x8C61;&#x6216;enums&#x66FF;&#x6362;#define</li>
<li>&#x5BF9;&#x4E8E;&#x5F62;&#x4F3C;&#x51FD;&#x6570;&#x7684;&#x5B8F;&#xFF08;macros&#xFF09;&#xFF0C;&#x6700;&#x597D;&#x6539;&#x7528;inline&#x51FD;&#x6570;&#x66FF;&#x6362;#define</li>
</ul>
</blockquote>
<p><strong>#define&#x7684;&#x7F3A;&#x70B9;&#xFF1A;</strong></p>
<ol>
<li>define &#x5B9A;&#x4E49;&#x7684;&#x503C;&#x65E0;&#x6CD5;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x8C03;&#x8BD5;&#x5668;&#x770B;&#x5230;&#xFF0C;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x5F88;&#x9EBB;&#x70E6;&#x3002;</li>
<li>&#x6CA1;&#x6709;&#x826F;&#x597D;&#x7684;&#x5C01;&#x88C5;&#x65B0;&#xFF0C;&#x4E0D;&#x80FD;&#x63A7;&#x5236;&#x4F5C;&#x7528;&#x57DF;&#x3002;</li>
</ol>
<p><strong>const</strong></p>
<p>&#x4F7F;&#x7528;const&#x6211;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">const std::string ProductName(&quot;Mango Game&quot;);</span><br><span class="line">const double Pi = 3.1415;</span><br></pre></td></tr></table></figure>
<p>&#x8FD8;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x4E13;&#x5C5E;&#x5E38;&#x91CF;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">//Header</span><br><span class="line">class Game {</span><br><span class="line">private:</span><br><span class="line">	static const int MaxGamePlayer ;</span><br><span class="line">...</span><br><span class="line">};</span><br><span class="line"></span><br><span class="line">//cpp file</span><br><span class="line">const int Game::MaxGamePlayer = 5;</span><br></pre></td></tr></table></figure>
<p><strong>enum hack</strong></p>
<p>&#x5982;&#x679C;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x65F6;&#x4F7F;&#x7528;&#x5230;&#x5E38;&#x91CF;&#x5C31;&#x9700;&#x8981;enum hack&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#xFF0C;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">class GamePlayer {</span><br><span class="line">private:</span><br><span class="line">    enum { NumTurns = 5}</span><br><span class="line">    int scores[NumTruns];</span><br><span class="line">};</span><br></pre></td></tr></table></figure>
<p><strong>inline function</strong></p>
<p>&#x6709;&#x4E00;&#x4E9B;&#x5B8F;&#x957F;&#x5F97;&#x5F88;&#x50CF;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x79CD;&#x5B8F;&#x6709;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x548C;&#x4E0D;&#x53EF;&#x9884;&#x6599;&#x884C;&#x4E3A;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;inline function&#x6765;&#x66FF;&#x4EE3;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">//&#x8FD9;&#x4E2A;MAX&#x5B8F;&#x5F88;&#x4E0D;&#x597D;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x5947;&#x602A;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x4E14;&#x65E0;&#x6CD5;&#x8C03;&#x8BD5;</span><br><span class="line">#define MAX(a,b) ((a) &gt; (b) ? (a) : (b))</span><br><span class="line"></span><br><span class="line">//Good</span><br><span class="line">template&lt;typename T&gt;</span><br><span class="line">inline T Max(const T&amp; a, const T&amp; b)</span><br><span class="line">{</span><br><span class="line">    return (a &gt; b ? a : b);</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<h3 id="&#x6761;&#x6B3E;3&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;const"><a href="#&#x6761;&#x6B3E;3&#xFF1A;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;const" class="headerlink" title="&#x6761;&#x6B3E;3&#xFF1A;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;const"></a>&#x6761;&#x6B3E;3&#xFF1A;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;const</h3><blockquote>
<ul>
<li>&#x5C06;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x58F0;&#x660E;&#x4E3A;const&#x53EF;&#x5E2E;&#x52A9;&#x7F16;&#x8BD1;&#x5668;&#x4FA6;&#x6D4B;&#x51FA;&#x9519;&#x8BEF;&#x7528;&#x6CD5;&#x3002;const&#x53EF;&#x88AB;&#x65BD;&#x52A0;&#x4E8E;&#x4EFB;&#x4F55;&#x4F5C;&#x7528;&#x57DF;&#x5185;&#x7684;&#x5BF9;&#x8C61;&#x3001;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x3001;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x3001;&#x6210;&#x5458;&#x51FD;&#x6570;&#x672C;&#x4F53;&#x3002;</li>
<li>&#x7F16;&#x8BD1;&#x5668;&#x5F3A;&#x5236;&#x5B9E;&#x65BD;bitwise constness&#xFF0C;&#x4F46;&#x4F60;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x65F6;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x201C;&#x6982;&#x5FF5;&#x4E0A;&#x7684;&#x5E38;&#x91CF;&#x6027;&#x201D;&#xFF08;conceptual constness&#xFF09;&#x3002;</li>
<li>&#x5F53;const&#x548C;non-const&#x6210;&#x5458;&#x51FD;&#x6570;&#x6709;&#x7740;&#x5B9E;&#x8D28;&#x7B49;&#x4EF7;&#x7684;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x4EE4;non-const&#x7248;&#x672C;&#x8C03;&#x7528;const&#x7248;&#x672C;&#x53EF;&#x907F;&#x514D;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x3002;</li>
</ul>
</blockquote>
<p>const&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x8BED;&#x4E49;&#x4E0A;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x7EA6;&#x675F;&#x53D8;&#x91CF;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x5F53;&#x5B83;&#x4F5C;&#x7528;&#x4E8E;&#x9488;&#x3001;&#x667A;&#x80FD;&#x6307;&#x9488;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x6307;&#x9488;&#x672C;&#x8EAB;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x6307;&#x9488;&#x6307;&#x5411;&#x7269;&#x3002;&#x4F5C;&#x8005;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x8BC6;&#x522B;&#x7684;&#x6280;&#x5DE7;&#xFF1A;<em>&#x5982;&#x679C;&#x5173;&#x952E;&#x5B57;const&#x51FA;&#x73B0;&#x5728;&#x661F;&#x53F7;&#x5DE6;&#x8FB9;&#xFF0C;&#x8868;&#x793A;&#x88AB;&#x6307;&#x7269;&#x662F;&#x5E38;&#x91CF;&#xFF1B;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x5728;&#x661F;&#x53F7;&#x53F3;&#x8FB9;&#xFF0C;&#x8868;&#x793A;&#x6307;&#x9488;&#x672C;&#x8EAB;&#x662F;&#x5E38;&#x91CF;&#x3002;</em></p>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br></pre></td><td class="code"><pre><span class="line"></span><br><span class="line">char greeting[] = &quot;Hello&quot;</span><br><span class="line">char *p = greeting;			//non const point, const data</span><br><span class="line">const char * p = greeting;	//non const point, const data </span><br><span class="line">char const * p = greeting;	//non const point, const data</span><br><span class="line">char * const p = greeting;	//const point, non const data</span><br><span class="line">const char* const p = greeting; //const point, const data</span><br><span class="line"></span><br><span class="line">const std::vector&lt;int&gt;::iterator it;		// --&gt; T * const p</span><br><span class="line">*it = 10; 	//&#x5408;&#x6CD5;</span><br><span class="line">it++;		//&#x4E0D;&#x5408;&#x6CD5;</span><br><span class="line">std::vector&lt;int&gt;::const_iterator it;		// --&gt; const T * p</span><br><span class="line">it = 10;	//&#x4E0D;&#x5408;&#x6CD5;</span><br><span class="line">it++;		//&#x5408;&#x6CD5;</span><br><span class="line"></span><br><span class="line">std::shared&lt;T&gt; p1;</span><br><span class="line">std::shared&lt;const T&gt; p;	// --&gt; const T *p</span><br><span class="line">p = p1;			//&#x5408;&#x6CD5;</span><br><span class="line">*p.get() = x;	//&#x4E0D;&#x5408;&#x6CD5;</span><br><span class="line">const std::shared&lt;T&gt; p; // --&gt; T* const p</span><br><span class="line">p = p1;			//&#x4E0D;&#x5408;&#x6CD5;</span><br><span class="line">*p.get() = x;	//&#x5408;&#x6CD5;</span><br></pre></td></tr></table></figure>
<p>&#x6709;&#x70B9;&#x5934;&#x6655;&#xFF0C;&#x6211;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x662F;&#x5F88;&#x6070;&#x5F53;&#x5730;&#x8BB0;&#x5FC6;&#x65B9;&#x6CD5;&#x3002;&#x53EF;&#x4EE5;&#x628A;<code>const</code>&#x770B;&#x6210;&#x4FEE;&#x9970;&#x5B83;&#x53F3;&#x8FB9;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x7684;&#xFF0C;&#x4EE5;<code>const char* p</code>&#x4E3A;&#x4F8B;&#xFF0C;&#x628A;<code>p</code>&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x800C;<code>*p</code>&#x5219;&#x662F;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;<code>const</code>&#x662F;&#x4FEE;&#x9970;&#x6570;&#x636E;&#x7684;&#x3002;&#x800C;<code>char * const p</code>&#x4E2D;&#xFF0C;<code>const</code>&#x53F3;&#x8FB9;&#x53EA;&#x6709;<code>p</code>&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EA;&#x662F;&#x9650;&#x5236;&#x6307;&#x9488;&#x672C;&#x8EAB;&#x7684;&#x3002;</p>
<h4 id="bitwise-constness-vs-logical-constness"><a href="#bitwise-constness-vs-logical-constness" class="headerlink" title="bitwise constness vs logical constness"></a>bitwise constness vs logical constness</h4><p>&#x5F53;&#x9650;&#x5236;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x51FD;&#x6570;&#x4E3A;const&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x6267;&#x884C;bitwise constness&#xFF0C;&#x5373;&#x68C0;&#x67E5;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x662F;&#x5426;&#x4FEE;&#x6539;&#x4E86;&#x7C7B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x3002;&#x4F46;&#x662F;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x5E38;&#x91CF;&#x9650;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4E00;&#x4E2A;&#x4F60;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5185;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x867D;&#x7136;&#x7B26;&#x5408;&#x7F16;&#x8BD1;&#x5668;&#x7684;const&#x9650;&#x5236;&#x4F46;&#x5374;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x5199;&#x6CD5;&#x3002;</p>
<p>[to be continued]</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/06/24/effective-cpp-reading-notes-1/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="page-number" href="/page/3/">3</a><span class="space">&hellip;</span><a class="page-number" href="/page/5/">5</a><a class="extend next" rel="next" href="/page/2/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>10</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程语言/" title="编程语言">编程语言<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/编程语言/" title="编程语言">编程语言<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/linux/" title="linux">linux<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/操作系统/" title="操作系统">操作系统<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
          <li>
            
            	<a href="http://www.cnblogs.com/imjustice/" target="_blank" title="博客园主页">博客园主页</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
