
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta property="og:type" content="website">
<meta property="og:title" content="yi's weblog">
<meta property="og:url" content="http://zhengyi.me/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="yi's weblog">
<meta name="twitter:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/10/05/udacity-responsive-web-design-notes/" title="[学习笔记] Udacity - Responsive Web Design Fundamentals?" itemprop="url">[学习笔记] Udacity - Responsive Web Design Fundamentals?</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-10-05T13:23:38.000Z" itemprop="datePublished"> 发表于 2016-10-05</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x8FD9;&#x95E8;&#x8BFE;&#x7A0B;(<a href="https://www.udacity.com/course/responsive-web-design-fundamentals--ud893" target="_blank" rel="external">Responsive Web Design Fundamentals</a>)&#x4E3B;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x5173;&#x4E8E;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x7840;&#x6982;&#x5FF5;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5BF9;&#x7F51;&#x7AD9;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x5DE7;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x8BFE;&#x7A0B;&#x4E3B;&#x8981;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x601D;&#x8DEF;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x6280;&#x672F;&#x7684;&#x90E8;&#x5206;&#x4E5F;&#x53EA;&#x662F;&#x4ECB;&#x7ECD;&#x4E86;&#x6700;&#x57FA;&#x672C;&#x7528;&#x6CD5;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x6DF1;&#x5165;&#x67D0;&#x4E2A;&#x6280;&#x672F;&#x53BB;&#x5C55;&#x5F00;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x8BFE;&#x7A0B;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x5BF9;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x6709;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x80FD;&#x591F;&#x77E5;&#x9053;&#x5728;&#x8BBE;&#x8BA1;&#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x9875;&#x9762;&#x65F6;&#x9700;&#x8981;&#x5982;&#x4F55;&#x505A;&#x548C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x4E9B;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x8BFE;&#x7A0B;&#x7684;&#x5927;&#x7EB2;&#x5982;&#x4E0B;&#xFF0C;&#x6BD4;&#x8F83;&#x57FA;&#x7840;&#xFF0C;&#x8BFE;&#x7A0B;&#x8FD8;&#x6709;&#x633A;&#x591A;&#x7684;&#x7EC3;&#x4E60;&#xFF0C;&#x901A;&#x8FC7;&#x7EC3;&#x4E60;&#x80FD;&#x591F;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x7528;&#x6CD5;&#x3002;</p>
<p><img src="/img/Udacity-RWD-Mindmap.png" alt="Course Structure"></p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;why-responsive"><a href="#&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#xFF1F;-Why-Responsive" class="headerlink" title="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#xFF1F;(Why Responsive?)"></a>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#xFF1F;(Why Responsive?)</h2><p>&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#xFF08;Responsive Web Design&#xFF0C;&#x901A;&#x5E38;&#x7F29;&#x5199;RWD&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8BA9;&#x7F51;&#x7AD9;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x5907;&#x4E0A;&#x80FD;&#x591F;&#x826F;&#x597D;&#x7684;&#x663E;&#x793A;&#x3002;&#x8FD9;&#x4E2A;&#x201C;&#x826F;&#x597D;&#x7684;&#x663E;&#x793A;&#x201D;&#x662F;&#x6307;&#x80FD;&#x591F;&#x7ED9;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#x8005;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7684;&#x4F53;&#x9A8C;&#x3002;&#x5728;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x666E;&#x53CA;&#x524D;&#xFF0C;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x53EA;&#x9700;&#x8981;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8003;&#x8651;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x5373;&#x53EF;&#xFF0C;&#x4F46;&#x662F;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x7684;&#x666E;&#x53CA;&#xFF0C;&#x4F1A;&#x5F15;&#x5165;&#x4E00;&#x4E9B;&#x5F88;&#x5C0F;&#x5C3A;&#x5BF8;&#x7684;&#x5C4F;&#x5E55;&#x800C;&#x4E14;&#x6BD4;&#x4F8B;&#x4E5F;&#x4E0D;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x3002;</p>
<p><anchor>&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x9664;&#x4E86;&#x662F;&#x4E00;&#x95E8;&#x6280;&#x672F;&#x4EE5;&#x5916;</anchor>&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4E00;&#x95E8;&#x827A;&#x672F;&#xFF0C;&#x5982;&#x4F55;&#x5B89;&#x6392;&#x5728;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x4E0A;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x800C;&#x4E0D;&#x662F;&#x6280;&#x672F;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p><strong>&#x79FB;&#x52A8;&#x4F18;&#x5148;</strong></p>
<p>&#x79FB;&#x52A8;&#x4F18;&#x5148;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#x662F;&#x6307;&#x5728;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x4ECE;&#x79FB;&#x52A8;&#x7AEF;&#x5148;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6162;&#x6162;&#x7684;&#x5F80;&#x5927;&#x5C3A;&#x5BF8;&#x53BB;&#x589E;&#x5F3A;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x8005;&#x66F4;&#x597D;&#x7684;&#x53BB;&#x601D;&#x8003;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x6765;&#x8BF4;&#x4EC0;&#x4E48;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x4F55;&#x628A;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x5408;&#x7406;&#x7684;&#x6446;&#x653E;&#x624D;&#x80FD;&#x8FBE;&#x5230;&#x6548;&#x679C;&#x3002;</p>
<h2 id="&#x4ECE;&#x5C0F;&#x5F00;&#x59CB;starting-small"><a href="#&#x4ECE;&#x5C0F;&#x5F00;&#x59CB;&#xFF08;Starting-Small&#xFF09;" class="headerlink" title="&#x4ECE;&#x5C0F;&#x5F00;&#x59CB;&#xFF08;Starting Small&#xFF09;"></a>&#x4ECE;&#x5C0F;&#x5F00;&#x59CB;&#xFF08;Starting Small&#xFF09;</h2><p>&#x65E2;&#x7136;&#x6D89;&#x53CA;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x90A3;&#x4E48;&#x5173;&#x4E8E;&#x5C3A;&#x5BF8;&#x7684;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x5C31;&#x9700;&#x8981;&#x5728;&#x8FD9;&#x91CC;&#x5148;&#x641E;&#x6E05;&#x695A;&#x3002;</p>
<ul>
<li>&#x8BBE;&#x5907;&#x5206;&#x8FA8;&#x7387;&#xFF08;Hardware Resolution/Pixel&#xFF09;</li>
<li>&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x50CF;&#x7D20;&#xFF08;Device Independent Pixel&#xFF09;</li>
<li>CSS&#x50CF;&#x7D20;&#xFF08;CSS Pixel&#xFF09;</li>
<li>Viewport</li>
</ul>
<h3 id="&#x8BBE;&#x5907;&#x5206;&#x8FA8;&#x7387;"><a href="#&#x8BBE;&#x5907;&#x5206;&#x8FA8;&#x7387;" class="headerlink" title="&#x8BBE;&#x5907;&#x5206;&#x8FA8;&#x7387;"></a>&#x8BBE;&#x5907;&#x5206;&#x8FA8;&#x7387;</h3><p>&#x8FD9;&#x4E2A;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x6307;&#x5F97;&#x662F;&#x8BBE;&#x5907;&#x672C;&#x8EAB;&#x7684;&#x5B9E;&#x9645;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x4E0A;&#x4E8B;&#x5B9E;&#x4E0A;&#x5206;&#x5E03;&#x7684;&#x50CF;&#x7D20;&#x70B9;&#x7684;&#x4E2A;&#x6570;&#x3002;</p>
<h3 id="&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x50CF;&#x7D20;"><a href="#&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x50CF;&#x7D20;" class="headerlink" title="&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x50CF;&#x7D20;"></a>&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x50CF;&#x7D20;</h3><p>&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x50CF;&#x7D20;&#x662F;&#x57FA;&#x4E8E;&#x67D0;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x5EA6;&#x91CF;&#x5355;&#x4F4D;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5C06;&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x7684;&#x50CF;&#x7D20;&#x8F6C;&#x6362;&#x6210;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x5B9E;&#x9645;&#x50CF;&#x7D20;&#x3002;<sup>[1]</sup></p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;iPhone 3G&#x548C;iPhone 4S&#x7684;&#x7269;&#x7406;&#x5C3A;&#x5BF8;&#x90FD;&#x662F;3.5&#x82F1;&#x5BF8;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x8BBE;&#x5907;&#x5206;&#x8FA8;&#x7387;&#x5206;&#x522B;&#x662F;320 x 480&#x548C;640 x 960&#x3002;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x5206;&#x8FA8;&#x7387;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90FD;&#x662F;320 x 480<sup>[2]</sup><sup>[3]</sup>&#x3002;</p>
<p>&#x8BFE;&#x7A0B;&#x4E2D;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x5F62;&#x8C61;&#x7684;&#x56FE;</p>
<p><img src="/img/Udacity-RWD-DIP-vs-Hardware-Pixel.png" alt="Compare DIP and Hardware Pixels"></p>
<h3 id="css&#x50CF;&#x7D20;"><a href="#CSS&#x50CF;&#x7D20;" class="headerlink" title="CSS&#x50CF;&#x7D20;"></a>CSS&#x50CF;&#x7D20;</h3><p>&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x6CA1;&#x6709;&#x7F29;&#x653E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;1&#x4E2A;CSS&#x50CF;&#x7D20;&#x5BF9;&#x5E94;1&#x4E2A;&#x8BBE;&#x5907;&#x72EC;&#x7ACB;&#x50CF;&#x7D20;&#x3002;</p>
<h3 id="viewport"><a href="#Viewport" class="headerlink" title="Viewport"></a>Viewport</h3><p>Viewport&#x6307;&#x7684;&#x662F;&#x7528;&#x6237;&#x5728;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x53EF;&#x89C6;&#x533A;&#x57DF;&#xFF0C;&#x5728;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E0A;&#x8FD9;&#x4E2A;&#x53EF;&#x89C6;&#x533A;&#x57DF;&#x5F80;&#x5F80;&#x6BD4;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x533A;&#x57DF;&#x5C0F;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8001;&#x7684;&#x79FB;&#x52A8;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#xFF0C;&#x4F1A;&#x628A;&#x9875;&#x9762;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x7684;&#x5927;&#x5C0F;&#x6E32;&#x67D3;&#x51FA;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x90A3;&#x4E2A;&#x5C3A;&#x5BF8;&#x6BD4;&#x624B;&#x673A;&#x5927;&#xFF0C;&#x7528;&#x6237;&#x5219;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x79FB;&#x52A8;&#xFF0C;&#x653E;&#x5927;&#x548C;&#x7F29;&#x5C0F;&#x6765;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x79FB;&#x52A8;&#x7248;Safari&#x5F15;&#x5165;&#x4E86;&#x201C;viewport meta&#x201D;&#x6807;&#x7B7E;&#x6765;&#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x63A7;&#x5236;viewpoint&#x7684;&#x5C3A;&#x5BF8;&#x548C;&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x4E0D;&#x662F;&#x6807;&#x51C6;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x591A;&#x6570;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x76EE;&#x524D;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x3002;</p>
<p>&#x5178;&#x578B;&#x7684;viewport&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;<code>meta</code>&#x6807;&#x7B7E;&#x52A0;&#x5230;<code>&lt;head&gt;</code>&#x4E2D;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&lt;meta name=&quot;viewport&quot; content=&quot;width=device-width, initial-scale=1&quot;&gt;</span><br></pre></td></tr></table></figure>
<p>&#x5173;&#x4E8E;Viewport&#x7684;&#x5185;&#x5BB9;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x4F1A;&#x53E6;&#x8D77;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x7684;&#x5B66;&#x4E60;&#x3002;</p>
<h3 id="&#x4ECE;&#x5C0F;&#x5F00;&#x59CB;"><a href="#&#x4ECE;&#x201C;&#x5C0F;&#x201D;&#x5F00;&#x59CB;" class="headerlink" title="&#x4ECE;&#x201C;&#x5C0F;&#x201D;&#x5F00;&#x59CB;"></a>&#x4ECE;&#x201C;&#x5C0F;&#x201D;&#x5F00;&#x59CB;</h3><p>&#x8FD9;&#x91CC;&#x7684;&#x4ECE;&#x201C;&#x5C0F;&#x201D;&#x5F00;&#x59CB;&#x6307;&#x7684;&#x662F;&#x4ECE;&#x5C0F;&#x5C4F;&#x5E55;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DDF;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x79FB;&#x52A8;&#x4F18;&#x5148;&#x7684;&#x6982;&#x5FF5;&#x662F;&#x543B;&#x5408;&#x7684;&#x3002;</p>
<div style="display: flex"><br>    <div style="width:50%"><br>    <img src="/img/Udacity-RWD-Big-to-Small.png" alt="Udacity-RWD-Big-to-Small"><br>    </div><br>    <div style="width:50%"><br>    <img src="/img/Udacity-RWD-Small-to-Big.png" alt="Udacity-RWD-Small-to-Big"><br>    </div><br></div>

<p>&#x4F5C;&#x8005;&#x7ED9;&#x51FA;&#x4E86;&#x4E24;&#x4E2A;&#x56FE;&#x6765;&#x89E3;&#x91CA;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x633A;&#x5F62;&#x8C61;&#x7684;&#x3002;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x8BBE;&#x8BA1;&#x548C;&#x4ECE;&#x5927;&#x5230;&#x5C0F;&#x8BBE;&#x8BA1;&#x5C31;&#x5982;&#x540C;&#x56FE;&#x4E2D;&#x7684;&#x6F0F;&#x6597;&#x4E00;&#x6837;&#x3002;&#x4ECE;&#x5927;&#x5230;&#x5C0F;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8BEF;&#x628A;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x5185;&#x5BB9;&#x7ED9;&#x8FC7;&#x6EE4;&#x6389;&#xFF0C;&#x800C;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x5219;&#x4E0D;&#x4F1A;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4ECE;&#x5C0F;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x8FD8;&#x80FD;&#x591F;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x8003;&#x8651;&#x5230;&#x6027;&#x80FD;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x9010;&#x6B65;&#x6784;&#x5EFA;building-up"><a href="#&#x9010;&#x6B65;&#x6784;&#x5EFA;&#xFF08;Building-Up&#xFF09;" class="headerlink" title="&#x9010;&#x6B65;&#x6784;&#x5EFA;&#xFF08;Building Up&#xFF09;"></a>&#x9010;&#x6B65;&#x6784;&#x5EFA;&#xFF08;Building Up&#xFF09;</h2><p>&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x5F15;&#x7528;&#x4E3B;&#x8981;&#x9700;&#x8981;&#x7528;&#x5230;&#x4E00;&#x4E0B;&#x51E0;&#x4E2A;&#x6982;&#x5FF5;&#x548C;&#x6280;&#x672F;&#xFF1A;</p>
<ul>
<li>Media Query</li>
<li>Breakpoint</li>
<li>Flexbox</li>
</ul>
<h3 id="media-query"><a href="#Media-Query" class="headerlink" title="Media Query"></a>Media Query</h3><p>Media query &#x662F;&#x5B9E;&#x73B0;&#x54CD;&#x5E94;&#x5F0F;&#x7F16;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x5728;CSS&#x4E2D;&#x6839;&#x636E;&#x67D0;&#x4E00;&#x4E9B;&#x6761;&#x4EF6;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x6837;&#x5F0F;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">@media screen and (min-width: 480px) {</span><br><span class="line">    body {</span><br><span class="line">        background-color: lightgreen;</span><br><span class="line">    }</span><br><span class="line">}</span><br><span class="line">Try it Yourself &#xBB;</span><br><span class="line">The</span><br></pre></td></tr></table></figure>
<p>&#x8FD9;&#x4E2A;&#x662F;media query&#x7684;&#x8BED;&#x6CD5;&#x5B9A;&#x4E49;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x60F3;&#x5728;viewport&#x5927;&#x4E8E;400px&#x65F6;&#x5C06;&#x80CC;&#x666F;&#x989C;&#x8272;&#x6539;&#x6210;&#x7EA2;&#x8272;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">@media screen and (min-width: 400px) {</span><br><span class="line">    body {</span><br><span class="line">        background-color: red;</span><br><span class="line">    }</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<h3 id="breakpoint"><a href="#Breakpoint" class="headerlink" title="Breakpoint"></a>Breakpoint</h3><p>&#x4F7F;&#x7528;&#x4E86;media query&#x4EE5;&#x540E;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x70B9;&#x662F;&#x7684;&#x67D0;&#x4E00;&#x4E9B;&#x6837;&#x5F0F;&#x88AB;&#x5F15;&#x7528;&#x8FDB;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x90A3;&#x4E2A;media query&#x4E2D;400px&#x5C31;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;breakpoint&#xFF08;&#x65AD;&#x70B9;&#xFF09;&#x3002;</p>
<p>&#x65AD;&#x70B9;&#x7684;&#x8BBE;&#x7F6E;&#x4E5F;&#x662F;&#x6839;&#x636E;&#x8BBE;&#x8BA1;&#x800C;&#x6765;&#xFF0C;&#x6CA1;&#x6709;&#x4E25;&#x683C;&#x7684;&#x8981;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x65AD;&#x70B9;&#x8FDB;&#x884C;&#x5927;&#x7684;UI&#x8C03;&#x6574;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x65AD;&#x70B9;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x7EC6;&#x5FAE;&#x7684;&#x8C03;&#x6574;&#x3002;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x4E00;&#x95E8;&#x827A;&#x672F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x3002;</p>
<p>&#x89C6;&#x9891;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x4E24;&#x4E2A;&#x65AD;&#x70B9;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li><a href="http://skinnyties.com/" target="_blank" rel="external">http://skinnyties.com/</a></li>
<li><a href="http://cnn.com" target="_blank" rel="external">http://cnn.com</a></li>
</ul>
<h3 id="flexbox"><a href="#Flexbox" class="headerlink" title="Flexbox"></a>Flexbox</h3><p>Flexbox&#x662F;flexible box&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x662F;2009&#x5E74;W3C&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x5E03;&#x5C40;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x5728;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x5F97;&#x5230;&#x652F;&#x6301;<sup>[5]</sup>&#x3002;Flex<br>&#x5E03;&#x5C40;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x8BA9;flex&#x5BB9;&#x5668;&#x6709;&#x80FD;&#x529B;&#x53BB;&#x4FEE;&#x6539;&#x5176;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x9AD8;&#x5EA6;&#x8FD8;&#x6709;&#x987A;&#x5E8F;&#x4ECE;&#x800C;&#x66F4;&#x597D;&#x7684;&#x4F7F;&#x7528;&#x53EF;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x8BFE;&#x7A0B;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x4E0D;&#x540C;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x6A21;&#x5F0F;&#x90FD;&#x662F;&#x4F7F;&#x7528;flex&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<h2 id="common-responsive-patterns"><a href="#Common-Responsive-Patterns" class="headerlink" title="Common Responsive Patterns"></a>Common Responsive Patterns</h2><p>&#x8BFE;&#x7A0B;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x56DB;&#x79CD;&#x6BD4;&#x8F83;&#x901A;&#x7528;&#x7684;&#x54CD;&#x5E94;&#x5F0F;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x51E0;&#x79CD;&#x6A21;&#x5F0F;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#x3002;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x8BBE;&#x8BA1;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="column-drop"><a href="#Column-Drop" class="headerlink" title="Column Drop"></a>Column Drop</h3><p><img src="/img/Udacity-RWD-Column-Drop.png" alt="Column Drop"></p>
<h3 id="mostly-fluid"><a href="#Mostly-Fluid" class="headerlink" title="Mostly Fluid"></a>Mostly Fluid</h3><p><img src="/img/Udacity-RWD-Mostly-Fluid.png" alt="Mostly Fluid"></p>
<h3 id="layout-shifter"><a href="#Layout-Shifter" class="headerlink" title="Layout Shifter"></a>Layout Shifter</h3><p><img src="/img/Udacity-RWD-Layout-Shifter.png" alt="Layout Shifter"></p>
<h3 id="off-canvas"><a href="#Off-Canvas" class="headerlink" title="Off Canvas"></a>Off Canvas</h3><p><img src="/img/Udacity-RWD-Off-Canvas.png" alt="Off Canvas"></p>
<h2 id="optimizations"><a href="#Optimizations" class="headerlink" title="Optimizations"></a>Optimizations</h2><p>&#x8BFE;&#x7A0B;&#x63D0;&#x4F9B;&#x4E86;&#x51E0;&#x4E2A;&#x5728;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x7684;&#x4F18;&#x5316;&#x70B9;&#xFF0C;&#x5305;&#x62EC;&#x56FE;&#x7247;&#x3001;&#x5B57;&#x4F53;&#x548C;&#x8868;&#x683C;&#x3002;</p>
<h3 id="&#x56FE;&#x7247;"><a href="#&#x56FE;&#x7247;" class="headerlink" title="&#x56FE;&#x7247;"></a>&#x56FE;&#x7247;</h3><p>&#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8981;&#x6C42;&#x56FE;&#x7247;&#x7684;&#x5C3A;&#x5BF8;&#x8981;&#x6B63;&#x786E;&#xFF0C;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#x8981;&#x4FDD;&#x8BC1;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C3A;&#x5BF8;&#x4E0B;&#x56FE;&#x7247;&#x663E;&#x793A;&#x51FA;&#x6765;&#x7684;&#x4E3B;&#x4F53;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x800C;&#x4E0D;&#x662F;&#x53EA;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x6216;&#x8005;&#x4EE5;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x7F29;&#x653E;&#x6BD4;&#x4F8B;&#x5C55;&#x793A;&#x51FA;&#x6765;&#x3002;&#x5728;&#x53E6;&#x4E00;&#x95E8;<a href="https://www.udacity.com/course/responsive-images--ud882" target="_blank" rel="external">&#x300C;Responsive Images&#x300D;</a>&#x6709;&#x5173;&#x4E8E;&#x54CD;&#x5E94;&#x5F0F;&#x56FE;&#x7247;&#x7684;&#x6DF1;&#x5165;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="&#x5B57;&#x4F53;"><a href="#&#x5B57;&#x4F53;" class="headerlink" title="&#x5B57;&#x4F53;"></a>&#x5B57;&#x4F53;</h3><p>&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x8C03;&#x6574;&#x5B57;&#x4F53;&#x7684;&#x5927;&#x5C0F;&#x4ECE;&#x800C;&#x4F7F;&#x5176;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x9002;&#x5E94;&#x5F53;&#x524D;&#x7684;&#x5C3A;&#x5BF8;&#x3002;<br>&#x53E6;&#x5916;&#xFF0C;&#x4E00;&#x884C;&#x7684;&#x5B57;&#x6570;&#x4E5F;&#x8981;&#x63A7;&#x5236;&#x5728;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x800C;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#xFF0C;&#x5C31;&#x82F1;&#x8BED;&#x800C;&#x8A00;&#xFF0C;&#x6BCF;&#x884C;65&#x4E2A;&#x5B57;&#x7B26;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x9002;&#x7684;</p>
<h3 id="&#x8868;&#x683C;"><a href="#&#x8868;&#x683C;" class="headerlink" title="&#x8868;&#x683C;"></a>&#x8868;&#x683C;</h3><p>&#x8868;&#x683C;&#x5728;&#x5C3A;&#x5BF8;&#x7684;&#x5C4F;&#x5E55;&#x4E0A;&#x6BD4;&#x8F83;&#x5C34;&#x5C2C;&#xFF0C;&#x56E0;&#x4E3A;&#x8868;&#x683C;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#x800C;&#x4E14;&#x5F80;&#x5F80;&#x6709;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5217;&#x3002;&#x5BF9;&#x4E8E;&#x8868;&#x683C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E00;&#x4E9B;&#x7B56;&#x7565;&#xFF1A;</p>
<ul>
<li>&#x51CF;&#x5C11;&#x8868;&#x683C;&#x5217;&#xFF0C;&#x53EA;&#x663E;&#x793A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x5C06;&#x5217;&#x5C55;&#x5E73;&#xFF0C;&#x7528;&#x884C;&#x7684;&#x5F62;&#x5F0F;&#x663E;&#x793A;&#x5217;&#x3002;</li>
<li>&#x5C06;&#x8868;&#x683C;&#x653E;&#x5728;&#x4E00;&#x4E2A;container&#xFF0C;&#x5C06;container&#x7684;&#x6837;&#x5F0F;&#x8BBE;&#x7F6E;&#x4E3A;<code>overflow-x: auto, width: 100%</code>&#x3002;&#x5C06;&#x6EDA;&#x52A8;&#x7684;&#x533A;&#x57DF;&#x63A7;&#x5236;&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x8303;&#x56F4;&#x5185;&#x3002;</li>
</ul>
<h2 id="references"><a href="#References" class="headerlink" title="References"></a>References</h2><p>[1]: <a href="https://en.wikipedia.org/wiki/Device-independent_pixel" target="_blank" rel="external">Wikipedia - Device-independent pixel</a><br>[2]: <a href="http://www.phonearena.com/phones/compare/Apple-iPhone-4s,Apple-iPhone-3G/phones/5257%2C2962" target="_blank" rel="external">Apple iPhone 4s vs Apple iPhone 3G</a><br>[3]: <a href="http://viewportsizes.com/?filter=iphone" target="_blank" rel="external">Viewport Sizes</a><br>[4]: <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Mobile/Viewport_meta_tag" target="_blank" rel="external">Mozilla - Using the viewport meta tag to control layout on mobile browsers</a><br>[5]: <a href="http://caniuse.com/#search=flexbox" target="_blank" rel="external">Can I use Flexbox</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程工具/">编程工具</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Udacity/">Udacity</a><a href="/tags/前端/">前端</a><a href="/tags/RWD/">RWD</a><a href="/tags/Design/">Design</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/10/05/udacity-responsive-web-design-notes/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/09/29/go-out-border/" title="去「界外」看看" itemprop="url">去「界外」看看</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-09-29T13:14:40.000Z" itemprop="datePublished"> 发表于 2016-09-29</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x5904;&#x4E8E;&#x516C;&#x53F8;-&#x5BB6;&#x7684;&#x4E24;&#x70B9;&#x4E00;&#x7EBF;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x7ECF;&#x5386;&#x3002;&#x67D0;&#x4E00;&#x5929;&#xFF0C;&#x4F60;&#x5F00;&#x8F66;&#x5F00;&#x9519;&#x8DEF;&#x6216;&#x8005;&#x5750;&#x516C;&#x4EA4;&#x5750;&#x8FC7;&#x7AD9;&#x4E86;&#xFF0C;&#x7A81;&#x7136;&#x60CA;&#x5947;&#x7684;&#x53D1;&#x73B0;&#x5C31;&#x5728;&#x4F60;&#x9644;&#x8FD1;&#x7684;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x8DDF;&#x4F60;&#x60F3;&#x8C61;&#x7684;&#x4E0D;&#x5927;&#x4E00;&#x6837;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x5F88;&#x597D;&#x73A9;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x67D0;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x5728;&#x5BB6;&#x9644;&#x8FD1;&#x5403;&#x5B8C;&#x665A;&#x996D;&#xFF0C;&#x7A81;&#x53D1;&#x5947;&#x60F3;&#x5F80;&#x4ECE;&#x6765;&#x90FD;&#x6709;&#x53BB;&#x8FC7;&#x7684;&#x8857;&#x7684;&#x53E6;&#x4E00;&#x5934;&#x6563;&#x6B65;&#x8D70;&#x53BB;&#x3002;&#x8D70;&#x51FA;&#x4E0D;&#x5230;&#x4E24;&#x516C;&#x91CC;&#xFF0C;&#x60CA;&#x5947;&#x7684;&#x53D1;&#x73B0;&#x539F;&#x6765;&#x79BB;&#x6211;&#x5BB6;&#x8FD9;&#x4E48;&#x8FD1;&#x7684;&#x5730;&#x65B9;&#x7ADF;&#x7136;&#x8FD8;&#x6709;&#x4E00;&#x5904;&#x8FF7;&#x4F60;&#x7684;&#x516C;&#x56ED;&#x3002;&#x7A81;&#x7136;&#x5FC3;&#x751F;&#x611F;&#x6168;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x7F8E;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x80FD;&#x5C31;&#x5728;&#x4F60;&#x9644;&#x8FD1;&#xFF0C;&#x53EA;&#x662F;&#x4F60;&#x4E00;&#x76F4;&#x88AB;&#x4E00;&#x4E2A;&#x9690;&#x5F62;&#x7684;&#x8FB9;&#x754C;&#x9650;&#x5B9A;&#x4F4F;&#x4E86;&#x4F60;&#x63A2;&#x7D22;&#x7684;&#x811A;&#x6B65;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#x662F;&#x201C;&#x65C5;&#x6E38;&#x5C31;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x4F60;&#x719F;&#x6089;&#x7684;&#x5730;&#x65B9;&#x8DD1;&#x5230;&#x4F60;&#x4E00;&#x4E2A;&#x522B;&#x4EBA;&#x719F;&#x6089;&#x7684;&#x5730;&#x65B9;&#x201D;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x4EBA;&#x559C;&#x6B22;&#x65C5;&#x6E38;&#xFF1F;&#x56E0;&#x4E3A;&#x5728;&#x4E00;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4EBA;&#x4EEC;&#x5F80;&#x5F80;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F60;&#x53BB;&#x7684;&#x5730;&#x65B9;&#x79BB;&#x4F60;&#x8D8A;&#x8FDC;&#x53EF;&#x80FD;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x80FD;&#x591F;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x7684;&#x51B2;&#x51FB;&#x4E5F;&#x5C31;&#x8D8A;&#x5F3A;&#x3002;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x7684;&#x4EBA;&#x5230;&#x4F60;&#x6240;&#x751F;&#x6D3B;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x540C;&#x6837;&#x4F1A;&#x53D7;&#x5230;&#x7C7B;&#x4F3C;&#x7684;&#x51B2;&#x51FB;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x964C;&#x751F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4EBA;&#x4EEC;&#x7684;&#x5404;&#x4E2A;&#x611F;&#x5B98;&#x90FD;&#x5904;&#x5728;&#x5174;&#x594B;&#x3001;&#x7126;&#x8651;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x6781;&#x529B;&#x5F97;&#x53BB;&#x5438;&#x53D6;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x7136;&#x540E;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x98DE;&#x901F;&#x7684;&#x8FD0;&#x7B97;&#x3002;&#x8D70;&#x5728;&#x4E00;&#x4E2A;&#x5F02;&#x56FD;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x53EF;&#x80FD;&#x8DEF;&#x8FB9;&#x7684;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x6876;&#x3001;&#x4E00;&#x4E2A;&#x6D41;&#x6D6A;&#x6C49;&#x3001;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x62DB;&#x724C;&#x90FD;&#x80FD;&#x591F;&#x5438;&#x5F15;&#x4F60;&#x9A7B;&#x8DB3;&#x53BB;&#x89C2;&#x5BDF;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4ECE;&#x6765;&#x6CA1;&#x89C1;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F46;&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x5F85;&#x4E0A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4F60;&#x53D8;&#x5F97;&#x8DDF;&#x672C;&#x5730;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x201C;&#x611F;&#x5B98;&#x201D;&#x5173;&#x95ED;&#x4E86;&#xFF0C;&#x4E0D;&#x518D;&#x62B1;&#x6709;&#x6781;&#x5927;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x53BB;&#x89C2;&#x5BDF;&#x5468;&#x906D;&#x7684;&#x4E8B;&#x7269;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x517B;&#x6210;&#x4E86;&#x4E60;&#x60EF;&#xFF0C;&#x4E60;&#x60EF;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x7701;&#x53BB;&#x5F88;&#x591A;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x8BA9;&#x4F60;&#x5F88;&#x8F7B;&#x677E;&#x7684;&#x53BB;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x4ECE;&#x5730;&#x94C1;&#x7AD9;&#x51FA;&#x6765;&#x4E0D;&#x7528;&#x601D;&#x8003;&#x662F;&#x5F80;&#x5DE6;&#x8D70;&#x8FD8;&#x662F;&#x5F80;&#x53F3;&#x8D70;&#xFF0C;&#x4F60;&#x7684;&#x4E60;&#x60EF;&#x4F1A;&#x628A;&#x4F60;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x5E26;&#x56DE;&#x5BB6;&#x3002;</p>
<p>&#x65C5;&#x6E38;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x9664;&#x4E86;&#x65C5;&#x6E38;&#x4EE5;&#x5916;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#x8FD8;&#x6709;&#x975E;&#x5E38;&#x591A;&#x7684;&#x7C7B;&#x4F3C;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x5728;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4F60;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x90FD;&#x662F;&#x5B58;&#x5728;&#x7684;&#x3002;&#x5C0F;&#x5230;&#x5237;&#x7259;&#x6D17;&#x8138;&#xFF0C;&#x5927;&#x5230;&#x516C;&#x53F8;&#x51B3;&#x7B56;&#xFF0C;&#x90FD;&#x6216;&#x591A;&#x6216;&#x5C11;&#x7684;&#x6536;&#x5230;&#x4E60;&#x60EF;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5F88;&#x806A;&#x660E;&#x4E5F;&#x5F88;&#x61D2;&#xFF0C;&#x5B83;&#x5E2E;&#x6211;&#x4EEC;&#x517B;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5904;&#x5904;&#x8FDB;&#x884C;&#x601D;&#x8003;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x8DDF;&#x7740;&#x719F;&#x6089;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x80FD;&#x591F;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x5927;&#x8111;&#x7684;&#x806A;&#x660E;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5728;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x4EEC;&#x53D8;&#x5F97;&#x66F4;&#x8F7B;&#x677E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x806A;&#x660E;&#x4E5F;&#x4E3A;&#x6211;&#x4EEC;&#x8BBE;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x65E0;&#x5F62;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x4E0D;&#x7559;&#x610F;&#x53EF;&#x80FD;&#x90FD;&#x4E0D;&#x4F1A;&#x53BB;&#x6CE8;&#x610F;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x8FB9;&#x754C;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FB9;&#x754C;&#x5185;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x201D;&#x5B89;&#x5168;&#x201D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x8DEF;&#x5F84;&#x5DF2;&#x7ECF;&#x88AB;&#x591A;&#x6B21;&#x8BC1;&#x660E;&#x8FC7;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;</p>
<p>&#x7136;&#x800C;&#x4E00;&#x6761;&#x201C;&#x5B89;&#x5168;&#x201D;&#x53EF;&#x884C;&#x7684;&#x8DEF;&#x5F84;&#x4E0D;&#x4EE3;&#x8868;&#x8FD9;&#x6761;&#x8DEF;&#x5F84;&#x662F;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5F53;&#x4E0B;&#x662F;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x4EE3;&#x8868;&#x5B83;&#x5728;&#x5916;&#x90E8;&#x6761;&#x4EF6;&#x53D8;&#x5316;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F9D;&#x7136;&#x662F;&#x6700;&#x4F18;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#x8FD9;&#x79CD;&#x5B89;&#x5168;&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5916;&#x754C;&#x7684;&#x6761;&#x4EF6;&#x4E0D;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E0D;&#x53D8;&#x3002;&#x800C;&#x4E14;&#x4E60;&#x60EF;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x60EF;&#x6027;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4E60;&#x60EF;&#x4F60;&#x575A;&#x6301;&#x7684;&#x8D8A;&#x4E45;&#x5B83;&#x7684;&#x60EF;&#x6027;&#x5C31;&#x8D8A;&#x5927;&#xFF0C;&#x4F60;&#x8981;&#x6539;&#x53D8;&#x5B83;&#x7684;&#x96BE;&#x5EA6;&#x53CA;&#x6240;&#x5E26;&#x6765;&#x7684;&#x75DB;&#x82E6;&#x4E5F;&#x5C31;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x7684;&#x7ED3;&#x8BBA;&#x662F;<strong>&#x8981;&#x9700;&#x8981;&#x7ECF;&#x5E38;&#x53BB;&#x300C;&#x754C;&#x5916;&#x300D;&#x770B;&#x770B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x968F;&#x65F6;&#x6539;&#x53D8;&#x8DEF;&#x5F84;&#x7684;&#x80FD;&#x529B;</strong>&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7ED3;&#x8BBA;&#x5C31;&#x5F15;&#x51FA;&#x4E86;&#x53E6;&#x5916;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8EAB;&#x5904;&#x4E8E;&#x8FB9;&#x754C;&#x91CC;&#x9762;&#x7684;&#x4EBA;&#x5982;&#x4F55;&#x53BB;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x8FB9;&#x754C;&#x3002;&#x90FD;&#x8BF4;&#x8981;Think out of box&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;box&#xFF1F;</li>
<li>&#x53D1;&#x73B0;&#x4EE5;&#x540E;&#x5230;&#x5916;&#x9762;&#x770B;&#x770B;&#xFF0C;&#x80AF;&#x5B9A;&#x4E0D;&#x80FD;&#x662F;&#x7B80;&#x5355;&#x5730;&#x770B;&#x770B;&#x5C31;&#x5B8C;&#x4E86;&#x3002;&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x7684;&#x5FC3;&#x6001;&#x53BB;&#x770B;&#x5F85;&#x754C;&#x5916;&#x7684;&#x4E8B;&#x7269;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x624D;&#x80FD;&#x591F;&#x62D3;&#x5BBD;&#x81EA;&#x5DF1;&#x7684;&#x8FB9;&#x754C;&#xFF1F;</li>
</ol>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5BB9;&#x6211;&#x518D;&#x60F3;&#x60F3;&#x3002;</p>
<center><em>== end of  file ==</em></center>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">


  <div class="article-tags">
  
  <span></span> <a href="/tags/随想/">随想</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/09/29/go-out-border/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/09/06/effective-cpp-reading-notes-5/" title="《Effective C++》读书笔记(5)" itemprop="url">《Effective C++》读书笔记(5)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-09-06T13:15:57.000Z" itemprop="datePublished"> 发表于 2016-09-06</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="4-&#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;"><a href="#4-&#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;" class="headerlink" title="4. &#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;"></a>4. &#x8BBE;&#x8BA1;&#x4E0E;&#x58F0;&#x660E;</h2><h3 id="&#x6761;&#x6B3E;18&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;"><a href="#&#x6761;&#x6B3E;18&#xFF1A;&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;" class="headerlink" title="&#x6761;&#x6B3E;18&#xFF1A;&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;"></a>&#x6761;&#x6B3E;18&#xFF1A;&#x8BA9;&#x63A5;&#x53E3;&#x5BB9;&#x6613;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x6613;&#x88AB;&#x8BEF;&#x7528;</h3><blockquote>
<ul>
<li>&#x597D;&#x7684;&#x501F;&#x53E3;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x88AB;&#x8BEF;&#x7528;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x4F60;&#x7684;&#x6240;&#x6709;&#x63A5;&#x53E3;&#x4E2D;&#x52AA;&#x529B;&#x8FBE;&#x6210;&#x8FD9;&#x4E9B;&#x6027;&#x8D28;&#x3002;</li>
<li>&#x201C;&#x4FC3;&#x8FDB;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x201D;&#x7684;&#x529E;&#x6CD5;&#x5305;&#x62EC;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0E;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x7684;&#x884C;&#x4E3A;&#x517C;&#x5BB9;&#x3002;</li>
<li>&#x201C;&#x963B;&#x6B62;&#x8BEF;&#x7528;&#x201D;&#x7684;&#x529E;&#x6CD5;&#x5305;&#x62EC;&#x5EFA;&#x7ACB;&#x65B0;&#x7C7B;&#x578B;&#x3001;&#x9650;&#x5236;&#x7C7B;&#x578B;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x675F;&#x7F1A;&#x5BF9;&#x8C61;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x6D88;&#x9664;&#x5BA2;&#x6237;&#x7684;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x8D23;&#x4EFB;&#x3002;</li>
<li>std::shared_ptr&#x652F;&#x6301;&#x5B9A;&#x5236;&#x578B;&#x5220;&#x9664;&#x5668;&#xFF08;custom deleter&#xFF09;&#x3002;&#x53EF;&#x9632;&#x8303;DLL&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x88AB;&#x7528;&#x6765;&#x81EA;&#x52A8;&#x89E3;&#x9664;&#x4E92;&#x65A5;&#x9501;&#x7B49;&#x7B49;&#x3002;</li>
</ul>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x6761;&#x6B3E;&#x7684;&#x601D;&#x60F3;&#x5176;&#x5B9E;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x88AB;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x8C03;&#x7528;&#xFF0C;&#x4F60;&#x90FD;&#x9700;&#x8981;&#x8003;&#x8651;&#x63A5;&#x53E3;&#x7684;&#x6613;&#x7528;&#x6027;&#x3002;&#x5373;&#x4F7F;&#x4E0D;&#x66B4;&#x9732;&#xFF0C;&#x826F;&#x597D;&#x7684;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x4E5F;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x4F5C;&#x8005;&#x63D0;&#x51FA;&#x7684;&#x8FD9;&#x51E0;&#x70B9;&#x53EA;&#x662F;&#x5728;C++&#x8FD9;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x4E9B;&#x5C0F;&#x70B9;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x6613;&#x7528;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4EC5;&#x4EC5;&#x505A;&#x5230;&#x8FD9;&#x51E0;&#x70B9;&#x8FD8;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#x3002;</p>
<p><strong>&#x63A5;&#x53E3;&#x4E00;&#x81F4;&#x6027;</strong></p>
<p>&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#x9664;&#x975E;&#x6709;&#x5145;&#x5206;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x5426;&#x5219;&#x6700;&#x597D;&#x8BA9;&#x7C7B;&#x578B;&#x4E0E;&#x5185;&#x7F6E;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x884C;&#x4E3A;&#x5C3D;&#x91CF;&#x4E00;&#x81F4;&#x3002;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x4F7F;&#x7528;&#x8005;&#x9519;&#x8BEF;&#x4F7F;&#x7528;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8865;&#x5145;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x63D0;&#x4F9B;&#x4E00;&#x6574;&#x5957;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x63A5;&#x53E3;&#x76F8;&#x4E92;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x98CE;&#x683C;&#x3002;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#xFF1A;&#x51FD;&#x6570;&#x7684;&#x547D;&#x540D;&#x98CE;&#x683C;&#x3001;&#x51FD;&#x6570;&#x7684;&#x884C;&#x4E3A;&#x5C3D;&#x91CF;&#x4FDD;&#x6301;&#x7EDF;&#x4E00;&#x7684;&#x98CE;&#x683C;&#x3002;</p>
<p><strong>&#x9632;&#x6B62;&#x8BEF;&#x7528;</strong></p>
<blockquote>
<p>&#x4EFB;&#x4F55;&#x63A5;&#x53E3;&#x5982;&#x679C;&#x8981;&#x6C42;&#x5BA2;&#x6237;&#x5FC5;&#x987B;&#x8BB0;&#x5F97;&#x505A;&#x67D0;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x6709;&#x7740;&#x201C;&#x4E0D;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x201D;&#x7684;&#x503E;&#x5411;&#xFF0C;&#x56E0;&#x4E3A;&#x5BA2;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x5FD8;&#x8BB0;&#x505A;&#x90A3;&#x4EF6;&#x4E8B;&#x3002;</p>
</blockquote>
<h3 id="&#x6761;&#x6B3E;19&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type"><a href="#&#x6761;&#x6B3E;19&#xFF1A;&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type" class="headerlink" title="&#x6761;&#x6B3E;19&#xFF1A;&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type"></a>&#x6761;&#x6B3E;19&#xFF1A;&#x8BBE;&#x8BA1;class&#x72B9;&#x5982;&#x8BBE;&#x8BA1;type</h3><blockquote>
<p>Class &#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x662F;type&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5728;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;type&#x4E4B;&#x524D;&#xFF0C;&#x786E;&#x4FDD;&#x9605;&#x8BFB;&#x4E86;&#x672C;&#x6761;&#x76EE;&#x7684;&#x6240;&#x6709;&#x8BA8;&#x8BBA;&#x4E3B;&#x9898;&#x3002;</p>
</blockquote>
<ul>
<li><strong>&#x65B0;type&#x7684;&#x5BF9;&#x8C61;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x88AB;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#xFF1F;</strong> &#x8FD9;&#x4E2A;&#x6D89;&#x53CA;&#x5230;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4EE5;&#x53CA;operator new, operator delete, operator new[], operator delete[]&#x3002;</li>
<li><strong>&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x5316;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x8D4B;&#x503C;&#x8BE5;&#x6709;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5DEE;&#x522B;&#xFF1F;</strong>&#x8FD9;&#x4E2A;&#x4E3B;&#x8981;&#x662F;&#x8981;&#x8003;&#x8651;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x7B26;&#x7684;&#x884C;&#x4E3A;&#x3002;</li>
<li><strong>&#x65B0;type&#x7684;&#x5BF9;&#x8C61;&#x5982;&#x679C;&#x88AB;passed by value&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF1F;</strong></li>
<li><strong>&#x4EC0;&#x4E48;&#x4E8B;&#x65B0;type&#x7684;&#x201C;&#x5408;&#x6CD5;&#x503C;&#x201D;&#xFF1F;</strong>&#x8FD9;&#x70B9;&#x4E3B;&#x8981;&#x662F;&#x8981;&#x6CE8;&#x610F;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x548C;&#x5408;&#x6CD5;&#x6027;&#x68C0;&#x67E5;&#x3002;</li>
<li><strong>&#x4F60;&#x7684;&#x65B0;type&#x9700;&#x8981;&#x914D;&#x5408;&#x67D0;&#x4E2A;&#x7EE7;&#x627F;&#x56FE;&#x7CFB;&#x5417;&#xFF1F;</strong>&#x5982;&#x679C;&#x4F60;&#x7EE7;&#x627F;&#x5176;&#x4ED6;&#x7684;&#x7C7B;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5B83;&#x4EEC;&#x7684;&#x51FD;&#x6570;virtual&#x548C;non-virtual&#x6027;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7C7B;&#x53EF;&#x80FD;&#x88AB;&#x7EE7;&#x627F;&#x5C31;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4F60;&#x58F0;&#x660E;&#x7684;&#x51FD;&#x6570;&#x2014;&#x2014;&#x5C24;&#x5176;&#x662F;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;</li>
<li><strong>&#x4F60;&#x7684;&#x65B0;type&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8F6C;&#x6362;&#xFF1F;</strong>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7C7B;&#x578B;&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;&#x5176;&#x4ED6;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5B9A;&#x4E49;&#x663E;&#x5F0F;&#x8F6C;&#x6362;&#x6216;&#x8005;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x7684;&#x51FD;&#x6570;&#x3002;</li>
<li><strong>&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x7B26;&#x548C;&#x51FD;&#x6570;&#x5BF9;&#x6B64;&#x65B0;type&#x800C;&#x8A00;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF1F;</strong>&#x53C2;&#x8003;&#x6761;&#x6B3E;23&#xFF0C;24&#xFF0C;26.</li>
<li><strong>&#x8C01;&#x8BE5;&#x53D6;&#x7528;&#x65B0;type&#x7684;&#x6210;&#x5458;&#xFF1F;</strong>&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x5224;&#x65AD;&#x54EA;&#x4E00;&#x4E9B;&#x6210;&#x5458;&#x4E3A;public&#xFF0C;&#x54EA;&#x4E2A;&#x4E3A;protected&#x3002;</li>
<li><strong>&#x4F60;&#x7684;&#x65B0;type&#x6709;&#x591A;&#x4E48;&#x4E00;&#x822C;&#x5316;&#xFF08;generic&#xFF09;&#xFF1F;</strong>&#x5982;&#x679C;&#x5F88;&#x4E00;&#x822C;&#x5316;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;class template&#x3002;</li>
<li><strong>&#x4F60;&#x771F;&#x7684;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x65B0;type&#x5427;&#xFF1F;</strong>&#x5982;&#x679C;&#x53EA;&#x662F;&#x5B9A;&#x4E49;&#x65B0;&#x7684;derived class&#x4EE5;&#x4FBF;&#x4E3A;&#x65E2;&#x6709;&#x7684;class&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x8BF4;&#x4E0D;&#x5B9A;&#x5355;&#x7EAF;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;non-member&#x51FD;&#x6570;&#x6216;template&#x66F4;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x76EE;&#x6807;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x56DE;&#x7B54;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019;&#x5C3D;&#x91CF;&#x7684;&#x53BB;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x8BBE;&#x8BA1;&#x51FA;&#x4E00;&#x4E2A;&#x6613;&#x7528;&#x5408;&#x7406;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;20&#x5B81;&#x4EE5;-pass-by-reference-to-const-&#x66FF;&#x6362;-pass-by-value"><a href="#&#x6761;&#x6B3E;20&#xFF1A;&#x5B81;&#x4EE5;-pass-by-reference-to-const-&#x66FF;&#x6362;-pass-by-value" class="headerlink" title="&#x6761;&#x6B3E;20&#xFF1A;&#x5B81;&#x4EE5; pass-by-reference-to-const &#x66FF;&#x6362; pass-by-value"></a>&#x6761;&#x6B3E;20&#xFF1A;&#x5B81;&#x4EE5; pass-by-reference-to-const &#x66FF;&#x6362; pass-by-value</h3><blockquote>
<ul>
<li>&#x5C3D;&#x91CF;&#x4EE5;pass-by-reference-to-const &#x66FF;&#x6362; pass-by-value&#x3002;&#x524D;&#x8005;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x641E;&#x7B11;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5207;&#x5272;&#x95EE;&#x9898;&#xFF08;slicing problem&#xFF09;&#x3002;</li>
<li>&#x4EE5;&#x4E0A;&#x89C4;&#x5219;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;STL&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x548C;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x3002;&#x5BF9;&#x4E8E;&#x5B83;&#x4EEC;&#x800C;&#x8A00;&#xFF0C;pass-by-value&#x5F80;&#x5F80;&#x6BD4;&#x8F83;&#x9002;&#x5F53;&#x3002;</li>
</ul>
</blockquote>
<p>C++&#x9ED8;&#x8BA4;&#x7684;&#x4F20;&#x9012;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x662F;by-value&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6709;&#x5F88;&#x591A;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x6216;&#x8005;&#x6709;&#x5F88;&#x6DF1;&#x7684;&#x7EE7;&#x627F;&#x7ED3;&#x6784;&#x3002;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x548C;&#x9500;&#x6BC1;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x7684;&#x5F00;&#x9500;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7528;pass by reference&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x80FD;&#x591F;&#x8282;&#x7701;&#x4E0B;&#x8FD9;&#x79CD;&#x5F00;&#x59CB;&#x3002;&#x52A0;&#x4E0A;const&#x662F;&#x907F;&#x514D;&#x5BF9;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;</p>
<p>Pass by value&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x5207;&#x5272;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x5BF9;&#x8C61;&#x4EE5;pass-by-value&#x7684;&#x5F62;&#x5F0F;&#x4F20;&#x9012;&#x5230;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x5C06;&#x4F1A;&#x88AB;&#x5207;&#x5272;&#x800C;&#x5931;&#x53BB;&#x5B50;&#x7C7B;&#x7279;&#x6709;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x5931;&#x53BB;&#x591A;&#x6001;&#x6027;&#x3002;pass-by-reference&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;reference&#x5F80;&#x5F80;&#x4EE5;&#x6307;&#x9488;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x622A;&#x65AD;&#x5BF9;&#x8C61;&#x4E5F;&#x540C;&#x65F6;&#x4F1A;&#x4FDD;&#x6709;&#x591A;&#x6001;&#x6027;&#x3002;</p>
<p>&#x51B3;&#x5B9A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;pass by value&#x8FD8;&#x662F;pass by reference&#x7684;&#x4F9D;&#x636E;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#x6570;&#x91CF;&#xFF0C;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x5728;&#x62F7;&#x8D1D;&#x7684;&#x65F6;&#x5019;&#x662F;&#x5426;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6602;&#x8D35;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E9B;&#x4F8B;&#x5916;&#xFF0C;&#x5373;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;STL&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x548C;&#x51FD;&#x6570;&#x5BF9;&#x8C61;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916; pass-by-reference-to-const &#x4F18;&#x4E8E; pass-by-value&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;21&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference"><a href="#&#x6761;&#x6B3E;21&#xFF1A;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#xFF0C;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference" class="headerlink" title="&#x6761;&#x6B3E;21&#xFF1A;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#xFF0C;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference"></a>&#x6761;&#x6B3E;21&#xFF1A;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x662F;&#xFF0C;&#x522B;&#x5984;&#x60F3;&#x8FD4;&#x56DE;&#x5176;reference</h3><blockquote>
<ul>
<li>&#x7EDD;&#x4E0D;&#x8981;&#x8FD4;&#x56DE;pointer&#x6216;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;local stack&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8FD4;&#x56DE;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;heap-allocated&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x8FD4;&#x56DE;pointer&#x6216;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;local static&#x5BF9;&#x8C61;&#x800C;&#x6709;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
</ul>
</blockquote>
<p>&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;pointer&#x6216;&#x8005;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;local stack&#x5BF9;&#x8C61;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;local stack&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8FD4;&#x56DE;&#x7684;&#x90A3;&#x4E2A;&#x6307;&#x9488;&#x6216;&#x8005;&#x5F15;&#x7528;&#x5C06;&#x4F1A;&#x6307;&#x5411;&#x4E00;&#x5757;&#x88AB;&#x9500;&#x6BC1;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x6307;&#x5411;&#x4E00;&#x4E2A;heap-allocated&#x7684;&#x5BF9;&#x8C61;&#x4E5F;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x628A;&#x9500;&#x6BC1;&#x5BF9;&#x8C61;&#x7684;&#x4EFB;&#x52A1;&#x79FB;&#x4EA4;&#x7ED9;&#x4E86;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x7684;&#x4EBA;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4EBA;&#x4EEC;&#x4F1A;&#x5FD8;&#x8BB0;&#x3002;&#x6216;&#x8005;&#x8BF4;&#x6240;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x5E76;&#x6CA1;&#x6709;&#x8BA9;&#x4ED6;&#x6709;&#x673A;&#x4F1A;&#x53BB;&#x9500;&#x6BC1;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">const Rational&amp; operator * (const Rational&amp; lhs,</span><br><span class="line">							const Rational&amp; rhs) {</span><br><span class="line">	...</span><br><span class="line">	return *result;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">Rational w, x, y, z;</span><br><span class="line">w = x * y * z;</span><br></pre></td></tr></table></figure>
<p>&#x53EA;&#x6709;&#x5728;&#x7C7B;&#x4F3C;&#x4E8E;&#x5355;&#x4F8B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;reference&#x6307;&#x5411;&#x4E00;&#x4E2A;static&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x6761;&#x6B3E;4&#x4E2D;FileSystem&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;22&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private"><a href="#&#x6761;&#x6B3E;22&#xFF1A;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private" class="headerlink" title="&#x6761;&#x6B3E;22&#xFF1A;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private"></a>&#x6761;&#x6B3E;22&#xFF1A;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private</h3><blockquote>
<ul>
<li>&#x5207;&#x8BB0;&#x5C06;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A;private&#xFF0C;&#x8FD9;&#x53EF;&#x8D4B;&#x4E88;&#x5BA2;&#x6237;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3001;&#x53EF;&#x7EC6;&#x5FAE;&#x5212;&#x5206;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x3001;&#x5141;&#x8BFA;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x83B7;&#x5F97;&#x4FDD;&#x8BC1;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;class&#x4F5C;&#x8005;&#x4EE5;&#x5145;&#x5206;&#x7684;&#x5B9E;&#x73B0;&#x5F39;&#x6027;&#x3002;</li>
<li>protected &#x5E76;&#x4E0D;&#x6BD4;public&#x66F4;&#x5177;&#x5C01;&#x88C5;&#x6027;&#x3002;</li>
</ul>
</blockquote>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;public&#x4E0D;&#x597D;&#xFF1F;</strong></p>
<p>public&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x7834;&#x574F;&#x4E86;&#x7C7B;&#x7684;&#x5C01;&#x88C5;&#x6027;&#xFF0C;&#x5B83;&#x5C06;&#x6210;&#x5458;&#x76F4;&#x63A5;&#x66B4;&#x9732;&#x7ED9;&#x5BA2;&#x6237;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x672A;&#x6765;&#x4FEE;&#x6539;&#x5B57;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x4F7F;&#x7528;&#x8005;&#x3002;</p>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;protected&#x4E5F;&#x4E0D;&#x597D;&#xFF1F;</strong></p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x5373;<em>&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x5C01;&#x88C5;&#x6027;&#x4E0E;&#x201C;&#x5176;&#x5185;&#x5BB9;&#x6539;&#x53D8;&#x65F6;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x7834;&#x574F;&#x91CF;&#x201D;&#x6210;&#x53CD;&#x6BD4;&#x3002;</em>&#x5982;&#x679C;&#x4ECE;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x51FA;&#x53D1;&#x7684;&#x8BDD;&#xFF0C;protected&#x867D;&#x7136;&#x6BD4;public&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x597D;&#x592A;&#x591A;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x8BF4;&#x4F60;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x662F;&#x5BF9;&#x5916;&#x66B4;&#x9732;&#x7684;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x963B;&#x6B62;&#x7528;&#x6237;&#x7EE7;&#x627F;&#x4F60;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF08;C++&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x7C7B;&#x4F3C;&#x4E8E;final class&#x7684;&#x6982;&#x5FF5;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x8BF4;protected&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x4E5F;&#x4E0D;&#x597D;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/09/06/effective-cpp-reading-notes-5/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/08/15/effective-cpp-reading-notes-4/" title="《Effective C++》读书笔记(4)" itemprop="url">《Effective C++》读书笔记(4)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-08-15T13:06:32.000Z" itemprop="datePublished"> 发表于 2016-08-15</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="2-&#x6784;&#x9020;&#x6790;&#x6784;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"><a href="#2-&#x6784;&#x9020;-&#x6790;&#x6784;-&#x8D4B;&#x503C;&#x8FD0;&#x7B97;" class="headerlink" title="2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"></a>2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;</h2><h3 id="&#x6761;&#x6B3E;10&#x4EE4;-operator-&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;-reference-to-this"><a href="#&#x6761;&#x6B3E;10&#xFF1A;&#x4EE4;-operator-&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;-reference-to-this" class="headerlink" title="&#x6761;&#x6B3E;10&#xFF1A;&#x4EE4; operator= &#x8FD4;&#x56DE;&#x4E00;&#x4E2A; reference to *this"></a>&#x6761;&#x6B3E;10&#xFF1A;&#x4EE4; operator= &#x8FD4;&#x56DE;&#x4E00;&#x4E2A; reference to *this</h3><blockquote>
<ul>
<li>&#x4EE4;&#x8D4B;&#x503C;&#xFF08;assignment&#xFF09;&#x64CD;&#x4F5C;&#x7B26;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; reference to *this&#x3002;</li>
</ul>
</blockquote>
<p>&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF1A;</p>
<ol>
<li>&#x5141;&#x8BB8;&#x8FDE;&#x9501;&#x8D4B;&#x503C;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;<code>int x, y, z; x = y = z;</code></li>
<li>&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x88AB;&#x666E;&#x904D;&#x7684;&#x9075;&#x5B88;&#xFF08;&#x5305;&#x62EC;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x7684;&#x5F88;&#x591A;&#x7C7B;&#x578B;&#xFF09;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x7C7B;&#x7684;&#x884C;&#x4E3A;&#x4E0E;&#x5176;&#x4ED6;&#x7C7B;&#x4E00;&#x81F4;&#x6027;&#x3002;</li>
</ol>
<h3 id="&#x6761;&#x6B3E;11&#x5728;operator&#x4E2D;&#x5904;&#x7406;&#x81EA;&#x6211;&#x8D4B;&#x503C;"><a href="#&#x6761;&#x6B3E;11&#xFF1A;&#x5728;operator-&#x4E2D;&#x5904;&#x7406;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x201D;" class="headerlink" title="&#x6761;&#x6B3E;11&#xFF1A;&#x5728;operator=&#x4E2D;&#x5904;&#x7406;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x201D;"></a>&#x6761;&#x6B3E;11&#xFF1A;&#x5728;operator=&#x4E2D;&#x5904;&#x7406;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x201D;</h3><blockquote>
<ul>
<li>&#x786E;&#x4FDD;&#x5F53;&#x5BF9;&#x8C61;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x65F6;operator=&#x6709;&#x826F;&#x597D;&#x884C;&#x4E3A;&#x3002;&#x5176;&#x4E2D;&#x6280;&#x672F;&#x5305;&#x62EC;&#x6BD4;&#x8F83;&#x201C;&#x6765;&#x6E90;&#x5BF9;&#x8C61;&#x201D;&#x548C;&#x201C;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x201D;&#x7684;&#x5730;&#x5740;&#x3001;&#x7CBE;&#x5FC3;&#x5468;&#x5230;&#x7684;&#x8BED;&#x53E5;&#x987A;&#x5E8F;&#x3001;&#x4EE5;&#x53CA;copy-and-swap&#x3002;</li>
<li>&#x786E;&#x5B9A;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5176;&#x884C;&#x4E3A;&#x4E3A;&#x4ECD;&#x7136;&#x6B63;&#x786E;&#x3002;</li>
</ul>
</blockquote>
<p>&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x88AB;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">Widget w[];</span><br><span class="line">// some operation</span><br><span class="line">w[i] = w[j];	//w[i]&#x548C;w[j]&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;</span><br></pre></td></tr></table></figure></p>
<p>&#x53EF;&#x4EE5;&#x5728;operator= &#x64CD;&#x4F5C;&#x4E2D;&#x505A;&#x4E00;&#x4E0B;&#x7B80;&#x5355;&#x7684;&#x6307;&#x9488;&#x6BD4;&#x8F83;&#x6765;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x64CD;&#x4F5C;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">Widget&amp; Widget::operator=(const Widget&amp; rhs) {</span><br><span class="line">    if (this == &amp;rhs) return *this;</span><br><span class="line">    ...</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5728;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x4E2D;&#x505A;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x63A7;&#x5236;&#x903B;&#x8F91;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x8D77;&#x201C;&#x81EA;&#x6211;&#x8D4B;&#x503C;&#x5B89;&#x5168;&#x6027;&#x201D;&#x8FD8;&#x8981;&#x4FDD;&#x8BC1;&#x201C;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x6027;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x4F1A;&#x5728;&#x6761;&#x6B3E;xx&#x4E2D;&#x5177;&#x4F53;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;12&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;"><a href="#&#x6761;&#x6B3E;12&#xFF1A;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;" class="headerlink" title="&#x6761;&#x6B3E;12&#xFF1A;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;"></a>&#x6761;&#x6B3E;12&#xFF1A;&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x52FF;&#x5FD8;&#x5176;&#x6BCF;&#x4E00;&#x4E2A;&#x6210;&#x5206;</h3><blockquote>
<ul>
<li>Copying &#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x786E;&#x4FDD;&#x590D;&#x5236;&#x201C;&#x5BF9;&#x8C61;&#x5185;&#x7684;&#x6240;&#x6709;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x201D;&#x53CA;&#x201C;&#x6240;&#x6709;base class&#x6210;&#x5206;&#x201D;</li>
<li>&#x4E0D;&#x8981;&#x5C1D;&#x8BD5;&#x4EE5;&#x67D0;&#x4E2A;copying&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x53E6;&#x4E00;&#x4E2A;copying&#x51FD;&#x6570;&#x3002;&#x5E94;&#x8BE5;&#x5C06;&#x5171;&#x540C;&#x673A;&#x80FD;&#x653E;&#x8FDB;&#x7B2C;&#x4E09;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x5E76;&#x7531;&#x4E24;&#x4E2A;copying&#x51FD;&#x6570;&#x5171;&#x540C;&#x8C03;&#x7528;&#x3002;</li>
</ul>
</blockquote>
<p>copy&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;copy assignment&#x64CD;&#x4F5C;&#x7B26;&#x6211;&#x4EEC;&#x7EDF;&#x79F0;&#x4E3A;copying&#x51FD;&#x6570;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;copying&#x52A1;&#x5FC5;&#x8981;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x5B57;&#x6BB5;&#x90FD;&#x8FDB;&#x884C;&#x4E86;&#x590D;&#x5236;&#xFF0C;&#x540C;&#x4E8B;&#x5982;&#x679C;&#x6709;&#x57FA;&#x7C7B;&#x8981;&#x4FDD;&#x8BC1;&#x76F8;&#x5BF9;&#x5E94;&#x7684;copying&#x51FD;&#x6570;&#x88AB;&#x6B63;&#x786E;&#x5F97;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x8BA4;&#x4E3A;&#x867D;&#x7136;&#x8BF4;copy&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;copy assignment&#x64CD;&#x4F5C;&#x7B26;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x4EE5;&#x67D0;&#x4E00;&#x4E2A;copying&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;copying&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x5E76;&#x4E0D;&#x5408;&#x7406;&#x3002;</p>
<h2 id="3-&#x8D44;&#x6E90;&#x7BA1;&#x7406;"><a href="#3-&#x8D44;&#x6E90;&#x7BA1;&#x7406;" class="headerlink" title="3. &#x8D44;&#x6E90;&#x7BA1;&#x7406;"></a>3. &#x8D44;&#x6E90;&#x7BA1;&#x7406;</h2><h3 id="&#x6761;&#x6B3E;13-&#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;"><a href="#&#x6761;&#x6B3E;13&#xFF1A;-&#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;" class="headerlink" title="&#x6761;&#x6B3E;13&#xFF1A; &#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;"></a>&#x6761;&#x6B3E;13&#xFF1A; &#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;</h3><blockquote>
<ul>
<li>&#x4E3A;&#x9632;&#x6B62;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;RAII&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x83B7;&#x5F97;&#x8D44;&#x6E90;&#x5E76;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x3002;</li>
<li>&#x4E24;&#x4E2A;&#x5E38;&#x88AB;&#x4F7F;&#x7528;&#x7684;RAII classes&#x5206;&#x522B;&#x662F;<code>tr1::shared_ptr</code>&#x548C;<code>auto_ptr</code>(C++ 11 &#x4E2D;&#x6709;<code>std::shared_ptr</code>&#x548C;<code>std::auto_ptr</code>)</li>
</ul>
</blockquote>
<p>&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x548C;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x5185;&#x5B58;/&#x8D44;&#x6E90;&#x5206;&#x914D;&#x5728;&#x5806;&#x4E0A;&#xFF0C;&#x88AB;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x63A7;&#x5236;&#x6D41;&#x79BB;&#x5F00;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x91CA;&#x653E;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5F15;&#x8D77;&#x7684;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x8D44;&#x6E90;&#x5305;&#x88C5;&#x6210;&#x5BF9;&#x8C61;&#x6765;&#x5B9E;&#x73B0;&#x5408;&#x7406;&#x7684;&#x91CA;&#x653E;&#x3002;</p>
<p>&#x201C;&#x4EE5;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#x201D; &#x901A;&#x5E38;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x201D;&#x8D44;&#x6E90;&#x53D6;&#x5F97;&#x65F6;&#x673A;&#x4FBF;&#x662F;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x673A;&#x201D;&#xFF08;<em>Resource Acquisition Is Initialization: RAII</em>&#xFF09;&#x3002;RAII&#x7684;&#x4E24;&#x4E2A;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF1A;</p>
<ul>
<li>&#x83B7;&#x5F97;&#x8D44;&#x6E90;&#x540E;&#x7ACB;&#x523B;&#x653E;&#x8FDB;&#x7BA1;&#x7406;&#x5BF9;&#x8C61;&#x5185;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5BF9;&#x8C61;&#x8FD0;&#x7528;&#x6790;&#x6784;&#x51FD;&#x6570;&#x786E;&#x4FDD;&#x8D44;&#x6E90;&#x5F97;&#x5230;&#x91CA;&#x653E;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x5B9A;&#x5236;RAII&#x7C7B;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x667A;&#x80FD;&#x6307;&#x9488;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4F5C;&#x4E3A;&#x7BA1;&#x7406;&#x5BF9;&#x8C61;&#x3002;</p>
<ul>
<li><code>auto_ptr</code> - <code>auto_ptr</code>&#x88AB;&#x9500;&#x6BC1;&#x65F6;&#x4F1A;&#x81EA;&#x52A8;&#x5220;&#x9664;&#x5B83;&#x6240;&#x6307;&#x4E4B;&#x7269;&#x3002;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x591A;&#x4E2A;<code>auto_ptr</code>&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#x4E00;&#x6B21;&#x4EE5;&#x4E0A;&#x3002;&#x53E6;&#x5916;&#x901A;&#x8FC7;copy&#x6784;&#x9020;&#x51FD;&#x6570;&#x6216;copy assignment&#x64CD;&#x4F5C;&#x7B26;&#x590D;&#x5236;&#x5B83;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x53D8;&#x6210;null&#x3002;</li>
<li><code>shared_ptr</code> -  <code>shared_ptr</code>&#x662F;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x539F;&#x7406;&#x7684;&#x667A;&#x80FD;&#x6307;&#x9488;&#x3002;&#x5B83;&#x80FD;&#x591F;&#x6301;&#x7EED;&#x8FFD;&#x8E2A;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x5BF9;&#x8C61;&#x6307;&#x5411;&#x67D0;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x7684;&#x590D;&#x5236;&#x884C;&#x4E3A;&#x4E5F;&#x770B;&#x4E0A;&#x53BB;&#x6B63;&#x5E38;&#x8BB8;&#x591A;&#x3002;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x65E0;&#x6CD5;&#x6253;&#x7834;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<h3 id="&#x6761;&#x6B3E;14&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;"><a href="#&#x6761;&#x6B3E;14&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;" class="headerlink" title="&#x6761;&#x6B3E;14&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;"></a>&#x6761;&#x6B3E;14&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x5C0F;&#x5FC3;copying&#x884C;&#x4E3A;</h3><blockquote>
<ul>
<li>&#x590D;&#x5236;RAII&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x4E00;&#x5E76;&#x590D;&#x5236;&#x5B83;&#x6240;&#x7BA1;&#x7406;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x8D44;&#x6E90;&#x7684;copying&#x884C;&#x4E3A;&#x51B3;&#x5B9A;RAII&#x5BF9;&#x8C61;&#x7684;copying&#x884C;&#x4E3A;&#x3002;</li>
<li>&#x666E;&#x904D;&#x800C;&#x5E38;&#x89C1;&#x7684;RAII class copying&#x884C;&#x4E3A;&#x662F;&#xFF1A;&#x7981;&#x6B62;copying&#x3001;&#x65BD;&#x884C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#xFF08;reference counting&#xFF09;&#x3002;&#x4E0D;&#x8FC7;&#x5176;&#x4ED6;&#x884C;&#x4E3A;&#x4E5F;&#x90FD;&#x53EF;&#x80FD;&#x88AB;&#x5B9E;&#x73B0;&#x3002;</li>
</ul>
</blockquote>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5B9A;&#x5236;RAII&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7684;&#x9700;&#x6C42;&#x6765;&#x63A7;&#x5236;&#x5176;&#x62F7;&#x8D1D;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4E0D;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x201C;&#x4E0D;&#x6109;&#x5FEB;&#x201D;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x62F7;&#x8D1D;&#x7684;&#x884C;&#x4E3A;&#x57FA;&#x672C;&#x6709;&#x4E0B;&#x9762;&#x51E0;&#x79CD;&#xFF1A;</p>
<ul>
<li><p><strong>&#x7981;&#x6B62;&#x590D;&#x5236;&#x3002;</strong> &#x5F88;&#x591A;&#x60C5;&#x51B5;&#x5BF9;RAII&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x590D;&#x5236;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4E00;&#x4E2A;Lock&#x7C7B;&#xFF0C;&#x4FDD;&#x5B58;&#x7740;&#x4E00;&#x4E2A;&#x9501;&#x3002;&#x5408;&#x7406;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x7981;&#x6B62;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x590D;&#x5236;&#x884C;&#x4E3A;&#x3002;</p>
</li>
<li><p><strong>&#x5BF9;&#x5E95;&#x5C42;&#x8D44;&#x6E90;&#x796D;&#x51FA;&#x201C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#x201D;&#x3002;</strong> &#x5982;&#x679C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4FDD;&#x6709;&#x8D44;&#x6E90;&#xFF0C;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x8005;&#x88AB;&#x9500;&#x6BC1;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x5C31;&#x5E94;&#x8BE5;&#x5728;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6765;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;<code>shared_ptr</code>&#x6765;&#x505A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;</p>
</li>
<li><p><strong>&#x590D;&#x5236;&#x5E95;&#x90E8;&#x8D44;&#x6E90;&#x3002;</strong>  &#x62F7;&#x8D1D;&#x65F6;&#x5C06;&#x5185;&#x90E8;&#x7684;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6DF1;&#x5C42;&#x62F7;&#x8D1D;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x88AB;&#x590D;&#x5236;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x8981;&#x590D;&#x5236;&#x6307;&#x5411;&#x5185;&#x5B58;&#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5E94;&#x8BE5;&#x590D;&#x5236;&#x5BF9;&#x5E94;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5185;&#x5B58;&#x3002;</p>
</li>
<li><p><strong>&#x8F6C;&#x79FB;&#x5E95;&#x5C42;&#x8D44;&#x6E90;&#x7684;&#x62E5;&#x6709;&#x6743;</strong> &#x5728;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#x7684;&#x573A;&#x5408;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;RAII&#x5BF9;&#x8C61;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x5F53;&#x88AB;&#x590D;&#x5236;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8D44;&#x6E90;&#x7684;&#x62E5;&#x6709;&#x6743;&#x5C06;&#x4F1A;&#x8FDB;&#x884C;&#x8F6C;&#x79FB;&#x3002;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x8DDF;<code>auto_ptr</code>&#x7684;&#x884C;&#x4E3A;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
</li>
</ul>
<h3 id="&#x6761;&#x6B3E;15&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;"><a href="#&#x6761;&#x6B3E;15&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;" class="headerlink" title="&#x6761;&#x6B3E;15&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;"></a>&#x6761;&#x6B3E;15&#xFF1A;&#x5728;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;</h3><blockquote>
<ul>
<li>APIs &#x5F80;&#x5F80;&#x8981;&#x6C42;&#x8BBF;&#x95EE;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#xFF08;raw resources&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E00;&#x4E2A;RAII classes&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x201C;&#x53D6;&#x5F97;&#x5176;&#x6240;&#x7BA1;&#x7406;&#x4E4B;&#x8D44;&#x6E90;&#x201D;&#x7684;&#x529E;&#x6CD5;&#x3002;</li>
<li>&#x5BF9;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x8BBF;&#x95EE;&#x53EF;&#x80FD;&#x7ECF;&#x7531;&#x663E;&#x5F0F;&#x8F6C;&#x6362;&#x6216;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#x663E;&#x793A;&#x8F6C;&#x6362;&#x6BD4;&#x8F83;&#x5B89;&#x5168;&#xFF0C;&#x4F46;&#x662F;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x5BF9;&#x5BA2;&#x6237;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x3002;</li>
</ul>
</blockquote>
<p>&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x7684;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x4E2D;&#x7684;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x770B;&#x4E0A;&#x53BB;&#x7834;&#x574F;&#x4E86;&#x5C01;&#x88C5;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7C7B;&#x8BBE;&#x8BA1;&#x7684;&#x521D;&#x8877;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;&#xFF0C;&#x5E76;&#x975E;&#x5BF9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x5B8C;&#x5168;&#x7684;&#x5C01;&#x88C5;&#x3002;&#x6240;&#x4EE5;&#x63D0;&#x4F9B;&#x83B7;&#x53D6;&#x539F;&#x59CB;&#x8D44;&#x6E90;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x7684;&#x505A;&#x6CD5;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x663E;&#x5F0F;&#x548C;&#x9690;&#x5F0F;&#x8F6C;&#x6362;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>&#x663E;&#x5F0F;&#x8F6C;&#x6362;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">class Font {</span><br><span class="line">public:</span><br><span class="line">    ...</span><br><span class="line">    FontHandle get() const { return f; }</span><br><span class="line">    ...</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p><strong>&#x9690;&#x5F0F;&#x8F6C;&#x6362;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">class Font {</span><br><span class="line">public:</span><br><span class="line">    ...</span><br><span class="line">    operator FontHandle() const { return f; }</span><br><span class="line">    ...</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x867D;&#x7136;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x90FD;&#x53EF;&#x884C;&#xFF0C;&#x4F46;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x663E;&#x5F0F;&#x7684;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5F88;&#x591A;&#x4E0D;&#x5C0F;&#x5FC3;&#x8FDB;&#x884C;&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x8FDB;&#x884C;&#x663E;&#x5F0F;&#x7684;&#x8C03;&#x7528;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;16&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;"><a href="#&#x6761;&#x6B3E;16&#xFF1A;&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;" class="headerlink" title="&#x6761;&#x6B3E;16&#xFF1A;&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;"></a>&#x6761;&#x6B3E;16&#xFF1A;&#x6210;&#x5BF9;&#x4F7F;&#x7528;new&#x548C;delete&#x65F6;&#x8981;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x5F62;&#x5F0F;</h3><blockquote>
<p>&#x5982;&#x679C;&#x4F60;&#x5728;new&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;[]&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x76F8;&#x5BF9;&#x5E94;&#x7684;delete&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4E5F;&#x4F7F;&#x7528;[]&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;new&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4E0D;&#x4F7F;&#x7528;[]&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x5728;&#x76F8;&#x5BF9;&#x5E94;&#x7684;delete&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;[]</p>
</blockquote>
<h3 id="&#x6761;&#x6B3E;17&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;"><a href="#&#x6761;&#x6B3E;17&#xFF1A;&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;" class="headerlink" title="&#x6761;&#x6B3E;17&#xFF1A;&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;"></a>&#x6761;&#x6B3E;17&#xFF1A;&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x7F6E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;</h3><blockquote>
<p>&#x4EE5;&#x72EC;&#x7ACB;&#x8BED;&#x53E5;&#x5C06;newed&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x4E8E;&#x667A;&#x80FD;&#x6307;&#x9488;&#x5185;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4E00;&#x65E6;&#x5F02;&#x5E38;&#x88AB;&#x629B;&#x51FA;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x96BE;&#x4EE5;&#x5BDF;&#x89C9;&#x7684;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#x3002;</p>
</blockquote>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">int priority();</span><br><span class="line">void processWidget(std::shared_ptr&lt;Widget&gt; pw, int p);</span><br><span class="line"></span><br><span class="line">// Bad</span><br><span class="line">processWidget(std::shared_ptr&lt;Widget&gt;(new Widget), priority());</span><br><span class="line"></span><br><span class="line">// Good</span><br><span class="line">std::shared_ptr&lt;Widget&gt; pw(new Widget)</span><br><span class="line">processWidget(pw, priority());</span><br></pre></td></tr></table></figure>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6709;&#x95EE;&#x9898;&#xFF1F;&#x56E0;&#x4E3A;&#x5728;C++&#x7F16;&#x8BD1;&#x5668;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4EE5;&#x4E0B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<ol>
<li>&#x6267;&#x884C;&#x201D;new Widget&#x201D;</li>
<li>&#x8C03;&#x7528;priority()</li>
<li>&#x8C03;&#x7528;std::shared_ptr&#x6784;&#x9020;&#x51FD;&#x6570;</li>
</ol>
<p>&#x5982;&#x679C;&#x7B2C;&#x4E8C;&#x90E8;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;&#x4E00;&#x6B65;&#x7533;&#x8BF7;&#x51FA;&#x6765;&#x7684;&#x8D44;&#x6E90;&#x8FD8;&#x672A;&#x653E;&#x5165;&#x667A;&#x80FD;&#x6307;&#x9488;&#x5185;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x4EBA;&#x53BB;&#x91CA;&#x653E;&#x5B83;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x9020;&#x6210;&#x4E86;&#x8D44;&#x6E90;&#x6CC4;&#x9732;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/08/15/effective-cpp-reading-notes-4/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/07/06/effective-cpp-reading-notes-3/" title="《Effective C++》读书笔记(3)" itemprop="url">《Effective C++》读书笔记(3)</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-07-06T13:13:10.000Z" itemprop="datePublished"> 发表于 2016-07-06</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="2-&#x6784;&#x9020;&#x6790;&#x6784;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"><a href="#2-&#x6784;&#x9020;-&#x6790;&#x6784;-&#x8D4B;&#x503C;&#x8FD0;&#x7B97;" class="headerlink" title="2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;"></a>2 &#x6784;&#x9020;/&#x6790;&#x6784;/&#x8D4B;&#x503C;&#x8FD0;&#x7B97;</h2><h3 id="&#x6761;&#x6B3E;05&#x4E86;&#x89E3;c&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;"><a href="#&#x6761;&#x6B3E;05&#xFF1A;&#x4E86;&#x89E3;C-&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;" class="headerlink" title="&#x6761;&#x6B3E;05&#xFF1A;&#x4E86;&#x89E3;C++&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;"></a>&#x6761;&#x6B3E;05&#xFF1A;&#x4E86;&#x89E3;C++&#x9ED8;&#x9ED8;&#x7F16;&#x5199;&#x5E76;&#x8C03;&#x7528;&#x54EA;&#x4E9B;&#x51FD;&#x6570;</h3><blockquote>
<p>&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x6697;&#x81EA;&#x4E3A;class&#x521B;&#x5EFA;<em>default</em>&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;<em>copy</em>&#x6784;&#x9020;&#x51FD;&#x6570;&#x3001;<em>copy assignment</em>&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x4EE5;&#x53CA;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;</p>
</blockquote>
<p>&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5565;&#x4E5F;&#x6CA1;&#x6709;&#x7684;&#x7C7B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">class Empty { }</span><br></pre></td></tr></table></figure>
<p>&#x7F16;&#x8BD1;&#x5668;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5E2E;&#x4F60;&#x751F;&#x6210;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">class Empty {</span><br><span class="line">public:</span><br><span class="line">  Empty() {...}     //&#x9ED8;&#x8BA4;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">  Empty(const Empty&amp; rhs) {...} //&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">  ~Empty(){...}     //&#x6790;&#x6784;&#x51FD;&#x6570;</span><br><span class="line">  Empty&amp; operator=(const Empty&amp; rhs) {...} // copy assignment&#x64CD;&#x4F5C;&#x7B26;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
<p>&#x662F;&#x5426;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x53D6;&#x51B3;&#x4E8E;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x662F;&#x5426;&#x9700;&#x8981;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5C31;&#x7528;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">Empty e1;		//&#x9ED8;&#x8BA4;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">				//&#x6790;&#x6784;&#x51FD;&#x6570;</span><br><span class="line">Empty e2(e1);	//&#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;</span><br><span class="line">e2 = e1;		//copy assignment&#x64CD;&#x4F5C;&#x7B26;</span><br></pre></td></tr></table></figure>
<h3 id="&#x6761;&#x6B3E;06&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;"><a href="#&#x6761;&#x6B3E;06&#xFF1A;&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;" class="headerlink" title="&#x6761;&#x6B3E;06&#xFF1A;&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;"></a>&#x6761;&#x6B3E;06&#xFF1A;&#x82E5;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x8BE5;&#x660E;&#x786E;&#x62D2;&#x7EDD;</h3><blockquote>
<ul>
<li>&#x4E3A;&#x9A73;&#x56DE;&#x7F16;&#x8BD1;&#x5668;&#x81EA;&#x52A8;&#xFF08;&#x6697;&#x81EA;&#xFF09;&#x63D0;&#x4F9B;&#x7684;&#x673A;&#x80FD;&#xFF0C;&#x53EF;&#x5C06;&#x76F8;&#x5E94;&#x7684;&#x6210;&#x5458;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x4E3A;private&#x5E76;&#x4E14;&#x4E0D;&#x4E88;&#x5B9E;&#x73B0;&#x3002;&#x4F7F;&#x7528;&#x50CF;<code>Uncopyable</code>&#x8FD9;&#x6837;&#x7684;base class&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x505A;&#x6CD5;&#x3002;</li>
</ul>
</blockquote>
<p>&#x6B63;&#x5982;&#x6761;&#x6B3E;5&#x4E2D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x663E;&#x793A;&#x5B9A;&#x4E49;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x9ED8;&#x8BA4;&#x4F1A;&#x4E3A;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x3002;&#x800C;&#x5728;&#x67D0;&#x4E00;&#x4E9B;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x6240;&#x5E26;&#x6765;&#x7684;&#x884C;&#x4E3A;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x5E94;&#x8BE5;&#x628A;&#x4F60;&#x60F3;&#x8981;&#x9690;&#x85CF;&#x7684;&#x65B9;&#x6CD5;&#x58F0;&#x660E;&#x4E3A;private&#x5E76;&#x4E0D;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x6837;&#x4EFB;&#x4F55;&#x5C1D;&#x8BD5;&#x53BB;&#x4F7F;&#x7528;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x9519;&#x8BEF;&#x3002;</p>
<p><strong><em>&#x4EC0;&#x4E48;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF1F;</em></strong></p>
<ul>
<li>private &#x6784;&#x9020;&#x51FD;&#x6570;<br>&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x591F;&#x968F;&#x610F;&#x7684;&#x81EA;&#x5DF1;&#x53BB;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3002;</li>
<li>private &#x6790;&#x6784;&#x51FD;&#x6570;<br>&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x6765;&#x7BA1;&#x7406;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4F60;&#x7684;&#x5B9E;&#x4F8B;&#x4F7F;&#x7528;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;0&#x5219;&#x4E0D;&#x80FD;&#x591F;&#x6790;&#x6784;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;Acquire&#xFF0C;Release&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x679C;&#x53EA;&#x662F;reference count&#x7684;&#x8BDD;&#xFF0C;&#x5229;&#x7528;shared_ptr&#x4E5F;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x3002;<br>&#x53C2;&#x8003;&#x94FE;&#x63A5;&#xFF1A;<a href="https://blogs.msdn.microsoft.com/larryosterman/2005/07/01/private-destructors/" target="_blank" rel="external">Private Destructors</a></li>
<li>private &#x62F7;&#x8D1D;&#x6784;&#x9020;&#x51FD;&#x6570;&#x548C;copy assignment &#x64CD;&#x4F5C;&#x7B26;<br>&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x53EF;&#x62F7;&#x8D1D;&#x7684;&#x65F6;&#x5019;&#x3002;<br>Example: <figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">Class Uncopyable {</span><br><span class="line">...</span><br><span class="line">private:</span><br><span class="line">    Uncopyable(const Uncopyable&amp;);</span><br><span class="line">    ~Uncopyable&amp; operator=(const Uncopyable&amp;);</span><br><span class="line">}</span><br></pre></td></tr></table></figure>
</li>
</ul>
<h3 id="&#x6761;&#x6B3E;07&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;"><a href="#&#x6761;&#x6B3E;07&#xFF1A;&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;" class="headerlink" title="&#x6761;&#x6B3E;07&#xFF1A;&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;"></a>&#x6761;&#x6B3E;07&#xFF1A;&#x4E3A;&#x591A;&#x6001;&#x57FA;&#x7C7B;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;</h3><blockquote>
<ul>
<li>polymoriphic&#xFF08;&#x5E26;&#x591A;&#x6001;&#x6027;&#x8D28;&#x7684;&#xFF09;base classes&#x5E94;&#x8BE5;&#x58F0;&#x660E;&#x4E00;&#x4E2A;virtual&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;class&#x5E26;&#x6709;&#x4EFB;&#x4F55;virtual&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5C31;&#x5E94;&#x8BE5;&#x62E5;&#x6709;&#x4E00;&#x4E2A;virtual&#x6790;&#x6784;&#x51FD;&#x6570;</li>
<li>Classes&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x7684;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x4F5C;&#x4E3A;base classes&#x4F7F;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x5177;&#x5907;&#x591A;&#x6001;&#x6027;&#xFF08;polymorphically&#xFF09;&#xFF0C;&#x5C31;&#x4E0D;&#x8BE5;&#x58F0;&#x660E;virtual&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;</li>
</ul>
</blockquote>
<p><strong><em>&#x4E3A;&#x4EC0;&#x4E48;&#x5E26;&#x6709;&#x591A;&#x6001;&#x6027;&#x8D28;&#x7684;&#x57FA;&#x7C7B;&#x5E94;&#x8BE5;&#x58F0;&#x660E;&#x4E00;&#x4E2A;virtual&#x6790;&#x6784;&#x51FD;&#x6570;&#xFF1F;</em></strong></p>
<p>&#x5E26;&#x6709;&#x591A;&#x6001;&#x6027;&#x8D28;&#x7684;&#x57FA;&#x7C7B;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x57FA;&#x7C7B;&#x7684;&#x6307;&#x9488;&#x53EF;&#x80FD;&#x5B58;&#x653E;&#x7740;&#x5B50;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5982;&#x679C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x6CA1;&#x6709;&#x58F0;&#x660E;&#x4E3A;virtual&#x7684;&#x8BDD;&#xFF0C;delete&#x4E00;&#x4E2A;&#x57FA;&#x7C7B;&#x6307;&#x9488;&#x4E0D;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x7684;&#x8C03;&#x7528;&#x5230;&#x5B50;&#x7C7B;&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4F1A;&#x9020;&#x6210;&#x8D44;&#x6E90;&#x7684;&#x6CC4;&#x9732;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x60F3;&#x8BA9;&#x522B;&#x7684;&#x7C7B;&#x7EE7;&#x627F;&#xFF0C;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x7EE7;&#x627F;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x8D44;&#x6E90;&#x7684;&#x6CC4;&#x9732;&#x3002;&#x56E0;&#x4E3A;C++&#x5728;&#x8BED;&#x8A00;&#x5C42;&#x9762;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x4E8E;C# seal&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x675C;&#x7EDD;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E0D;&#x662F;virtual&#x7684;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x53BB;&#x7EE7;&#x627F;&#x5B83;&#x3002;</p>
<p>&#x53CD;&#x8FC7;&#x6765;&#x770B;&#x5C31;&#x66F4;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x662F;&#x4F5C;&#x4E3A;&#x57FA;&#x7C7B;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5B83;&#x7684;&#x6307;&#x9488;&#x4E0D;&#x53EF;&#x80FD;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x90A3;&#x4E48;&#x58F0;&#x660E;&#x6210;virtual&#x7684;&#x5C31;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5FC5;&#x8981;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x56E0;&#x4E3A;virtual&#x800C;&#x589E;&#x957F;&#x4E86;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;</p>
<h3 id="&#x6761;&#x6B3E;08&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;"><a href="#&#x6761;&#x6B3E;08&#xFF1A;&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;" class="headerlink" title="&#x6761;&#x6B3E;08&#xFF1A;&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;"></a>&#x6761;&#x6B3E;08&#xFF1A;&#x522B;&#x8BA9;&#x5F02;&#x5E38;&#x9003;&#x79BB;&#x6790;&#x6784;&#x51FD;&#x6570;</h3><blockquote>
<ul>
<li>&#x6790;&#x6784;&#x51FD;&#x6570;&#x7EDD;&#x5BF9;&#x4E0D;&#x8981;&#x5410;&#x51FA;&#x5F02;&#x5E38;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x88AB;&#x6790;&#x6784;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x6355;&#x6349;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#xFF0C;&#x7136;&#x540E;&#x541E;&#x4E0B;&#x5B83;&#x4EEC;&#xFF08;&#x4E0D;&#x4F20;&#x64AD;&#xFF09;&#x6216;&#x8005;&#x7ED3;&#x675F;&#x7A0B;&#x5E8F;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5BA2;&#x6237;&#x9700;&#x8981;&#x5BF9;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x51FD;&#x6570;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x90A3;&#x4E48;class&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x51FD;&#x6570;&#xFF08;&#x800C;&#x975E;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#xFF09;&#x6267;&#x884C;&#x8BE5;&#x64CD;&#x4F5C;&#x3002;</li>
</ul>
</blockquote>
<p><strong><em>&#x4E3A;&#x4EC0;&#x4E48;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x4E0D;&#x597D;&#xFF1F;</em></strong></p>
<ol>
<li>&#x6790;&#x6784;&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x5730;&#x65B9;&#x4E0D;&#x597D;&#x63A7;&#x5236;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x597D;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x6790;&#x6784;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x5BF9;&#x5F02;&#x5E38;&#x8FDB;&#x884C;&#x6355;&#x6349;&#x3002;&#xFF08;&#x81EA;&#x5DF1;&#x8865;&#x5145;&#x7684;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x6240;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x672A;&#x5904;&#x7406;&#x4F1A;&#x5BFC;&#x81F4;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x3002;</li>
</ol>
<p>&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4E2D;&#x6709;&#x53EF;&#x80FD;&#x6267;&#x884C;&#x5230;&#x4E00;&#x4E9B;&#x4F1A;&#x629B;&#x5F02;&#x5E38;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6355;&#x6349;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x4E3A;&#x5F02;&#x5E38;&#x53EF;&#x4EE5;&#x5FCD;&#x53D7;&#x5219;&#x9ED8;&#x9ED8;&#x541E;&#x4E0B;&#xFF0C;&#x8BB0;&#x4E0B;log&#xFF0C;&#x5426;&#x5219;&#x8BB0;&#x4E0B;log&#x7136;&#x540E;&#x76F4;&#x63A5;&#x7ED3;&#x675F;&#x7A0B;&#x5E8F;&#x3002;</p>
<p><strong><em>&#x6709;&#x4EC0;&#x4E48;&#x66F4;&#x597D;&#x7684;&#x529E;&#x6CD5;&#xFF1F;</em></strong></p>
<p>&#x5982;&#x679C;&#x5728;&#x6790;&#x6784;&#x51FD;&#x6570;&#x91CC;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x67D0;&#x4E2A;&#x53EF;&#x80FD;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x65B9;&#x6CD5;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x6837;&#x5B50;&#x7528;&#x6237;&#x5C31;&#x6709;&#x673A;&#x4F1A;&#x81EA;&#x5DF1;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br></pre></td><td class="code"><pre><span class="line">class DBConn {</span><br><span class="line">public:</span><br><span class="line">   ~DBConn() {</span><br><span class="line">     db.close();   //bad, may throw exception</span><br><span class="line">   }</span><br><span class="line">private:</span><br><span class="line">  DBConnection db;</span><br><span class="line">}</span><br><span class="line"></span><br><span class="line">class DBConn {</span><br><span class="line">public:</span><br><span class="line">   void close() {</span><br><span class="line">     db.close();</span><br><span class="line">     closed = true;</span><br><span class="line">   }</span><br><span class="line">   ~DBConn() {</span><br><span class="line">     if (!closed) {</span><br><span class="line">       try {</span><br><span class="line">	     db.close();   //good, catch exception and provide normal method to close</span><br><span class="line">	   }</span><br><span class="line">	   catch (...) {</span><br><span class="line">		   //log</span><br><span class="line">	   }</span><br><span class="line">     }</span><br><span class="line">   }</span><br><span class="line">private:</span><br><span class="line">  DBConnection db;</span><br><span class="line">}</span><br></pre></td></tr></table></figure>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程语言/">编程语言</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/编程语言/">编程语言</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/07/06/effective-cpp-reading-notes-3/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="page-number" href="/page/3/">3</a><span class="space">&hellip;</span><a class="page-number" href="/page/5/">5</a><a class="extend next" rel="next" href="/page/2/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>11</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程语言/" title="编程语言">编程语言<sup>5</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/编程语言/" title="编程语言">编程语言<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/随想/" title="随想">随想<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/Udacity/" title="Udacity">Udacity<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
          <li>
            
            	<a href="http://www.cnblogs.com/imjustice/" target="_blank" title="博客园主页">博客园主页</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
