
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta property="og:type" content="website">
<meta property="og:title" content="yi's weblog">
<meta property="og:url" content="http://zhengyi.me/page/3/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="yi's weblog">
<meta name="twitter:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/05/learning-how-to-learn-module-2-note/" title="Learning how to learn 第二周学习笔记" itemprop="url">Learning how to learn 第二周学习笔记</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-05T13:23:02.000Z" itemprop="datePublished"> 发表于 2016-05-05</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>Coursera&#x7ECF;&#x5178;&#x8BFE;&#x7A0B;<a href="https://www.coursera.org/learn/learning-how-to-learn/" target="_blank" rel="external"><em>Learning how to learn</em></a>&#x7B2C;&#x4E8C;&#x5468;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5468;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x56F4;&#x7ED5;&#x7740;Chunking&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x6240;&#x5C55;&#x5F00;&#x7684;&#xFF0C;chunk&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x4E2D;&#x6587;&#x4E3A;&#x7EC4;&#x5757;&#xFF0C;&#x611F;&#x89C9;&#x6CA1;&#x6709;&#x82F1;&#x6587;&#x6765;&#x7684;&#x5F62;&#x8C61;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x56DE;&#x987E;&#x51E0;&#x4E2A;&#x6211;&#x8BA4;&#x4E3A;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x70B9;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;"><a href="#&#x4EC0;&#x4E48;&#x662F;Chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;Chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;"></a>&#x4EC0;&#x4E48;&#x662F;Chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;</h2><p>Chunk&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6210;&#x67D0;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x5728;&#x4F60;&#x5927;&#x8111;&#x4E2D;&#x5F62;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x8BB0;&#x5FC6;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BB0;&#x5FC6;&#x5757;&#x662F;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#x3002;&#x8BFE;&#x7A0B;&#x4E2D;&#x5C06;&#x8FD9;&#x4E2A;chunk&#x6BD4;&#x55BB;&#x4E3A;&#x4E00;&#x4E2A;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x5012;&#x662F;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;chunk&#x7406;&#x89E3;&#x6210;&#x67D0;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x77E5;&#x8BC6;&#x7684;&#x6982;&#x8981;/&#x7CBE;&#x534E;&#x66F4;&#x52A0;&#x7684;&#x59A5;&#x5F53;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x628A;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x77E5;&#x8BC6;&#x538B;&#x7F29;&#x6210;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x7684;&#x6982;&#x5FF5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x601D;&#x8003;&#x66F4;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E3E;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x8003;&#x8651;&#x7684;&#x662F;&#x5404;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x7279;&#x5F81;&#x3001;&#x4F18;&#x7F3A;&#x70B9;&#x3001;&#x5C40;&#x9650;&#x6027;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6211;&#x8BA4;&#x4E3A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;chunk&#xFF0C;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x67D0;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x987A;&#x7740;&#x8FD9;&#x4E2A;chunk&#x5F80;&#x4E0B;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x6216;&#x8005;&#x63A8;&#x7406;&#x4E00;&#x4E0B;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5177;&#x4F53;&#x7684;&#x7B97;&#x6CD5;&#x7EC6;&#x8282;&#x63A8;&#x7406;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x53EA;&#x6709;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x6709;&#x6DF1;&#x523B;&#x7684;&#x7406;&#x89E3;&#x4EE5;&#x540E;&#x624D;&#x4F1A;&#x4EA7;&#x751F;&#x8FD9;&#x79CD;chunk&#xFF0C;&#x5426;&#x5219;&#x8FD9;&#x4E9B;&#x4F18;&#x7F3A;&#x70B9;&#x5BF9;&#x4E8E;&#x4F60;&#x6765;&#x8BF4;&#x5E76;&#x4E0D;&#x4F1A;&#x663E;&#x5F97;&#x90A3;&#x4E48;&#x7684;&#x81EA;&#x7136;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF0C;chunk&#x6700;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x5BF9;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x610F;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x3002;&#x5F53;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;chunk&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x6574;&#x5408;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;chunk&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x4ECE;&#x66F4;&#x9AD8;&#x7684;&#x5C42;&#x9762;&#x53BB;&#x8003;&#x8651;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x601D;&#x8003;&#x95EE;&#x9898;&#x7684;&#x9AD8;&#x5EA6;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk"><a href="#&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk" class="headerlink" title="&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk"></a>&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk</h2><p>&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk&#xFF1A;</p>
<ol>
<li>&#x9AD8;&#x5EA6;&#x96C6;&#x4E2D;&#x6CE8;&#x610F;&#x529B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3002;&#xFF08;focused attention&#xFF09;</li>
<li>&#x7406;&#x89E3;&#x95EE;&#x9898;&#x3002;&#xFF08;understanding of the basic idea&#xFF09;</li>
<li>&#x523B;&#x610F;&#x7EC3;&#x4E60;&#x3002;&#xFF08;practice&#xFF09;</li>
<li>&#x6CE8;&#x610F;&#x77E5;&#x8BC6;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x800C;&#x975E;&#x4EC5;&#x4EC5;&#x5173;&#x6CE8;&#x77E5;&#x8BC6;&#x70B9;&#x672C;&#x8EAB;&#x3002;&#xFF08;sense of big picture&#xFF09;</li>
</ol>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#x5E94;&#x8BE5;&#x90FD;&#x4E0D;&#x4F1A;&#x964C;&#x751F;&#xFF0C;&#x8FD9;&#x91CC;&#x7279;&#x522B;&#x5F3A;&#x8C03;&#x4E00;&#x4E0B;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x505A;&#x7EC3;&#x4E60;&#x662F;&#x6D4B;&#x8BD5;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x7406;&#x89E3;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x9014;&#x5F84;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x9886;&#x57DF;&#x6BD4;&#x5982;&#x7F16;&#x7A0B;&#xFF0C;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x904D;&#x4EE3;&#x7801;&#x7EDD;&#x5BF9;&#x662F;&#x4F1A;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x7406;&#x89E3;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#x7684;&#x3002;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x8981;&#x5408;&#x4E0A;&#x6750;&#x6599;&#xFF0C;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x548C;&#x8BB0;&#x5FC6;&#x5199;&#x4E00;&#x4E2A;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F60;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x548C;&#x63A8;&#x7406;&#x4E00;&#x904D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x662F;&#x8BF4;&#x8981;&#x6CE8;&#x610F;&#x53EA;&#x662F;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x8FD9;&#x4E2A;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x77E5;&#x8BC6;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x5C42;&#x9762;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x5C06;&#x5176;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x5DF2;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3001;&#x8054;&#x7CFB;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#x6DF1;&#x5EA6;&#x3002;</p>
<h2 id="&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"><a href="#&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;" class="headerlink" title="&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"></a>&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;</h2><p>&#x8BFE;&#x7A0B;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x51E0;&#x4E2A;&#x6BD4;&#x8F83;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5F80;&#x5F80;&#x4F1A;&#x8BA9;&#x5B66;&#x4E60;&#x8005;&#x4EA7;&#x751F;&#x4E00;&#x79CD;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x7684;&#x9519;&#x89C9;&#x3002;&#x8FD9;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x8BFE;&#x672C;&#x4E0A;&#x5212;&#x51FA;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x91CD;&#x70B9;</li>
<li>&#x53CD;&#x590D;&#x7684;&#x53BB;&#x8BFB;&#x4E00;&#x6BB5;&#x6750;&#x6599;</li>
<li>&#x5B66;&#x4E60;&#x5B8C;&#x4EE5;&#x540E;&#x505A;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x5BFC;&#x56FE;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5176;&#x5B9E;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5728;&#x5F62;&#x5F0F;&#x5C42;&#x9762;&#x8FDB;&#x884C;&#x91CD;&#x590D;&#x548C;&#x5DE9;&#x56FA;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x601D;&#x7EF4;&#x4E0A;&#x8FDB;&#x884C;&#x5DE9;&#x56FA;&#x3002;</p>
<h2 id="&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"><a href="#&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;" class="headerlink" title="&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"></a>&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;</h2><p>&#x5E94;&#x5BF9;&#x4E0A;&#x9762;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x5B66;&#x4E60;&#x638C;&#x63E1;&#x4E00;&#x95E8;&#x77E5;&#x8BC6;&#x3002;</p>
<ul>
<li>&#x5728;&#x5B66;&#x4E60;&#x5B8C;&#x4E00;&#x6BB5;&#x6750;&#x6599;&#x4EE5;&#x540E;&#xFF0C;&#x5728;&#x4E0D;&#x770B;&#x7B14;&#x8BB0;&#x548C;&#x6750;&#x6599;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x56DE;&#x60F3;&#x5B66;&#x8FC7;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x8FC7;&#x4E00;&#x904D;&#x81EA;&#x5DF1;&#x8BB0;&#x4F4F;&#x7684;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x5C3D;&#x529B;&#x56DE;&#x987E;&#x5B8C;&#x4EE5;&#x540E;&#xFF0C;&#x518D;&#x53BB;&#x5DE9;&#x56FA;&#x90A3;&#x4E9B;&#x4F60;&#x5DF2;&#x7ECF;&#x5FD8;&#x8BB0;&#x6216;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x53CD;&#x590D;&#x51E0;&#x6B21;&#x3002;</li>
<li>&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x56DE;&#x60F3;&#x4F1A;&#x5E2E;&#x52A9;&#x4F60;&#x6446;&#x8131;&#x4E00;&#x4E9B;&#x73AF;&#x5883;&#x4E0A;&#x7684;&#x6697;&#x793A;&#x3002;</li>
<li>&#x7740;&#x91CD;&#x53BB;&#x7EC3;&#x4E60;&#x90A3;&#x4E9B;&#x81EA;&#x5DF1;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53CD;&#x590D;&#x505A;&#x90A3;&#x4E9B;&#x5DF2;&#x7ECF;&#x4F1A;&#x7684;&#x7EC3;&#x4E60;&#x3002;</li>
<li>Interleaving learning&#x3002;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x662F;&#x8BF4;&#x5728;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x77E5;&#x8BC6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x591A;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x4EA4;&#x66FF;&#x7684;&#x5B66;&#x4E60;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x8BA9;&#x4F60;&#x62E5;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x5B66;&#x4E60;&#x6548;&#x7387;&#xFF0C;&#x867D;&#x7136;&#x8BF4;&#x5B66;&#x4E60;&#x8005;&#x672C;&#x8EAB;&#x53EF;&#x80FD;&#x6CA1;&#x53D1;&#x89C9;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5B66;&#x4E60;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x8BF4;&#x5B66;&#x4E60;&#x5B8C;&#x53D1;&#x7403;&#x4EE5;&#x540E;&#x518D;&#x5B66;&#x4E60;&#x6263;&#x6740;&#xFF0C;&#x53EF;&#x4EE5;&#x5B66;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x53D1;&#x7403;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x5B66;&#x6263;&#x6740;&#xFF0C;&#x63A5;&#x7740;&#x518D;&#x56DE;&#x6765;&#x5B66;&#x53D1;&#x7403;&#x3002;&#x8FD9;&#x4F1A;&#x8BA9;&#x4F60;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x540C;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x7ECF;&#x9A8C;&#x5171;&#x4EAB;&#x3002;</li>
</ul>
<h2 id="&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;"><a href="#&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;-&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;" class="headerlink" title="&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;(&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;)"></a>&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;(&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;)</h2><p>&#x4E0A;&#x9762;&#x7684;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E2A;concept mapping&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x89C9;&#x5F97;&#x8DDF;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x5F88;&#x50CF;&#x3002;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x4E00;&#x4E2A;&#x5E2E;&#x52A9;&#x8BB0;&#x5FC6;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x679C;&#x7528;&#x5F97;&#x4E0D;&#x5BF9;&#x7684;&#x8BDD;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x770B;&#x5B8C;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x6216;&#x5B66;&#x4E60;&#x5B8C;&#x4E00;&#x6BB5;&#x77E5;&#x8BC6;&#x4EE5;&#x540E;&#x3002;&#x8131;&#x79BB;&#x5F00;&#x6765;&#x6750;&#x6599;&#xFF0C;&#x9760;&#x8111;&#x5B50;&#x56DE;&#x60F3;&#x77E5;&#x8BC6;&#x70B9;&#x4EE5;&#x53CA;&#x77E5;&#x8BC6;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x7136;&#x540E;&#x501F;&#x52A9;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x628A;&#x8FD9;&#x4E9B;&#x8054;&#x7CFB;&#x4E2A;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x6211;&#x6240;&#x8BF4;&#x7684;&#x56DE;&#x60F3;&#x7684;&#x90A3;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x662F;&#x8BF4;&#x628A;&#x8111;&#x5B50;&#x91CC;&#x7684;&#x201C;chunk&#x201D;&#x901A;&#x8FC7;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#x800C;&#x5DF2;&#x3002;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x4E2D;&#x5404;&#x4E2A;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x53EF;&#x4EE5;&#x8DDF;&#x4E66;&#x672C;&#x4E0A;&#x7684;&#x8054;&#x7CFB;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x5B9A;&#x662F;&#x8981;&#x4F60;&#x8111;&#x5B50;&#x91CC;&#x771F;&#x5B9E;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x5426;&#x5219;&#x7684;&#x8BDD;&#x4E0B;&#x6B21;&#x4F60;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x5C31;&#x4E0D;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x56DE;&#x60F3;&#x8D77;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="&#x51E0;&#x4E2A;&#x95EE;&#x9898;"><a href="#&#x51E0;&#x4E2A;&#x95EE;&#x9898;" class="headerlink" title="&#x51E0;&#x4E2A;&#x95EE;&#x9898;"></a>&#x51E0;&#x4E2A;&#x95EE;&#x9898;</h2><p>&#x4F9D;&#x7136;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<ol>
<li>&#x5982;&#x4F55;&#x514B;&#x670D;&#x601D;&#x7EF4;&#x5B9A;&#x52BF;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5229;&#x7528;&#x597D;diffuse mode&#xFF1F;</li>
</ol>
<p><img src="/img/learning_how_to_learn_week_2.png" alt="Learning how to learn week 2 mindmap"></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/心理学/">心理学</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/心理学/">心理学</a><a href="/tags/思考方法/">思考方法</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/05/05/learning-how-to-learn-module-2-note/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/04/27/learning-how-to-learn-module-1-note/" title="Learning how to learn 第一周笔记" itemprop="url">Learning how to learn 第一周笔记</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-04-27T14:34:26.000Z" itemprop="datePublished"> 发表于 2016-04-27</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>Coursera &#x4E0A;&#x7ECF;&#x5178;&#x8BFE;&#x7A0B;<a href="https://www.coursera.org/learn/learning-how-to-learn/home/welcome" target="_blank" rel="external">Learning how to learn</a> &#x7B2C;&#x4E00;&#x5468;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x5468;&#x7684;&#x5185;&#x5BB9;&#x603B;&#x4F53;&#x6846;&#x67B6;&#x603B;&#x7ED3;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x89C1;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x3002;&#x53E6;&#x5916;&#x6709;&#x51E0;&#x4E2A;&#x70B9;&#x60F3;&#x8981;&#x7740;&#x91CD;&#x7684;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x3002;</p>
<h3 id="&#x91CD;&#x590D;&#x7EC3;&#x4E60;"><a href="#&#x91CD;&#x590D;-&#x7EC3;&#x4E60;" class="headerlink" title="&#x91CD;&#x590D;/&#x7EC3;&#x4E60;"></a>&#x91CD;&#x590D;/&#x7EC3;&#x4E60;</h3><p>&#x8BFE;&#x7A0B;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x5927;&#x8111;&#x6709;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x8BB0;&#x5FC6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x5DE5;&#x4F5C;&#x8BB0;&#x5FC6;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x3002;&#x5DE5;&#x4F5C;&#x8BB0;&#x5FC6;&#x5B58;&#x5728;&#x7684;&#x65F6;&#x95F4;&#x975E;&#x5E38;&#x77ED;&#xFF0C;&#x5E76;&#x4E14;&#x5BB9;&#x91CF;&#x5F88;&#x5C0F;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x601D;&#x8003;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x4F1A;&#x5728;&#x5DE5;&#x4F5C;&#x8BB0;&#x5FC6;&#x4E2D;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4ECE;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x4E2D;&#x8F7D;&#x5165;&#x4E00;&#x4E9B;&#x4EE5;&#x524D;&#x5B66;&#x4F1A;&#x7684;&#x77E5;&#x8BC6;&#x6216;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x8DDF;&#x5DE5;&#x4F5C;&#x8BB0;&#x5FC6;&#x76F8;&#x6BD4;&#xFF0C;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x7684;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x5BB9;&#x91CF;&#xFF0C;&#x80FD;&#x591F;&#x5B58;&#x50A8;&#x975E;&#x5E38;&#x591A;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x628A;&#x4E00;&#x4E2A;&#x77ED;&#x671F;&#x8BB0;&#x5FC6;&#x8F6C;&#x5316;&#x6210;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x8BB0;&#x5FC6;&#x5728;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x4E2D;&#x884C;&#x7A0B;&#x7684;&#x6A21;&#x5F0F;&#x662F;&#x6BD4;&#x8F83;&#x5F31;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x91CD;&#x590D;&#x7684;&#x53BB;&#x8BBF;&#x95EE;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x6765;&#x52A0;&#x6DF1;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x6765;&#x63D0;&#x9AD8;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x4EE5;&#x540E;&#x88AB;&#x8BB0;&#x4F4F;&#x7684;&#x6982;&#x7387;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8C13;&#x7684;&#x719F;&#x80FD;&#x751F;&#x5DE7;&#x3002;</p>
<p>&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x7684;&#x884C;&#x7A0B;&#x6709;&#x70B9;&#x50CF;&#x808C;&#x8089;&#x7684;&#x5F62;&#x6210;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x7684;&#x5927;&#x91CF;&#x8BAD;&#x7EC3;&#x3002;&#x800C;&#x662F;&#x8BAD;&#x7EC3;&#x4E00;&#x6B21;&#xFF0C;&#x7136;&#x540E;&#x4F11;&#x606F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5728;&#x8BAD;&#x7EC3;&#xFF0C;&#x5728;&#x4F11;&#x606F;&#x3002;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;<a href="https://www.wikiwand.com/en/Spaced_repetition" target="_blank" rel="external">Spaced Repetition</a>&#x3002;</p>
<p>&#x4ECE;&#x67D0;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x6240;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x5DE7;&#x6240;&#x5B58;&#x50A8;&#x7684;&#x533A;&#x57DF;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x4E0D;&#x80FD;&#x591F;&#x505A;&#x5230;&#x628A;&#x8FD9;&#x4E9B;&#x6280;&#x80FD;&#x548C;&#x77E5;&#x8BC6;&#x5B58;&#x50A8;&#x5230;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#x91CC;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4EE5;&#x540E;&#x9700;&#x8981;&#x7528;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x65B0;&#x7ECF;&#x5386;&#x4E00;&#x904D;&#x77ED;&#x671F;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x4E0D;&#x5C31;&#x5B8C;&#x5168;&#x6D6A;&#x8D39;&#x4E86;&#x4E4B;&#x524D;&#x7684;&#x65F6;&#x95F4;&#x4E86;&#x4E48;&#xFF1F;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x53BB;&#x5B66;&#x4E60;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8981;&#x505A;&#x51FA;&#x628A;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5B66;&#x900F;&#xFF0C;&#x8BA9;&#x5B83;&#x6210;&#x4E3A;&#x81EA;&#x5DF1;&#x5927;&#x8111;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5426;&#x5219;&#x5C31;&#x4E0D;&#x8981;&#x5B66;&#x4E86;&#xFF0C;&#x53CD;&#x6B63;&#x5B66;&#x4E86;&#x4E5F;&#x5FD8;&#x8BB0;&#x4E86;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x4EE5;&#x540E;&#x591A;&#x6B21;&#x4F5C;&#x603B;&#x7ED3;&#x6765;&#x5E2E;&#x52A9;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x8BB0;&#x5FC6;&#x901A;&#x8FC7;&#x6587;&#x5B57;&#x7684;&#x5F62;&#x5F0F;&#x6301;&#x4E45;&#x5316;&#x4E0B;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x52A0;&#x901F;&#x4E0B;&#x6B21;&#x56DE;&#x5FC6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p> &lt;!&#x2013; more &#x2014;&gt;</p>
<h3 id="&#x953B;&#x70BC;&#x4F11;&#x606F;"><a href="#&#x953B;&#x70BC;-&#x4F11;&#x606F;" class="headerlink" title="&#x953B;&#x70BC;/&#x4F11;&#x606F;"></a>&#x953B;&#x70BC;/&#x4F11;&#x606F;</h3><p>&#x8BFE;&#x7A0B;&#x4E2D;&#x63D0;&#x5230;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4E9B;&#x521B;&#x9020;&#x6027;&#x6216;&#x5B66;&#x4E60;&#x65B0;&#x4E8B;&#x7269;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x8111;&#x5904;&#x4E8E;&#x53D1;&#x6563;&#x72B6;&#x51B5;&#x4F1A;&#x66F4;&#x52A0;&#x7684;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x5B66;&#x4E60;&#x3002;&#x800C;&#x8BA9;&#x5927;&#x8111;&#x5207;&#x6362;&#x5230;&#x53D1;&#x6563;&#x72B6;&#x51B5;&#x7684;&#x65B9;&#x6CD5;&#x4E3B;&#x8981;&#x662F;&#x653E;&#x677E;&#x3001;&#x953B;&#x70BC;&#x7B49;&#x65B9;&#x5F0F;&#x8FBE;&#x5230;&#x7684;&#x3002;&#x540C;&#x65F6;&#x953B;&#x70BC;&#x8FD8;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x795E;&#x7ECF;&#x5143;&#xFF0C;&#x8FD9;&#x4E5F;&#x4F1A;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x6E05;&#x9192;&#x7684;&#x5927;&#x8111;&#x3002;</p>
<p><img src="/img/learning_how_to_learn_module_1_mindmap.png" alt="&#x7B14;&#x8BB0;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;"></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/心理学/">心理学</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/心理学/">心理学</a><a href="/tags/思考方法/">思考方法</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/04/27/learning-how-to-learn-module-1-note/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/04/05/some-thought-about-git-workflow/" title="Git workflow的一些想法" itemprop="url">Git workflow的一些想法</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-04-05T15:19:09.000Z" itemprop="datePublished"> 发表于 2016-04-05</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4ECA;&#x5929;&#x8BFB;&#x5230;&#x4E86;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;<a href="http://insights.thoughtworkers.org/gitflow-consider-harmful/" target="_blank" rel="external">&#x300A;Gitflow&#x6709;&#x5BB3;&#x8BBA;&#x300B;</a>&#xFF0C; &#x867D;&#x7136;&#x6587;&#x7AE0;&#x7684;&#x6807;&#x9898;&#x6709;&#x70B9;&#x6781;&#x7AEF;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x89C2;&#x70B9;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3002;&#x7ED3;&#x5408;&#x5DE5;&#x4F5C;&#x4E2D;&#x4F7F;&#x7528;git&#x7684;&#x4E00;&#x4E9B;&#x611F;&#x60F3;&#xFF0C;&#x8C08;&#x4E00;&#x8C08;&#x6211;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;git&#x7684;workflow&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;</p>
<h2 id="gitflow"><a href="#Gitflow" class="headerlink" title="Gitflow"></a>Gitflow</h2><p><img src="https://farm2.staticflickr.com/1627/26186579461_61597a4f0d_b.jpg" alt="gitflow"></p>
<p>&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E4B;&#x524D;&#x5E76;&#x6CA1;&#x6709;&#x8BA4;&#x771F;&#x7684;&#x770B;&#x8FC7;Gitflow&#x7684;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x4F7F;&#x7528;git&#x7684;&#x65F6;&#x5019;&#x770B;&#x5230;&#x8FC7;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x800C;&#x4E14;&#x5927;&#x5BB6;&#x5BF9;git&#x90FD;&#x4E0D;&#x5927;&#x719F;&#x6089;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x91C7;&#x7528;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x4ECE;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x770B;&#x8FD9;&#x4E2A;Gitflow&#xFF0C;&#x6709;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x5F88;&#x660E;&#x663E;&#x7684;&#x5751;&#x3002;</p>
<ol>
<li>&#x67D0;&#x4E00;&#x4E9B;feature&#x5206;&#x652F;&#x7684;&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x592A;&#x5927;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x5F88;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5F53;&#x8FD9;&#x4E2A;feature&#x5206;&#x652F;&#x56DE;&#x5230;develop&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x5F88;&#x591A;&#x51B2;&#x7A81;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x51B2;&#x7A81;&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x5230;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x9762;&#xFF0C;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x53BB;fix&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5F80;&#x5F80;&#x5F88;&#x7EA0;&#x7ED3;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;2. </li>
<li>feature&#x65F6;&#x95F4;&#x8DE8;&#x5EA6;&#x592A;&#x5927;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x574F;&#x5904;&#x5C31;&#x662F;pull request&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5927;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;pull request&#x5F80;&#x5F80;&#x4F1A;&#x8BA9;review&#x7684;&#x4EBA;&#x5F88;&#x5934;&#x75BC;&#x3002;&#x5F88;&#x5BB9;&#x6613;&#x8BA9;&#x4EE3;&#x7801;review&#x7684;&#x4EBA;&#x5FFD;&#x7565;&#x5176;&#x4E2D;&#x9690;&#x85CF;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</li>
</ol>
<p>&#x9664;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x5751;&#x4EE5;&#x5916;&#xFF0C;&#x5173;&#x4E8E;release branch&#x548C;master branch&#x7684;&#x5206;&#x5DE5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6DFB;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x91CF;&#x548C;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x5E26;&#x6765;&#x660E;&#x663E;&#x7684;&#x597D;&#x5904;&#x3002;</p>
<h2 id="github-&#x7684;flow"><a href="#Github-&#x7684;flow" class="headerlink" title="Github &#x7684;flow"></a>Github &#x7684;flow</h2><p>github&#x7684;flow&#x5176;&#x5B9E;&#x975E;&#x5E38;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x8BE6;&#x89C1;&#xFF1A;<a href="https://guides.github.com/introduction/flow/" target="_blank" rel="external">Understanding the GitHub Flow</a>&#xFF0C;<a href="http://scottchacon.com/2011/08/31/github-flow.html" target="_blank" rel="external">GitHub Flow</a>&#x3002;</p>
<p>&#x4ECE;&#x6587;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;workflow&#x91CC;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x5206;&#x652F;&#x3002;&#x4E00;&#x79CD;&#x662F;master &#x5206;&#x652F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x652F;&#x662F;&#x9AD8;&#x8D28;&#x91CF;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x90E8;&#x7F72;&#x7684;&#x5206;&#x652F;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x5219;&#x662F;feature&#x5206;&#x652F;&#xFF0C;&#x5373;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x7684;&#x5206;&#x652F;&#x3002;&#x5F00;&#x53D1;&#x5B8C;&#x4EE5;&#x540E;&#x76F4;&#x63A5;&#x901A;&#x8FC7;Pull Request&#x7684;&#x5F62;&#x5F0F;&#x56DE;&#x5230;master&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;github&#x7684;flow&#x975E;&#x5E38;&#x7684;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x91C7;&#x7528;&#x8FD9;&#x79CD;flow&#x6709;&#x4E24;&#x4E2A;&#x5927;&#x524D;&#x63D0;&#xFF1A;</p>
<ol>
<li><p>CI&#x80FD;&#x591F;&#x5728;Pull Request&#x9636;&#x6BB5;&#x8986;&#x76D6;&#x5927;&#x90E8;&#x5206;&#x7684;&#x6D4B;&#x8BD5;&#x6848;&#x4F8B;&#x3002;</p>
</li>
<li><p>&#x9879;&#x76EE;&#x5FC5;&#x987B;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;github&#x8FD9;&#x79CD;web&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x9891;&#x7E41;&#x7684;&#x4EA7;&#x54C1;&#x90E8;&#x7F72;&#x3002;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x8FC5;&#x901F;&#x7684;&#x4FEE;&#x590D;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</li>
</ol>
<h2 id="&#x6211;&#x8BA4;&#x4E3A;&#x7406;&#x60F3;&#x7684;git-workflow"><a href="#&#x6211;&#x8BA4;&#x4E3A;&#x7406;&#x60F3;&#x7684;git-workflow" class="headerlink" title="&#x6211;&#x8BA4;&#x4E3A;&#x7406;&#x60F3;&#x7684;git workflow"></a>&#x6211;&#x8BA4;&#x4E3A;&#x7406;&#x60F3;&#x7684;git workflow</h2><p>&#x6211;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x653E;&#x4E4B;&#x56DB;&#x6D77;&#x800C;&#x7686;&#x51C6;&#x7684;workflow&#xFF0C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6240;&#x91C7;&#x7528;&#x7684;workflow&#x5176;&#x5B9E;&#x4E3B;&#x8981;&#x53D6;&#x51B3;&#x4E8E;&#x7EC4;&#x7EC7;&#x7684;&#x6587;&#x5316;&#x548C;&#x4EA7;&#x54C1;&#x7684;&#x7279;&#x70B9;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x597D;&#x7684;workflow&#x5E94;&#x8BE5;&#x6EE1;&#x8DB3;&#x4E00;&#x4E0B;&#x51E0;&#x4E2A;&#x6761;&#x4EF6;&#xFF1A;</p>
<ol>
<li>&#x53EA;&#x6709;&#x4E00;&#x4E2A;master&#x5206;&#x652F;&#xFF0C;&#x4E0D;&#x9700;&#x8981;develop&#x5206;&#x652F;&#x3002;</li>
<li>&#x6709;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x6301;&#x7EED;&#x96C6;&#x6210;&#x73AF;&#x5883;&#xFF0C;&#x80FD;&#x591F;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;pull request&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x786E;&#x4FDD;&#x5176;&#x901A;&#x8FC7;&#x6240;&#x6709;&#x7684;&#x6D4B;&#x8BD5;&#x3002;</li>
<li>feature&#x5206;&#x652F;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5C0F;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x529E;&#x6CD5;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x505A;&#x5F88;&#x591A;&#x6539;&#x52A8;&#x7684;&#x8BDD;&#x3002;&#x90A3;&#x4E48;&#x5C31;&#x5F53;&#x5B8C;&#x6210;&#x4E00;&#x90E8;&#x5206;&#x53EF;&#x4EE5;work&#x7684;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x51FA;Pull Request&#x3002;&#x5C06;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x5148;&#x56DE;&#x5230;master&#x3002;&#x8FD9;&#x4E2A;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;Pull Request&#x66F4;&#x7CBE;&#x7B80;&#xFF0C;&#x8BA9;&#x4EE3;&#x7801;&#x51B2;&#x7A81;&#x66F4;&#x65E9;&#x7684;&#x66B4;&#x9732;&#x5E76;&#x89E3;&#x51B3;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5E94;&#x7528;&#xFF0C;release&#x5206;&#x652F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x3002;&#x62C9;&#x51FA;release&#x5206;&#x652F;&#x7684;&#x65F6;&#x5019;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x529F;&#x80FD;&#x6216;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x529F;&#x80FD;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#xFF08;Feature Toggle&#xFF0C;Branch by Abstraction&#xFF09;&#x6765;&#x5C06;&#x5176;&#x5C4F;&#x853D;&#x3002;</li>
<li>&#x5F53;release&#x5206;&#x652F;&#x4E2D;&#x6709;bug&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;master&#x4E0A;&#x505A;&#x4FEE;&#x590D;&#xFF0C;&#x5E76;cherry pick&#x5230;release&#x5206;&#x652F;&#x3002;&#x5982;&#x679C;&#x65E0;&#x6CD5;cherry pick&#xFF0C;&#x5219;&#x624B;&#x52A8;&#x4FEE;&#x6539;&#x3002;</li>
<li>release&#x7248;&#x672C;&#x540E;&#x5728;release&#x5206;&#x652F;&#x4E0A;&#x6253;&#x4E0A;tag&#x4EE5;&#x4FBF;&#x65E5;&#x540E;&#x7684;hotfix&#x3002;</li>
</ol>
<p>&#x6211;&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x70B9;&#x8DDF;<a href="http://insights.thoughtworkers.org/gitflow-consider-harmful/" target="_blank" rel="external">&#x300A;Gitflow&#x6709;&#x5BB3;&#x8BBA;&#x300B;</a>&#x6587;&#x4E2D;&#x63D0;&#x5230;&#x7684;Trunk Based Development&#x5DE5;&#x4F5C;&#x6D41;&#x5176;&#x5B9E;&#x6709;&#x70B9;&#x50CF;&#x3002;&#x4F46;&#x662F;&#x6211;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;Trunk Based Development&#x8FD8;&#x6CA1;&#x6709;&#x7814;&#x7A76;&#x900F;&#xFF0C;&#x4E0D;&#x6562;&#x5984;&#x4E0B;&#x7ED3;&#x8BBA;&#x3002;</p>
<p>&#x6587;&#x4E2D;&#x8FD8;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E0B;&#x6280;&#x672F;&#xFF1A;Feature Toggle&#xFF0C;Branch by Abstraction&#x3002;&#x770B;&#x4E86;&#x7ED9;&#x51FA;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x6709;&#x70B9;&#x7C97;&#x6D45;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x6539;&#x5929;&#x6DF1;&#x5165;&#x7684;&#x53BB;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x4E00;&#x4E9B;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程工具/">编程工具</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/git/">git</a><a href="/tags/gitflow/">gitflow</a><a href="/tags/项目控制/">项目控制</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/04/05/some-thought-about-git-workflow/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/04/04/restart-bloging/" title="重新开始写博客" itemprop="url">重新开始写博客</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-04-04T15:13:44.000Z" itemprop="datePublished"> 发表于 2016-04-04</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x79BB;&#x4E0A;&#x6B21;&#x5199;&#x535A;&#x5BA2;&#x5DF2;&#x7ECF;&#x662F;&#x5F88;&#x4E45;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x8BB0;&#x5F97;&#x5F88;&#x65E9;&#x4EE5;&#x524D;&#x5C31;&#x770B;&#x8FC7;&#x5173;&#x4E8E;&#x5199;&#x535A;&#x5BA2;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x4E5F;&#x81EA;&#x5DF1;&#x5199;&#x8FC7;&#x6587;&#x7AE0;&#x9610;&#x8FF0;&#x8FC7;&#x5199;&#x4F5C;&#x7684;&#x5404;&#x79CD;&#x597D;&#x5904;&#x3002;&#x4F46;&#x662F;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x575A;&#x6301;&#x4E0B;&#x6765;&#xFF0C;&#x5176;&#x5B9E;&#x56DE;&#x5934;&#x60F3;&#x60F3;&#x4F46;&#x662F;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x8BF4;&#x60F3;&#x8981;&#x575A;&#x6301;&#x5199;&#x4F5C;&#xFF0C;&#x53EA;&#x662F;&#x89C9;&#x5F97;&#x5199;&#x6587;&#x7AE0;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x5E2E;&#x52A9;&#x6574;&#x7406;&#x601D;&#x8DEF;&#x7684;&#x597D;&#x529E;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x662F;&#x4FE1;&#x606F;&#x6CDB;&#x6EE5;&#x7684;&#x4E00;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x5F88;&#x591A;&#x9053;&#x7406;&#x6211;&#x6CA1;&#x4F1A;&#x5728;&#x5404;&#x79CD;&#x5404;&#x6837;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x573A;&#x5408;&#x770B;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x5375;&#x7528;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x56E0;&#x4E3A;&#x9053;&#x7406;&#x5F80;&#x5F80;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x5176;&#x5B9E;&#x505A;&#x4E0D;&#x5230;&#x3002;&#x8FD9;&#x4E2A;&#x8DDF;&#x65C5;&#x6E38;&#x5F88;&#x50CF;&#xFF0C;&#x5F53;&#x4F60;&#x8FD8;&#x6CA1;&#x53BB;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x7684;&#x65F6;&#x5019;&#x770B;&#x8FC7;&#x5F88;&#x591A;&#x7167;&#x7247;&#xFF0C;&#x770B;&#x8FC7;&#x5F88;&#x591A;&#x6E38;&#x8BB0;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x4F60;&#x5DF2;&#x7ECF;&#x5F88;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x771F;&#x6B63;&#x53BB;&#x5230;&#x90A3;&#x4E2A;&#x5730;&#x65B9;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x53D7;&#x3002;&#x8FD9;&#x79CD;&#x611F;&#x53D7;&#x4E0D;&#x662F;&#x4F60;&#x770B;&#x518D;&#x591A;&#x7167;&#x7247;&#xFF0C;&#x8BFB;&#x518D;&#x591A;&#x6E38;&#x8BB0;&#x80FD;&#x591F;&#x611F;&#x53D7;&#x5230;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x8DDF;&#x4F60;&#x770B;&#x518D;&#x591A;&#x522B;&#x4EBA;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x7684;&#x9053;&#x7406;&#x548C;&#x7ECF;&#x9A8C;&#x90FD;&#x662F;&#x6CA1;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x4EB2;&#x8EAB;&#x5B9E;&#x8DF5;&#x8FC7;&#x90A3;&#x4E9B;&#x9053;&#x7406;&#x548C;&#x7ECF;&#x9A8C;&#x5C31;&#x4E0D;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x3002;</p>
<p>&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#xFF0C;&#x4E5F;&#x4E0D;&#x505A;&#x65E0;&#x7528;&#x7684;&#x8BA1;&#x5212;&#xFF0C;just do it&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4F1A;&#x575A;&#x6301;&#x5199;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x5B66;&#x4E60;&#x5FC3;&#x5F97;&#xFF0C;&#x7FFB;&#x8BD1;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x5916;&#x6587;&#x6587;&#x7AE0;&#xFF0C;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#xFF0C;&#x751F;&#x6D3B;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x7B49;&#x7B49;&#x3002;&#x901A;&#x8FC7;&#x8F93;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x5012;&#x903C;&#x81EA;&#x5DF1;&#x505A;&#x66F4;&#x591A;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x505A;&#x66F4;&#x591A;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x628A;&#x4E00;&#x4E9B;&#x65E0;&#x5E8F;&#x7684;&#x601D;&#x8003;&#x8F6C;&#x5316;&#x6210;&#x6709;&#x6548;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#x66F4;&#x52A0;&#x7684;&#x6709;&#x6DF1;&#x5EA6;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/思考讨论/">思考讨论</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/写作/">写作</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/04/04/restart-bloging/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/page/2/"><span></span>Prev</a><a class="page-number" href="/">1</a><a class="page-number" href="/page/2/">2</a><span class="page-number current">3</span>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>8</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/linux/" title="linux">linux<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/操作系统/" title="操作系统">操作系统<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
