
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>读书方法的一些思考 | yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="&amp;#x5F15;&amp;#x5B50;&amp;#x4ECA;&amp;#x5929;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;&amp;#x300A;&amp;#x7CBE;&amp;#x8FDB;&amp;#x300B;&amp;#x8FD9;&amp;#x672C;&amp;#x4E66;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x8BF4;&amp;#x5728;&amp;#x8BFB;&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4E2D;&amp;#x786E;">
<meta property="og:type" content="article">
<meta property="og:title" content="读书方法的一些思考">
<meta property="og:url" content="http://zhengyi.me/2016/05/14/some-thought-about-reading/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="&amp;#x5F15;&amp;#x5B50;&amp;#x4ECA;&amp;#x5929;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;&amp;#x300A;&amp;#x7CBE;&amp;#x8FDB;&amp;#x300B;&amp;#x8FD9;&amp;#x672C;&amp;#x4E66;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x8BF4;&amp;#x5728;&amp;#x8BFB;&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4E2D;&amp;#x786E;">
<meta property="og:updated_time" content="2016-05-15T13:09:22.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="读书方法的一些思考">
<meta name="twitter:description" content="&amp;#x5F15;&amp;#x5B50;&amp;#x4ECA;&amp;#x5929;&amp;#x8BFB;&amp;#x5B8C;&amp;#x4E86;&amp;#x300A;&amp;#x7CBE;&amp;#x8FDB;&amp;#x300B;&amp;#x8FD9;&amp;#x672C;&amp;#x4E66;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x8BF4;&amp;#x5728;&amp;#x8BFB;&amp;#x7684;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4E2D;&amp;#x786E;">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/14/some-thought-about-reading/" title="读书方法的一些思考" itemprop="url">读书方法的一些思考</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-14T13:07:04.000Z" itemprop="datePublished"> 发表于 2016-05-14</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#引子"><span class="toc-number">1.</span> <span class="toc-text">引子</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#反思"><span class="toc-number">2.</span> <span class="toc-text">反思</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#阅读的方法"><span class="toc-number">2.1.</span> <span class="toc-text">阅读的方法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#阅读的作用"><span class="toc-number">2.2.</span> <span class="toc-text">阅读的作用</span></a></li></ol></li></ol>
		
		</div>
		
		<h2 id="&#x5F15;&#x5B50;"><a href="#&#x5F15;&#x5B50;" class="headerlink" title="&#x5F15;&#x5B50;"></a>&#x5F15;&#x5B50;</h2><p>&#x4ECA;&#x5929;&#x8BFB;&#x5B8C;&#x4E86;&#x300A;&#x7CBE;&#x8FDB;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x5728;&#x8BFB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x786E;&#x5B9E;&#x9886;&#x609F;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x4F5C;&#x8005;&#x60F3;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#x3002;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x4E5F;&#x5B66;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x918D;&#x9190;&#x704C;&#x9876;&#x7684;&#x65F6;&#x523B;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x5408;&#x4E0A;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x95EE;&#x81EA;&#x5DF1;&#x8FD9;&#x672C;&#x4E66;&#x8BB2;&#x4E86;&#x4EC0;&#x4E48;&#x4E3B;&#x8981;&#x7684;&#x89C2;&#x70B9;&#xFF1F;&#x6211;&#x7ADF;&#x56DE;&#x60F3;&#x4E0D;&#x8D77;&#x591A;&#x5C11;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x6709;&#x79CD;&#x6781;&#x5EA6;&#x6050;&#x60E7;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x56E0;&#x4E3A;&#x81EA;&#x4EE5;&#x4E3A;&#x82B1;&#x4E86;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x8BA4;&#x771F;&#x9605;&#x8BFB;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x5728;&#x8BFB;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x7B14;&#x8BB0;&#xFF0C;&#x5E76;&#x628A;&#x8BFB;&#x4E66;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x8BB0;&#x5F55;&#x4E86;&#x4E0B;&#x6765;&#x3002;&#x4F46;&#x662F;&#x8BFB;&#x5B8C;&#x5374;&#x53D1;&#x73B0;&#x6240;&#x8BB0;&#x4F4F;&#x7684;&#x4E1C;&#x897F;&#x751A;&#x5C11;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x751A;&#x5C11;&#x3002;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x5728;&#x5927;&#x8111;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x5F85;&#x7740;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x8FD9;&#x672C;&#x4E66;&#x4E0E;&#x5176;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x4ECE;&#x800C;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x614C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x53BB;&#x4E0A;&#x7F51;&#x8FDB;&#x884C;&#x4E86;&#x641C;&#x7D22;&#x4E86;&#x201C;&#x5982;&#x4F55;&#x8BFB;&#x4E66; &#x6709;&#x6548;&#x201D;&#xFF0C;&#x201C;&#x8BFB;&#x4E66; &#x5BB9;&#x6613;&#x5FD8;&#x201D;&#x3002;&#x5BF9;&#x4E8E;&#x641C;&#x7D22;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x53EA;&#x662F;&#x5306;&#x5306;&#x5730;&#x8FDB;&#x884C;&#x4E86;&#x9605;&#x8BFB;&#xFF0C;&#x5BC4;&#x5E0C;&#x671B;&#x4E8E;&#x80FD;&#x591F;&#x4ECE;&#x4E2D;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4E24;&#x4E2A;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x9605;&#x8BFB;&#x6548;&#x679C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x660E;&#x667A;&#x7684;&#xFF0C;&#x53BB;&#x641C;&#x7D22;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x9605;&#x8BFB;&#x4E00;&#x672C;&#x4E66;&#x7684;&#x8D44;&#x6599;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x89C9;&#x5F97;&#x614C;&#x5F20;&#x7684;&#x65F6;&#x5019;&#x522B;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#x5F80;&#x5F80;&#x4E0D;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x5E2E;&#x52A9;&#x5230;&#x4F60;&#x3002;&#x7279;&#x522B;&#x662F;&#x4F60;&#x62B1;&#x7740;&#x4E00;&#x4E2A;&#x5F88;&#x529F;&#x5229;&#x7684;&#x5FC3;&#x6001;&#x53BB;&#x8BD5;&#x56FE;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x7B80;&#x5355;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x4E0D;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="&#x53CD;&#x601D;"><a href="#&#x53CD;&#x601D;" class="headerlink" title="&#x53CD;&#x601D;"></a>&#x53CD;&#x601D;</h2><p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x5C31;&#x662F;&#x60F3;&#x73B0;&#x5728;&#x8FD9;&#x6837;&#xFF0C;&#x5B89;&#x9759;&#x7684;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x3002;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x9605;&#x8BFB;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x81EA;&#x5DF1;&#x5176;&#x5B9E;&#x662F;&#x6700;&#x6E05;&#x695A;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x81EA;&#x5DF1;&#x7684;&#x9605;&#x8BFB;&#x884C;&#x4E3A;&#x6765;&#x627E;&#x51FA;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5373;&#x4F7F;&#x627E;&#x4E0D;&#x5230;&#x4E5F;&#x53EF;&#x4EE5;&#x60F3;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x65B9;&#x6848;&#x53BB;&#x505A;&#x3002;&#x80FD;&#x591F;&#x60F3;&#x5230;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x89D2;&#x5EA6;&#x4E0A;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x9605;&#x8BFB;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F5C;&#x8005;&#x7684;&#x67D0;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#x867D;&#x4E0D;&#x80FD;&#x591F;&#x5B8C;&#x5168;&#x7684;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x4E5F;&#x5DF2;&#x7ECF;&#x5BF9;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x4EA7;&#x751F;&#x4E86;&#x5F71;&#x54CD;&#x3002;&#x4E5F;&#x8BB8;&#x5373;&#x4F7F;&#x4F60;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x8FD9;&#x672C;&#x4E66;&#x8BB2;&#x4E86;&#x54EA;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x5DF2;&#x7ECF;&#x5C06;&#x8FD9;&#x4E9B;&#x89C2;&#x70B9;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x8BB0;&#x4F4F;&#x4E86;&#xFF0C;&#x5728;&#x5C06;&#x6765;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x78B0;&#x5230;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x5173;&#x952E;&#x5C31;&#x4ECE;&#x5982;&#x4F55;&#x5728;&#x9605;&#x8BFB;&#x5B8C;&#x4E00;&#x672C;&#x4E66;&#x4EE5;&#x540E;&#x60F3;&#x8D77;&#x6765;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x5982;&#x4F55;&#x5C06;&#x4F5C;&#x8005;&#x7684;&#x89C2;&#x70B9;&#x8F6C;&#x5316;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x90A3;&#x4E48;&#x9605;&#x8BFB;&#x4E2D;&#x7684;&#x601D;&#x8003;&#x5C31;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7684;&#x5173;&#x952E;&#xFF0C;&#x6709;&#x601D;&#x8003;&#x624D;&#x80FD;&#x5C06;&#x81EA;&#x5DF1;&#x5DF2;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x4E0E;&#x5176;&#x53D1;&#x751F;&#x8054;&#x7CFB;&#x3002;</p>
<h3 id="&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;"></a>&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;</h3><p>&#x6211;&#x89C9;&#x5F97;&#x9605;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x7684;&#x9605;&#x8BFB;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<ol>
<li>&#x521D;&#x6B21;&#x9605;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x597D;&#x5E26;&#x6709;&#x76EE;&#x7684;&#x6027;&#x7684;&#x53BB;&#x9605;&#x8BFB;&#x3002;&#x5373;&#x5E0C;&#x671B;&#x4ECE;&#x4E66;&#x4E2D;&#x83B7;&#x5F97;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;&#xFF0C;&#x5E0C;&#x671B;&#x4F5C;&#x8005;&#x5E2E;&#x52A9;&#x4F60;&#x89E3;&#x51B3;&#x90A3;&#x4E9B;&#x56F0;&#x60D1;&#x3002;&#x5E26;&#x7740;&#x7591;&#x95EE;&#x53BB;&#x8BFB;&#x4F1A;&#x8BA9;&#x4F60;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x628A;&#x8BFB;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x5DF2;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x8054;&#x7CFB;&#x3002;</li>
<li>&#x5E8F;&#x548C;&#x524D;&#x8A00;&#x6700;&#x597D;&#x8981;&#x8BFB;&#xFF0C;&#x63A5;&#x7740;&#x5C31;&#x662F;&#x76EE;&#x5F55;&#x3002;&#x8981;&#x5728;&#x8BFB;&#x4E4B;&#x524D;&#x5BF9;&#x4E8E;&#x7AE0;&#x8282;&#x7684;&#x7ED3;&#x6784;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</li>
<li>&#x9605;&#x8BFB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x8981;&#x8FC7;&#x591A;&#x7684;&#x8FDB;&#x884C;&#x6807;&#x6CE8;&#x91CD;&#x70B9;&#xFF0C;&#x9002;&#x5F53;&#x7684;&#x5728;&#x8BFB;&#x5230;&#x6709;&#x611F;&#x609F;&#x7684;&#x65F6;&#x5019;&#x5728;&#x4E66;&#x4E0A;&#x505A;&#x7B14;&#x8BB0;&#x3002;&#x9605;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#x5907;&#x597D;&#x7EB8;&#x7B14;&#xFF0C;&#x5F53;&#x6709;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x4ECE;&#x5927;&#x8111;&#x4E2D;&#x8FF8;&#x53D1;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53CA;&#x65F6;&#x7684;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x56DE;&#x53BB;&#x7EE7;&#x7EED;&#x9605;&#x8BFB;&#x3002;</li>
<li>&#x8BFB;&#x7684;&#x65F6;&#x5019;&#x5982;&#x679C;&#x8D70;&#x795E;&#x7684;&#x8BDD;&#x9A6C;&#x4E0A;&#x505C;&#x6B62;&#x9605;&#x8BFB;&#xFF0C;&#x8D70;&#x795E;&#x7684;&#x9605;&#x8BFB;&#x7EAF;&#x5C5E;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x9891;&#x7E41;&#x7684;&#x5BF9;&#x81EA;&#x5DF1;&#x8BFB;&#x5230;&#x7684;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x6BCF;&#x8282;&#x3001;&#x6BCF;&#x7AE0;&#x4E4B;&#x540E;&#xFF0C;&#x60F3;&#x60F3;&#x4F5C;&#x8005;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F5C;&#x8005;&#x524D;&#x540E;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x3002;</li>
<li>&#x6709;&#x6761;&#x4EF6;&#x7684;&#x8BDD;&#xFF0C;&#x5728;&#x9605;&#x8BFB;&#x5B8C;&#x4E00;&#x7AE0;&#x4EE5;&#x540E;&#x5728;&#x8131;&#x79BB;&#x4E66;&#x672C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x8FD9;&#x4E00;&#x7AE0;&#x8BB2;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;&#x70B9;&#x4EE5;&#x53CA;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x3002;&#x53EF;&#x4EE5;&#x753B;&#x56FE;&#x3001;&#x5199;&#x5B57;&#x3001;&#x5F62;&#x5F0F;&#x4E0D;&#x9650;&#x3002;</li>
<li>&#x5982;&#x679C;&#x559C;&#x6B22;&#x53EF;&#x4EE5;&#x8DF3;&#x7740;&#x8BFB;&#x3002;</li>
<li>&#x8BFB;&#x5B8C;&#x5168;&#x672C;&#xFF0C;&#x5408;&#x4E0A;&#x4E66;&#x672C;&#xFF0C;&#x6781;&#x529B;&#x56DE;&#x60F3;&#x3002;&#x7136;&#x540E;&#x53BB;&#x91CD;&#x65B0;&#x7FFB;&#x4E00;&#x4E0B;&#x4E66;&#x672C;/&#x6BCF;&#x7AE0;&#x505A;&#x7684;&#x7B14;&#x8BB0;&#xFF0C;&#x505A;&#x4E00;&#x4E0B;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#x5FEB;&#x901F;&#x91CD;&#x8BFB;&#x4E00;&#x904D;&#xFF0C;&#x5728;&#x89C9;&#x5F97;&#x91CD;&#x8981;&#x7684;&#x7AE0;&#x8282;&#x8FDB;&#x884C;&#x6DF1;&#x5EA6;&#x9605;&#x8BFB;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x91CD;&#x8BFB;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x5728;&#x8BFB;&#x5B8C;&#x4E00;&#x904D;&#x4E4B;&#x540E;&#x9A6C;&#x4E0A;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x9694;&#x4E0A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x518D;&#x8FDB;&#x884C;&#x3002;&#x8FD9;&#x4F1A;&#x6709;&#x66F4;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</li>
<li>&#x91CD;&#x590D;5~10&#x3002;</li>
</ol>
<h3 id="&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;"><a href="#&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;" class="headerlink" title="&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;"></a>&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;</h3><p>&#x987A;&#x4FBF;&#x7406;&#x4E00;&#x7406;&#x4E0B;&#x5173;&#x4E8E;&#x9605;&#x8BFB;&#x4F5C;&#x7528;&#x7684;&#x60F3;&#x6CD5;</p>
<ol>
<li>&#x7EAF;&#x5C5E;&#x5A31;&#x4E50;&#x3002;</li>
<li>&#x5E0C;&#x671B;&#x4F5C;&#x8005;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x67D0;&#x4E2A;&#x7591;&#x95EE;&#x3001;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x5E0C;&#x671B;&#x4ECE;&#x4E66;&#x4E2D;&#x6C72;&#x53D6;&#x67D0;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x77E5;&#x8BC6;&#x3002;</li>
<li>&#x5728;&#x9605;&#x8BFB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x8FDB;&#x800C;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x60F3;&#x6CD5;&#x3001;&#x7591;&#x95EE;&#x7B49;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5230;&#x66F4;&#x591A;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x4E16;&#x754C;&#x548C;&#x53EF;&#x80FD;&#x6027;&#x3002;</li>
</ol>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/阅读相关/">阅读相关</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/阅读/">阅读</a><a href="/tags/思考/">思考</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://zhengyi.me/2016/05/14/some-thought-about-reading/" data-title="读书方法的一些思考 | yi&#39;s weblog" data-tsina="null" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/05/23/learning-shell-in-mac/" title="Mac/Linux 命令学习">
  <strong>上一篇：</strong><br/>
  <span>
  Mac/Linux 命令学习</span>
</a>
</div>


<div class="next">
<a href="/2016/05/05/learning-how-to-learn-module-2-note/"  title="Learning how to learn 第二周学习笔记">
 <strong>下一篇：</strong><br/> 
 <span>Learning how to learn 第二周学习笔记
</span>
</a>
</div>

</nav>

	

<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#引子"><span class="toc-number">1.</span> <span class="toc-text">引子</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#反思"><span class="toc-number">2.</span> <span class="toc-text">反思</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#阅读的方法"><span class="toc-number">2.1.</span> <span class="toc-text">阅读的方法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#阅读的作用"><span class="toc-number">2.2.</span> <span class="toc-text">阅读的作用</span></a></li></ol></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>10</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/linux/" title="linux">linux<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/操作系统/" title="操作系统">操作系统<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>




<script type="text/javascript">

var disqus_shortname = '2power10';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
