
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta property="og:type" content="website">
<meta property="og:title" content="yi's weblog">
<meta property="og:url" content="http://zhengyi.me/page/2/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="yi's weblog">
<meta name="twitter:description" content="关于编程、技术、读书、思考的一些文字，以及一些我觉得有趣的东西。">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/27/unity-of-knowlede-and-action/" title="“知行合一”" itemprop="url">“知行合一”</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-27T12:50:23.000Z" itemprop="datePublished"> 发表于 2016-05-27</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x77E5;&#x8BC6;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4EBA;&#x6709;&#x4E09;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x505A;&#x5230;&#x7684;&#x3002;&#x672C;&#x6587;&#x4E0D;&#x8BA8;&#x8BBA;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="/img/know_vs_action.png" alt="&#x77E5;&#x884C;&#x5408;&#x4E00;"></p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x7684;&#x77E5;&#x8BC6;&#x505C;&#x7559;&#x5728;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F88;&#x591A;&#x9014;&#x5F84;&#x5B66;&#x4E60;&#x3001;&#x5438;&#x6536;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9A71;&#x52A8;&#x6211;&#x4EEC;&#x7684;&#x4E0D;&#x662F;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x662F;&#x4E60;&#x60EF;&#x548C;&#x6F5C;&#x610F;&#x8BC6;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x5B66;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#xFF0C;&#x4E00;&#x4E2A;&#x65B0;&#x624B;&#x901A;&#x8FC7;&#x770B;&#x89C6;&#x9891;&#x3001;&#x770B;&#x52A8;&#x4F5C;&#x8981;&#x9886;&#x7B49;&#x5B66;&#x4E60;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x8981;&#x9886;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x8DDF;&#x6253;&#x597D;&#x7FBD;&#x6BDB;&#x7403;&#x5176;&#x5B9E;&#x5E76;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x53EA;&#x80FD;&#x8BF4;&#x638C;&#x63E1;&#x4E86;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x53EF;&#x80FD;&#x80FD;&#x8BA9;&#x4F60;&#x5B66;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x7B49;&#x4F60;&#x6700;&#x7EC8;&#x5B66;&#x4F1A;&#x4E86;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x8111;&#x5B50;&#x91CC;&#x60F3;&#x7684;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x52A8;&#x4F5C;&#x8981;&#x9886;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x52A8;&#x4F5C;&#x5DF2;&#x7ECF;&#x8F6C;&#x5316;&#x6210;&#x4F60;&#x8111;&#x5B50;&#x91CC;&#x7684;&#x4E00;&#x4E2A;memory chunk&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x4ECE;&#x4E66;&#x672C;&#x4E0A;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5927;&#x9053;&#x7406;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x5F88;&#x591A;&#x52B1;&#x5FD7;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4F46;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x505C;&#x7559;&#x5728;&#x77E5;&#x9053;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x662F;&#x5E26;&#x7740;&#x4E00;&#x79CD;&#x60EF;&#x6027;&#x53BB;&#x505A;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x5728;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#x5F88;&#x725B;&#x903C;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x5982;&#x679C;&#x95EE;&#x4ED6;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x725B;&#xFF1F;&#x4ED6;&#x53EF;&#x80FD;&#x4F1A;&#x8DDF;&#x4F60;&#x8BF4;&#x51FA;&#x5F88;&#x591A;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x4E9B;&#x70B9;&#x4F60;&#x5C31;&#x80FD;&#x6210;&#x4E3A;&#x8DDF;&#x4ED6;&#x4E00;&#x6837;&#x7684;&#x4EBA;&#x3002;&#x4E00;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x89C9;&#x7684;&#x5F88;&#x725B;&#x903C;&#x4E8B;&#x60C5;&#xFF0C;&#x5728;&#x4ED6;&#x770B;&#x6765;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x4E00;&#x4EF6;&#x968F;&#x968F;&#x4FBF;&#x4FBF;&#x5C31;&#x80FD;&#x505A;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4ED6;&#x80CC;&#x540E;&#x5305;&#x542B;&#x7684;&#x662F;&#x4ED6;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x5F62;&#x6210;&#x7684;&#x60EF;&#x6027;&#x3002;&#x800C;&#x4ED6;&#x7ED9;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x70B9;&#x5F80;&#x5F80;&#x53EA;&#x662F;&#x4ED6;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x5B8C;&#x5168;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x91CD;&#x590D;&#x4ED6;&#x7684;&#x6210;&#x957F;&#x8F68;&#x8FF9;&#x3002;</p>
<p>&#x5F80;&#x5F80;&#x8D8A;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x4EBA;&#x7ED9;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x7EA6;&#x7CBE;&#x70BC;&#x3002;&#x5982;&#x679C;&#x4F60;&#x95EE;&#x4F60;&#x7684;manager&#x8BA9;&#x4ED6;&#x7ED9;&#x4F60;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x4F1A;&#x8DDF;&#x4F60;&#x8BF4;&#x4E00;&#x5806;&#x5982;&#x679C;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x505A;&#x597D;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x5DE7;&#x3002;&#x5982;&#x679C;&#x4F60;&#x95EE;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#x8001;&#x677F;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x4F1A;&#x8DDF;&#x4F60;&#x8BF4;&#x4E00;&#x4E9B;&#x4EBA;&#x751F;&#x5C0F;&#x5EFA;&#x8BAE;&#xFF0C;&#x800C;&#x4E0D;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x53BB;&#x95EE;&#x4E54;&#x5E03;&#x65AF;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x5C31;&#x8DDF;&#x4F60;&#x8BF4;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;Stay Hungry Stay Foolish&#x201D;&#x3002;</p>
<p>&#x4ECE;&#x77E5;&#x9053;&#x5230;&#x505A;&#x5230;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x9E3F;&#x6C9F;&#x7684;&#xFF0C;&#x800C;&#x4ECE;&#x505A;&#x5230;&#x5230;&#x77E5;&#x9053;&#x5F80;&#x5F80;&#x53EA;&#x6709;&#x54AB;&#x5C3A;&#x4E4B;&#x9065;&#x3002;</p>
<p>&#x90A3;&#x662F;&#x4E0D;&#x662F;&#x8BF4;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x5C31;&#x4E0D;&#x91CD;&#x8981;&#x5462;&#xFF1F;&#x5E76;&#x4E0D;&#x7136;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x7CFB;&#x7EDF;&#x662F;&#x9700;&#x8981;&#x77E5;&#x8BC6;&#x7CFB;&#x7EDF;&#x652F;&#x6491;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5176;&#x5B9E;&#x5F88;&#x5C11;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x628A;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7684;&#x5185;&#x5316;&#x6210;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x878D;&#x5165;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x5F53;&#x4E2D;&#x3002;&#x5C4A;&#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x7684;&#x6280;&#x5DE7;&#x77E5;&#x8BC6;&#x90FD;&#x5FD8;&#x4E86;&#xFF0C;&#x4F60;&#x4F9D;&#x7136;&#x53EF;&#x80FD;&#x968F;&#x65F6;&#x4ECE;&#x4F60;&#x7684;&#x5927;&#x8111;&#x6DF1;&#x5904;&#x53EC;&#x5524;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x501A;&#x5929;&#x5C60;&#x9F99;&#x8BB0;&#x91CC;&#x9762;&#x5F20;&#x4E09;&#x4E30;&#x6559;&#x5F20;&#x65E0;&#x5FCC;&#x592A;&#x6781;&#x5251;&#x6CD5;&#xFF0C;&#x6559;&#x5B8C;&#x95EE;&#x5176;&#x8BB0;&#x5F97;&#x4E48;&#xFF1F;&#x5F53;&#x5F20;&#x65E0;&#x5FCC;&#x8BF4;&#x5168;&#x5FD8;&#x4E86;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4ED6;&#x5168;&#x90E8;&#x878D;&#x4F1A;&#x8D2F;&#x901A;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x7EB5;&#x7136;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5F20;&#x65E0;&#x5FCC;&#x8FD9;&#x822C;&#x5929;&#x8D4B;&#x5F02;&#x7980;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x7EC3;&#x4E60;&#x548C;&#x601D;&#x8003;&#x6162;&#x6162;&#x7684;&#x53BB;&#x5FD8;&#x6389;&#x90A3;&#x4E9B;&#x8BA8;&#x4EBA;&#x538C;&#x7684;&#x5404;&#x79CD;&#x6280;&#x5DE7;&#x3001;&#x5404;&#x79CD;&#x9053;&#x7406;&#x3002; &#x6211;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4FEE;&#x70BC;&#xFF1A;</p>
<ol>
<li>&#x5F53;&#x4F60;&#x5728;&#x505A;&#x4E00;&#x4EF6;&#x4F60;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x63D0;&#x4E00;&#x4E9B;&#x66F4;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x601D;&#x8003;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x81EA;&#x8EAB;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#x4E60;&#x60EF;&#x4E2D;&#x627E;&#x5230;&#x8FDB;&#x6B65;&#x7684;&#x70B9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x56DE;&#x60F3;&#x4F60;&#x6240;&#x77E5;&#x9053;&#x7684;&#x77E5;&#x8BC6;&#x4E2D;&#x6709;&#x54EA;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x63D0;&#x9AD8;&#x3002;</li>
<li>&#x5728;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x505A;&#x5B8C;&#x4E4B;&#x540E;&#x8981;&#x7ECF;&#x5E38;&#x7684;&#x7528;&#x4E00;&#x4E2A;&#x201C;&#x4E0A;&#x5E1D;&#x89C6;&#x89D2;&#x201D;&#x770B;&#x770B;&#x4F60;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6709;&#x54EA;&#x4E9B;&#x505A;&#x7684;&#x4E0D;&#x597D;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x505A;&#x4E0D;&#x597D;&#xFF1F;&#x662F;&#x56E0;&#x4E3A;&#x65E7;&#x7684;&#x4E60;&#x60EF;&#x8FD8;&#x662F;&#x8BF4;&#x67D0;&#x4E9B;&#x77E5;&#x8BC6;&#x7684;&#x7F3A;&#x4E4F;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x7B49;&#x65B9;&#x6CD5;&#x62D3;&#x5BBD;&#x81EA;&#x5DF1;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x5E76;&#x79EF;&#x6781;&#x5C06;&#x5176;&#x8DDF;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x8DF5;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x601D;&#x8003;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x505A;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x70B9;&#x8FD9;&#x5C31;&#x591F;&#x4E86;&#x3002;&#x4F55;&#x51B5;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x7AD9;&#x5728;&#x524D;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#x4E0A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5462;&#xFF1F;</li>
</ol>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x738B;&#x9633;&#x660E;&#x5F53;&#x65F6;&#x63D0;&#x51FA;&#x201C;&#x77E5;&#x884C;&#x5408;&#x4E00;&#x201D;&#x7684;&#x539F;&#x610F;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7406;&#x89E3;&#x7684;&#x201C;&#x77E5;&#x884C;&#x5408;&#x4E00;&#x201D;&#x662F;&#x901A;&#x8FC7;&#x884C;&#x52A8;&#x5C06;&#x4F60;&#x77E5;&#x9053;&#x7684;&#x548C;&#x4F60;&#x80FD;&#x505A;&#x5230;&#x7684;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x201D;&#x5FD8;&#x8BB0;&#x201D;&#x7684;&#x5883;&#x754C;&#x3002;</p>
<p>[end]</p>
<hr>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/思考讨论/">思考讨论</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/思考/">思考</a><a href="/tags/行动/">行动</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/05/27/unity-of-knowlede-and-action/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/25/learning-shell-in-mac-cp/" title="Mac 命令学习-每日一贴之cp" itemprop="url">Mac 命令学习-每日一贴之cp</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-25T13:53:30.000Z" itemprop="datePublished"> 发表于 2016-05-25</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="&#x76F8;&#x5173;&#x6982;&#x5FF5;"><a href="#&#x76F8;&#x5173;&#x6982;&#x5FF5;" class="headerlink" title="&#x76F8;&#x5173;&#x6982;&#x5FF5;"></a>&#x76F8;&#x5173;&#x6982;&#x5FF5;</h2><h3 id="symbolic-links"><a href="#Symbolic-links" class="headerlink" title="Symbolic links"></a>Symbolic links</h3><p>Symbolic links/soft links&#x53EF;&#x4EE5;<anchor>&#x7406;&#x89E3;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5FEB;&#x6377;&#x65B9;&#x5F0F;</anchor>&#xFF0C;&#x8DDF;mac GUI&#x53F3;&#x51FB;&#x51FA;&#x6765;&#x7684;alias&#x6709;&#x7740;&#x5F88;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x6BD4;alias&#x8981;&#x66F4;&#x52A0;&#x7684;&#x5E95;&#x5C42;&#x4E00;&#x4E9B;&#x3002;Softlink &#x5373;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x6587;&#x4EF6;&#x4E5F;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x6587;&#x4EF6;&#x5939;&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#x3002;</p>
<p>&#x901A;&#x8FC7;<code>ln  -s target/file/or/dir link/path</code>&#x6765;&#x521B;&#x5EFA;&#x3002;&#x6211;&#x521B;&#x5EFA;&#x4E86;&#x9488;&#x5BF9;&#x6587;&#x4EF6;&#x548C;&#x6587;&#x4EF6;&#x5939;&#x7684;softlink&#x548C;alias&#xFF0C;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">$ ls -lo@</span><br><span class="line">total 3024</span><br><span class="line">-rwxr-xr-x  1 zhengyi    2723 May 24 08:20 build.sh</span><br><span class="line">-rw-r--r--@ 1 zhengyi  257136 May 25 20:49 build.sh.alias</span><br><span class="line">	com.apple.FinderInfo	     32 </span><br><span class="line">lrwxr-xr-x  1 zhengyi       8 May 25 20:49 build.sh.link -&gt; build.sh</span><br><span class="line">drwxr-xr-x  9 zhengyi     306 May 25 20:24 src</span><br><span class="line">-rw-r--r--@ 1 zhengyi 1268908 May 25 20:40 src_alias</span><br><span class="line">	com.apple.FinderInfo	     32 </span><br><span class="line">lrwxr-xr-x  1 zhengyi       4 May 25 20:39 src_link -&gt; src/</span><br></pre></td></tr></table></figure>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;softlink&#x662F;&#x901A;&#x8FC7;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#x6765;&#x8BC6;&#x522B;&#x7684;&#xFF0C;&#x800C;alias&#x662F;&#x901A;&#x8FC7;&#x62D3;&#x5C55;&#x5C5E;&#x6027;&#x6765;&#x8FDB;&#x884C;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;alias&#x53EA;&#x6709;&#x5728;apple &#x7684;Finder&#x4E0B;&#x6709;&#x7528;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x4ED6;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x6587;&#x4EF6;&#x3002;    </p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x94FE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x7684;&#x8BDD;&#xFF0C;alias&#x56E0;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x81EA;&#x7136;&#x4E0D;&#x80FD;&#x591F;cd&#x8FDB;&#x53BB;&#xFF0C;&#x800C;softlink&#x662F;&#x53EF;&#x4EE5;cd&#x8FDB;&#x53BB;&#x7684;&#x3002;</p>
<h3 id="hard-link"><a href="#Hard-link" class="headerlink" title="Hard link"></a>Hard link</h3><p>&#x4E0E;softlink&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x4E0E;softlink&#x4E0D;&#x540C;&#xFF0C;hardlink&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#x201D;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6210;&#x78C1;&#x76D8;&#x4E0A;&#x4E00;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5728;&#x7EC8;&#x7AEF;&#x548C;GUI&#x770B;&#x5230;&#x7684;&#x201C;&#x6587;&#x4EF6;&#x201D;&#x53EA;&#x662F;&#x6307;&#x5411;&#x4E86;&#x90A3;&#x5757;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x201D;&#x6587;&#x4EF6;&#x201D;&#x6307;&#x5411;&#x540C;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x3002;&#x8FD9;&#x5C31;&#x662F;hardlink&#x5E72;&#x7684;&#x4E8B;&#x60C5;&#x3002;hardlink&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x9488;&#x5BF9;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x4F1A;&#x7834;&#x574F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x3002;</p>
<h2 id="&#x5E38;&#x7528;&#x53C2;&#x6570;"><a href="#&#x5E38;&#x7528;&#x53C2;&#x6570;" class="headerlink" title="&#x5E38;&#x7528;&#x53C2;&#x6570;"></a>&#x5E38;&#x7528;&#x53C2;&#x6570;</h2><p><code>-f</code> - &#x5C06;&#x8986;&#x76D6;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4E0D;&#x505A;&#x63D0;&#x793A;&#x3002;<br><code>-n</code> - &#x4E0D;&#x8986;&#x76D6;&#x76EE;&#x6807;&#x6587;&#x4EF6;&#x3002;<br><code>-r</code> - &#x8FD9;&#x4E2A;&#x662F;<anchor>&#x5386;&#x53F2;&#x7248;&#x672C;&#x7684;&#x9012;&#x5F52;&#x62F7;&#x8D1D;</anchor>&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x3002;<br><code>-R</code> - &#x5982;&#x679C;&#x6E90;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x7684;&#x8BDD;&#xFF0C;&#x9012;&#x5F52;&#x62F7;&#x8D1D;&#x5230;&#x76EE;&#x6807;&#x8DEF;&#x5F84;&#x3002;&#x5982;&#x679C;&#x6E90;&#x6587;&#x4EF6;&#x4EE5;<code>/</code>&#x7ED3;&#x5C3E;&#xFF0C;&#x90A3;&#x4E48;&#x6E90;&#x6587;&#x4EF6;&#x5939;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x5C06;&#x88AB;&#x62F7;&#x8D1D;&#x5230;&#x76EE;&#x6807;&#x8DEF;&#x5F84;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6307;&#x5B9A;&#x5219;&#x662F;&#x62F7;&#x8D1D;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x3002;<br><code>-H</code> - &#x4E0E;<code>-R</code>&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x4FDD;&#x6301;&#x539F;&#x6709;&#x7684;softlink&#x3002;<br><code>-P</code> - &#x4E0E;<code>-R</code>&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x4FDD;&#x6301;&#x539F;&#x6709;&#x7684;softlink&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x9012;&#x5F52;&#x62F7;&#x8D1D;&#x7684;&#x65F6;&#x5019;&#x9ED8;&#x8BA4;&#x7684;&#x9009;&#x9879;&#x3002;<br><code>-v</code> - &#x4E0E;<code>-R</code>&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x6253;&#x5370;&#x51FA;&#x6240;&#x6709;&#x88AB;&#x62F7;&#x8D1D;&#x7684;&#x6587;&#x4EF6;&#x3002;<br><code>-p</code> - &#x5C06;&#x4FDD;&#x62A4;&#x539F;&#x59CB;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#x3001;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;&#x3001;flie flag&#xFF0C;&#x6587;&#x4EF6;&#x6A21;&#x5F0F;&#x7B49;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="&#x5177;&#x4F53;&#x573A;&#x666F;"><a href="#&#x5177;&#x4F53;&#x573A;&#x666F;" class="headerlink" title="&#x5177;&#x4F53;&#x573A;&#x666F;"></a>&#x5177;&#x4F53;&#x573A;&#x666F;</h2><p><strong>&#x62F7;&#x8D1D;&#x5355;&#x4E2A;&#x6587;&#x4EF6;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cp file1.txt ../file2.txt</span><br></pre></td></tr></table></figure>
<p><strong>&#x62F7;&#x8D1D;&#x591A;&#x4E2A;&#x6587;&#x4EF6;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cp file1.txt file2.cpp file3.cs test/src</span><br></pre></td></tr></table></figure>
<p><strong>&#x62F7;&#x8D1D;&#x7B26;&#x5408;&#x67D0;&#x4E2A;&#x6587;&#x4EF6;&#x540D;&#x89C4;&#x5219;&#x7684;&#x6587;&#x4EF6;</strong></p>
<p>cp&#x652F;&#x6301;&#x7B80;&#x5355;&#x7684;&#x901A;&#x914D;&#x7B26;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cp *.zip package</span><br></pre></td></tr></table></figure>
<p><strong>&#x62F7;&#x8D1D;&#x6574;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5305;&#x62EC;&#x5B50;&#x76EE;&#x5F55;&#xFF0C;&#x5E76;&#x7EF4;&#x6301;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#x4E0D;&#x53D8;</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cp -RpH dir1 dir2/src</span><br></pre></td></tr></table></figure>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程工具/">编程工具</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/shell/">shell</a><a href="/tags/mac/">mac</a><a href="/tags/terminal/">terminal</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/05/25/learning-shell-in-mac-cp/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/24/learning-shell-in-mac-ls/" title="Mac 命令学习-每日一贴之ls" itemprop="url">Mac 命令学习-每日一贴之ls</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-24T12:53:30.000Z" itemprop="datePublished"> 发表于 2016-05-24</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="&#x57FA;&#x672C;&#x7528;&#x6CD5;"><a href="#&#x57FA;&#x672C;&#x7528;&#x6CD5;" class="headerlink" title="&#x57FA;&#x672C;&#x7528;&#x6CD5;"></a>&#x57FA;&#x672C;&#x7528;&#x6CD5;</h2><p><code>ls [-ABCFGHLOPRSTUW@abcdefghiklmnopqrstuwx1] [file ...]</code></p>
<p>ls &#x540E;&#x9762;&#x53EF;&#x4EE5;&#x8DDF;0~N&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x6700;&#x540E;&#x53EF;&#x4EE5;&#x8DDF;0~N&#x4E2A;&#x6587;&#x4EF6;&#x540D;&#x3002;</p>
<p>&#x6587;&#x4EF6;&#x540D;&#x652F;&#x6301;&#x901A;&#x914D;&#x7B26;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x641C;&#x7D22;&#x3002;&#x5982;&#x679C;&#x5339;&#x914D;&#x5230;&#x76EE;&#x5F55;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x5C06;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x5B50;&#x9879;&#x76EE;&#x4E00;&#x540C;&#x6253;&#x5370;&#x51FA;&#x6765;&#x3002;</p>
<h2 id="&#x76F8;&#x5173;&#x6982;&#x5FF5;"><a href="#&#x76F8;&#x5173;&#x6982;&#x5FF5;" class="headerlink" title="&#x76F8;&#x5173;&#x6982;&#x5FF5;"></a>&#x76F8;&#x5173;&#x6982;&#x5FF5;</h2><h3 id="&#x901A;&#x914D;&#x7B26;&#x89C4;&#x5219;"><a href="#&#x901A;&#x914D;&#x7B26;&#x89C4;&#x5219;" class="headerlink" title="&#x901A;&#x914D;&#x7B26;&#x89C4;&#x5219;"></a>&#x901A;&#x914D;&#x7B26;&#x89C4;&#x5219;</h3><p><strong>* &#xFF08;&#x661F;&#x53F7;&#x901A;&#x914D;&#x7B26;&#xFF09;</strong></p>
<p>&#x5339;&#x914D;0~N&#x4E2A;&#x4EFB;&#x610F;&#x5B57;&#x7B26;&#x3002;</p>
<p> <strong>?&#xFF08;&#x95EE;&#x53F7;&#x901A;&#x914D;&#x7B26;&#xFF09;</strong></p>
<p>&#x5339;&#x914D;1&#x4E2A;&#x4EFB;&#x610F;unicode&#x5B57;&#x7B26;&#x3002;</p>
<p><strong>[] &#xFF08;&#x65B9;&#x62EC;&#x53F7;&#x901A;&#x914D;&#x7B26;&#xFF09;</strong></p>
<p>&#x5339;&#x914D;1&#x4E2A;&#x65B9;&#x62EC;&#x53F7;&#x5185;&#x4EFB;&#x610F;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;</p>
<h2 id="&#x5E38;&#x7528;&#x529F;&#x80FD;"><a href="#&#x5E38;&#x7528;&#x529F;&#x80FD;" class="headerlink" title="&#x5E38;&#x7528;&#x529F;&#x80FD;"></a>&#x5E38;&#x7528;&#x529F;&#x80FD;</h2><p><code>-A</code> - &#x5217;&#x51FA;&#x76EE;&#x5F55;&#x4E0B;&#x9664;&#x4E86;<code>.</code>&#x548C;<code>..</code>&#x4EE5;&#x5916;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x3002;<br><code>-a</code> - &#x5217;&#x51FA;&#x76EE;&#x5F55;&#x4E0B;&#x6240;&#x6709;&#x6587;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;&#x76EE;&#x5F55;&#x4EE5;<code>.</code>&#x5F00;&#x5934;&#x7684;&#x6587;&#x4EF6;&#x3002;<br><code>-d</code> - &#x4EC5;&#x6253;&#x5370;&#x51FA;&#x76EE;&#x5F55;&#x540D;&#x5B57;&#xFF0C;&#x4E0D;&#x53BB;&#x6253;&#x5370;&#x5185;&#x90E8;&#x7684;&#x6587;&#x4EF6;&#x3002;<br><code>-l</code> - &#x6253;&#x5370;&#x957F;&#x683C;&#x5F0F;&#xFF0C;&#x5305;&#x542B;<br><code>-G</code> - &#x5F69;&#x8272;&#x8F93;&#x51FA;&#x3002;<br><code>-p</code> - &#x5982;&#x679C;&#x4E3A;&#x76EE;&#x5F55;&#xFF0C;&#x5728;&#x663E;&#x793A;&#x540D;&#x79F0;&#x540E;&#x9762;&#x6253;&#x5370;&#x4E00;&#x4E2A;&#x2019;/&#x2018;<br><code>-r</code> - &#x6839;&#x636E;&#x76EE;&#x524D;&#x8F93;&#x51FA;&#x9ED8;&#x8BA4;&#x7684;&#x6392;&#x5E8F;&#x9006;&#x5E8F;&#x3002;<br><code>-O</code> - &#x6253;&#x5370;&#x51FA;File Flag</p>
<p><strong>&#x957F;&#x683C;&#x5F0F;</strong></p>
<pre><code>I            II  III      IV       V  VI           VII
drwxr-xr-x   9   zhengyi  group   306 May 24 08:24 .
drwxr-xr-x  42   zhengyi  group  1428 May 23 23:20 ..
-rw-r--r--@  1   zhengyi  group  6148 May 24 08:24 .DS_Store
-rwxr-xr-x   1   zhengyi  group  2723 May 24 08:20 build.sh
-rw-r--r--   1   zhengyi  group   883 May 24 08:19 db.json
-rw-r--r--   1   zhengyi  group  2281 May 24 08:20 gen.py
drwxr-xr-x   2   zhengyi  group    68 May 24 08:18 lib
drwxr-xr-x   7   zhengyi  group   238 May 24 08:25 src
drwxr-xr-x   4   zhengyi  group   136 May 24 08:18 tests
</code></pre><p>I&#xFF1A;&#x6587;&#x4EF6;&#x6743;&#x9650;&#x4FE1;&#x606F;&#xFF0C;&#x8BE6;&#x89C1;&#x4E0B;&#x56FE;&#x3002;&#x5982;&#x679C;&#x6709;<code>@</code>&#x7B26;&#x53F7;&#xFF0C;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x6709;&#x4E00;&#x4E9B;&#x62D3;&#x5C55;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;<code>-@</code>&#x53C2;&#x6570;&#x67E5;&#x9605;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;xattr&#x5DE5;&#x5177;&#x6765;&#x67E5;&#x770B;&#x5177;&#x4F53;&#x4FE1;&#x606F;<sup>[1]</sup>&#x3002;<br>II&#xFF1A;&#x94FE;&#x63A5;&#x8BA1;&#x6570;&#xFF08;link count&#xFF09;&#xFF0C;&#x5305;&#x62EC;<em>hard links</em>&#xFF0C;<em>symbolic links</em>&#xFF0C;&#x8FD8;&#x6709;&#x76EE;&#x5F55;&#x5F15;&#x7528;&#x3002;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684;<code>.</code>&#x4F1A;&#x5F15;&#x7528;&#x81EA;&#x5DF1;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x7684;&#x6240;&#x6709;&#x7684;&#x5B50;&#x76EE;&#x5F55;&#x90FD;&#x4F1A;&#x6301;&#x6709;&#x4E00;&#x4E2A;<code>..</code>&#x6307;&#x5411;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x3002;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x4E86;&#x76EE;&#x5F55;&#x7684;&#x94FE;&#x63A5;&#x8BA1;&#x6570;&#x5F80;&#x5F80;&#x6BD4;&#x8F83;&#x5927;&#x3002;<br>III&#xFF1A;owner name<br>IV&#xFF1A;owner group<br>V&#xFF1A;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x5B57;&#x8282;<br>VI&#xFF1A;&#x6700;&#x540E;&#x4FEE;&#x6539;&#x65E5;&#x671F;<br>VII&#xFF1A;&#x6587;&#x4EF6;&#x540D;</p>
<p>Access right in the first column<br><img src="http://linuxcommand.org/images/permissions_diagram.gif" alt=""><sup>[2]</sup></p>
<h2 id="&#x5177;&#x4F53;&#x6848;&#x4F8B;"><a href="#&#x5177;&#x4F53;&#x6848;&#x4F8B;" class="headerlink" title="&#x5177;&#x4F53;&#x6848;&#x4F8B;"></a>&#x5177;&#x4F53;&#x6848;&#x4F8B;</h2><p><strong>&#x8BBE;&#x7F6E;&#x9ED8;&#x8BA4;&#x7684;&#x522B;&#x540D;&#xFF08;alias&#xFF09;</strong></p>
<p>&#x4E2A;&#x4EBA;&#x559C;&#x597D;&#x5C06;&#x8F93;&#x51FA;&#x641E;&#x7684;&#x5F69;&#x8272;&#x4E00;&#x70B9;&#xFF0C;&#x6BD4;&#x8F83;&#x660E;&#x663E;&#x80FD;&#x770B;&#x51FA;&#x6587;&#x4EF6;&#x7684;&#x7C7B;&#x522B;</p>
<p><code>alias ls=&apos;ls -G&apos;</code></p>
<p><strong>&#x5217;&#x51FA;&#x6587;&#x4EF6;&#x5939;&#x4E0B;&#x6240;&#x6709;&#x7684;&#x5B50;&#x6587;&#x4EF6;&#x5939;</strong></p>
<p><code>ls -d */</code></p>
<p><strong>&#x6309;&#x7167;&#x6700;&#x540E;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#x6392;&#x5E8F;</strong></p>
<p><code>ls -l -t -T (&#x65B0;&#x4FEE;&#x6539;&#x7684;&#x5728;&#x524D;)</code><br><code>ls -l -t -T -r&#xFF08;&#x8001;&#x4FEE;&#x6539;&#x7684;&#x5728;&#x524D;&#xFF09;</code></p>
<p><strong>&#x6839;&#x636E;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x6392;&#x5E8F;</strong></p>
<p><code>ls -l -S &#xFF08;&#x4ECE;&#x5927;&#x5230;&#x5C0F;&#xFF09;</code></p>
<h2 id="&#x53C2;&#x8003;&#x8D44;&#x6599;"><a href="#&#x53C2;&#x8003;&#x8D44;&#x6599;" class="headerlink" title="&#x53C2;&#x8003;&#x8D44;&#x6599;"></a>&#x53C2;&#x8003;&#x8D44;&#x6599;</h2><p>[1]&#xFF1A;<a href="http://mackuba.eu/2008/06/30/ls-on-mac-and-extended-file-attributes/" target="_blank" rel="external">&#x201C;ls&#x201D; on Mac and extended file attributes</a><br>[2]&#xFF1A;<a href="http://linuxcommand.org/images/permissions_diagram.gif" target="_blank" rel="external">http://linuxcommand.org/images/permissions_diagram.gif</a><br><a href="http://www.linfo.org/wildcard.html" target="_blank" rel="external">http://www.linfo.org/wildcard.html</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程工具/">编程工具</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/shell/">shell</a><a href="/tags/mac/">mac</a><a href="/tags/terminal/">terminal</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/05/24/learning-shell-in-mac-ls/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/23/learning-shell-in-mac/" title="Mac/Linux 命令学习" itemprop="url">Mac/Linux 命令学习</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-23T14:53:35.000Z" itemprop="datePublished"> 发表于 2016-05-23</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="&#x5E72;&#x561B;&#x8981;&#x5B66;&#x547D;&#x4EE4;"><a href="#&#x5E72;&#x561B;&#x8981;&#x5B66;&#x547D;&#x4EE4;" class="headerlink" title="&#x5E72;&#x561B;&#x8981;&#x5B66;&#x547D;&#x4EE4;"></a>&#x5E72;&#x561B;&#x8981;&#x5B66;&#x547D;&#x4EE4;</h2><p>&#x5207;&#x6362;&#x5230;mac&#x4E0B;&#x5DE5;&#x4F5C;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x96BE;&#x514D;&#x8981;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x505A;&#x4E00;&#x4E0B;&#x64CD;&#x4F5C;&#xFF0C;&#x76EE;&#x524D;&#x638C;&#x63E1;&#x7684;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x6709;&#x65F6;&#x5DF2;&#x7ECF;&#x96BE;&#x4EE5;&#x9A7E;&#x9A6D;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x64CD;&#x4F5C;&#x4E86;&#x3002;&#x6709;&#x5FC5;&#x8981;&#x7CFB;&#x7EDF;&#x5F97;&#x8FC7;&#x4E00;&#x904D;&#x4E3B;&#x8981;&#x7684;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x88C5;&#x903C;&#x610F;&#x5916;&#xFF0C;&#x547D;&#x4EE4;&#x884C;&#x8FD8;&#x5728;&#x6709;&#x5F88;&#x591A;&#x597D;&#x5904;&#xFF1A;</p>
<ol>
<li>&#x6253;&#x5B57;&#x7684;&#x901F;&#x5EA6;&#x548C;&#x51C6;&#x786E;&#x6027;&#x8FDC;&#x8FDC;&#x9AD8;&#x4E8E;&#x9F20;&#x6807;&#xFF0C;&#x9891;&#x7E41;&#x7684;&#x5207;&#x6362;&#x9F20;&#x6807;&#x548C;&#x952E;&#x76D8;&#x662F;&#x4E00;&#x4EF6;&#x633A;&#x9EBB;&#x70E6;&#x7684;&#x4E8B;&#x60C5;&#x3002;</li>
<li>&#x547D;&#x4EE4;&#x884C;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x811A;&#x672C;&#x81EA;&#x52A8;&#x5316;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x61D2;&#x4EBA;&#x7684;&#x798F;&#x97F3;&#x3002;</li>
<li>&#x5728;&#x4E00;&#x4E9B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x3002;</li>
</ol>
<h2 id="&#x5982;&#x4F55;&#x5B66;&#x547D;&#x4EE4;"><a href="#&#x5982;&#x4F55;&#x5B66;&#x547D;&#x4EE4;" class="headerlink" title="&#x5982;&#x4F55;&#x5B66;&#x547D;&#x4EE4;"></a>&#x5982;&#x4F55;&#x5B66;&#x547D;&#x4EE4;</h2><p>Learning by doing &#x662F;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x8FD9;&#x79CD;&#x5B9E;&#x7528;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x52A8;&#x52A8;&#x624B;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x884C;&#x7684;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5B66;&#x4E60;&#x547D;&#x4EE4;&#x884C;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x901A;&#x8BFB;&#x4E00;&#x904D;man&#xFF0C;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x80FD;&#x591F;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5373;&#x4F7F;&#x8BB0;&#x4E0D;&#x4F4F;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x81F3;&#x5C11;&#x77E5;&#x9053;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x7B49;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x518D;&#x770B;&#x5177;&#x4F53;&#x7684;&#x7EC6;&#x8282;&#x4E5F;&#x4E0D;&#x8FDF;&#x3002;&#x7EC8;&#x7AEF;&#x4E0B;&#x7684;man&#x4E0D;&#x65B9;&#x4FBF;&#x9605;&#x8BFB;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Dash&#x7B49;&#x5DE5;&#x5177;&#x6765;&#x9605;&#x8BFB;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x5E73;&#x65F6;&#x53EF;&#x80FD;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x6572;&#x4E00;&#x904D;&#x770B;&#x770B;&#x6548;&#x679C;&#x3002;</li>
<li>&#x8BBE;&#x60F3;&#x51E0;&#x4E2A;&#x53EF;&#x80FD;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528;&#x547D;&#x4EE4;&#x6765;&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x3002;&#x4EE5;&#x540E;&#x78B0;&#x5230;&#x8FD9;&#x51E0;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x67E5;&#x9605;&#x56DE;&#x5FC6;&#x3002;</li>
</ol>
<p>&#x7B2C;&#x4E09;&#x70B9;&#x5176;&#x5B9E;&#x662F;&#x501F;&#x9274;&#x4E86;<a href="https://github.com/tldr-pages/tldr" target="_blank" rel="external">tldr</a>&#xFF08;too long don&#x2019;t read&#xFF09;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6210;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7248;&#x7684;man&#x3002;</p>
<p>Mac 10.3+ &#x7CFB;&#x7EDF;&#x4E0B;&#x9ED8;&#x8BA4;&#x7684;shell&#x662F;bash<sup>[1]</sup>&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x547D;&#x4EE4;&#x7684;&#x6548;&#x679C;&#x548C;linux&#x4E0B;&#x9762;&#x76F8;&#x540C;&#xFF0C;&#x67D0;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;&#x7684;&#x5177;&#x4F53;&#x53C2;&#x6570;&#x548C;&#x884C;&#x4E3A;&#x6709;&#x6240;&#x5DEE;&#x5F02;&#x3002;</p>
<h2 id="&#x5C0F;&#x6280;&#x5DE7;"><a href="#&#x5C0F;&#x6280;&#x5DE7;" class="headerlink" title="&#x5C0F;&#x6280;&#x5DE7;"></a>&#x5C0F;&#x6280;&#x5DE7;</h2><h2 id="&#x6BCF;&#x65E5;&#x4E00;&#x8D34;"><a href="#&#x6BCF;&#x65E5;&#x4E00;&#x8D34;" class="headerlink" title="&#x6BCF;&#x65E5;&#x4E00;&#x8D34;"></a>&#x6BCF;&#x65E5;&#x4E00;&#x8D34;</h2><h3 id="&#x76EE;&#x5F55;&#x64CD;&#x4F5C;"><a href="#&#x76EE;&#x5F55;&#x64CD;&#x4F5C;" class="headerlink" title="&#x76EE;&#x5F55;&#x64CD;&#x4F5C;"></a>&#x76EE;&#x5F55;&#x64CD;&#x4F5C;</h3><ul>
<li><a href="/2016/05/24/learning-shell-in-mac-ls/" title="ls">ls</a>  - <em>2016&#x5E74;5&#x6708;24&#x53F7;</em></li>
<li><a href="/2016/06/02/learning-shell-cd-pwd-pushd-popd/" title="cat,pushd,popd">cat,pushd,popd</a> - <em>2016&#x5E74;6&#x6708;2&#x53F7;</em></li>
</ul>
<h3 id="&#x6587;&#x4EF6;&#x64CD;&#x4F5C;"><a href="#&#x6587;&#x4EF6;&#x64CD;&#x4F5C;" class="headerlink" title="&#x6587;&#x4EF6;&#x64CD;&#x4F5C;"></a>&#x6587;&#x4EF6;&#x64CD;&#x4F5C;</h3><ul>
<li><a href="/2016/05/25/learning-shell-in-mac-cp/" title="cp">cp</a>  - <em>2016&#x5E74;5&#x6708;25&#x53F7;</em></li>
<li><a href="/2016/05/24/learning-shell-in-mac-ls/" title="cat">cat</a>  - <em>2016&#x5E74;5&#x6708;30&#x53F7;</em></li>
<li><a href="/2016/06/02/learning-shell-chflags/" title="chflags">chflags</a> - <em>2016&#x5E74;6&#x6708;2&#x53F7;</em></li>
<li>ln</li>
<li>rm</li>
</ul>
<h3 id="&#x6587;&#x672C;&#x64CD;&#x4F5C;&#x8FC7;&#x6EE4;&#x5668;"><a href="#&#x6587;&#x672C;&#x64CD;&#x4F5C;-&#x8FC7;&#x6EE4;&#x5668;" class="headerlink" title="&#x6587;&#x672C;&#x64CD;&#x4F5C;/&#x8FC7;&#x6EE4;&#x5668;"></a>&#x6587;&#x672C;&#x64CD;&#x4F5C;/&#x8FC7;&#x6EE4;&#x5668;</h3><ul>
<li>sort</li>
<li>uniq</li>
<li>grep</li>
<li>fmt</li>
<li>pr</li>
<li>head</li>
<li>tail</li>
<li>tr</li>
<li>sed</li>
<li>awk</li>
</ul>
<h3 id="&#x8C03;&#x8BD5;"><a href="#&#x8C03;&#x8BD5;" class="headerlink" title="&#x8C03;&#x8BD5;"></a>&#x8C03;&#x8BD5;</h3><ul>
<li>dtruss</li>
</ul>
<h3 id="&#x76F8;&#x5173;&#x6982;&#x5FF5;"><a href="#&#x76F8;&#x5173;&#x6982;&#x5FF5;" class="headerlink" title="&#x76F8;&#x5173;&#x6982;&#x5FF5;"></a>&#x76F8;&#x5173;&#x6982;&#x5FF5;</h3><ul>
<li>&#x8F6F;&#x94FE;&#x63A5; vs &#x786C;&#x94FE;&#x63A5;</li>
<li>File flag</li>
<li><a href="/2016/05/31/unix-standard-input-output-redirection/" title="&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x91CD;&#x5B9A;&#x5411;&#xFF08;Redirection&#xFF09;">&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x91CD;&#x5B9A;&#x5411;&#xFF08;Redirection&#xFF09;</a> 
</li>
</ul>
<h2 id="&#x53C2;&#x8003;&#x8D44;&#x6599;"><a href="#&#x53C2;&#x8003;&#x8D44;&#x6599;" class="headerlink" title="&#x53C2;&#x8003;&#x8D44;&#x6599;"></a>&#x53C2;&#x8003;&#x8D44;&#x6599;</h2><p>[1]: <a href="http://stackoverflow.com/questions/8051145/what-are-the-differences-between-using-the-terminal-on-a-mac-vs-linux" target="_blank" rel="external">What are the differences between using the terminal on a mac vs linux?</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/编程工具/">编程工具</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/shell/">shell</a><a href="/tags/mac/">mac</a><a href="/tags/terminal/">terminal</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/05/23/learning-shell-in-mac/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/14/some-thought-about-reading/" title="读书方法的一些思考" itemprop="url">读书方法的一些思考</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-14T13:07:04.000Z" itemprop="datePublished"> 发表于 2016-05-14</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="&#x5F15;&#x5B50;"><a href="#&#x5F15;&#x5B50;" class="headerlink" title="&#x5F15;&#x5B50;"></a>&#x5F15;&#x5B50;</h2><p>&#x4ECA;&#x5929;&#x8BFB;&#x5B8C;&#x4E86;&#x300A;&#x7CBE;&#x8FDB;&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x5728;&#x8BFB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x786E;&#x5B9E;&#x9886;&#x609F;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x4F5C;&#x8005;&#x60F3;&#x8981;&#x8868;&#x8FBE;&#x7684;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#x3002;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x4E5F;&#x5B66;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x918D;&#x9190;&#x704C;&#x9876;&#x7684;&#x65F6;&#x523B;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x5408;&#x4E0A;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x95EE;&#x81EA;&#x5DF1;&#x8FD9;&#x672C;&#x4E66;&#x8BB2;&#x4E86;&#x4EC0;&#x4E48;&#x4E3B;&#x8981;&#x7684;&#x89C2;&#x70B9;&#xFF1F;&#x6211;&#x7ADF;&#x56DE;&#x60F3;&#x4E0D;&#x8D77;&#x591A;&#x5C11;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x6709;&#x79CD;&#x6781;&#x5EA6;&#x6050;&#x60E7;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x56E0;&#x4E3A;&#x81EA;&#x4EE5;&#x4E3A;&#x82B1;&#x4E86;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x8BA4;&#x771F;&#x9605;&#x8BFB;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x5728;&#x8BFB;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x7B14;&#x8BB0;&#xFF0C;&#x5E76;&#x628A;&#x8BFB;&#x4E66;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x8BB0;&#x5F55;&#x4E86;&#x4E0B;&#x6765;&#x3002;&#x4F46;&#x662F;&#x8BFB;&#x5B8C;&#x5374;&#x53D1;&#x73B0;&#x6240;&#x8BB0;&#x4F4F;&#x7684;&#x4E1C;&#x897F;&#x751A;&#x5C11;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x751A;&#x5C11;&#x3002;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x5728;&#x5927;&#x8111;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x5F85;&#x7740;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x8FD9;&#x672C;&#x4E66;&#x4E0E;&#x5176;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x4ECE;&#x800C;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x614C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x53BB;&#x4E0A;&#x7F51;&#x8FDB;&#x884C;&#x4E86;&#x641C;&#x7D22;&#x4E86;&#x201C;&#x5982;&#x4F55;&#x8BFB;&#x4E66; &#x6709;&#x6548;&#x201D;&#xFF0C;&#x201C;&#x8BFB;&#x4E66; &#x5BB9;&#x6613;&#x5FD8;&#x201D;&#x3002;&#x5BF9;&#x4E8E;&#x641C;&#x7D22;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x53EA;&#x662F;&#x5306;&#x5306;&#x5730;&#x8FDB;&#x884C;&#x4E86;&#x9605;&#x8BFB;&#xFF0C;&#x5BC4;&#x5E0C;&#x671B;&#x4E8E;&#x80FD;&#x591F;&#x4ECE;&#x4E2D;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4E24;&#x4E2A;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x9605;&#x8BFB;&#x6548;&#x679C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x660E;&#x667A;&#x7684;&#xFF0C;&#x53BB;&#x641C;&#x7D22;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x9605;&#x8BFB;&#x4E00;&#x672C;&#x4E66;&#x7684;&#x8D44;&#x6599;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x89C9;&#x5F97;&#x614C;&#x5F20;&#x7684;&#x65F6;&#x5019;&#x522B;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#x5F80;&#x5F80;&#x4E0D;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x5730;&#x5E2E;&#x52A9;&#x5230;&#x4F60;&#x3002;&#x7279;&#x522B;&#x662F;&#x4F60;&#x62B1;&#x7740;&#x4E00;&#x4E2A;&#x5F88;&#x529F;&#x5229;&#x7684;&#x5FC3;&#x6001;&#x53BB;&#x8BD5;&#x56FE;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x7B80;&#x5355;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x4E0D;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="&#x53CD;&#x601D;"><a href="#&#x53CD;&#x601D;" class="headerlink" title="&#x53CD;&#x601D;"></a>&#x53CD;&#x601D;</h2><p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x5C31;&#x662F;&#x60F3;&#x73B0;&#x5728;&#x8FD9;&#x6837;&#xFF0C;&#x5B89;&#x9759;&#x7684;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x3002;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x9605;&#x8BFB;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x81EA;&#x5DF1;&#x5176;&#x5B9E;&#x662F;&#x6700;&#x6E05;&#x695A;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x81EA;&#x5DF1;&#x7684;&#x9605;&#x8BFB;&#x884C;&#x4E3A;&#x6765;&#x627E;&#x51FA;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5373;&#x4F7F;&#x627E;&#x4E0D;&#x5230;&#x4E5F;&#x53EF;&#x4EE5;&#x60F3;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x65B9;&#x6848;&#x53BB;&#x505A;&#x3002;&#x80FD;&#x591F;&#x60F3;&#x5230;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x89D2;&#x5EA6;&#x4E0A;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x9605;&#x8BFB;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F5C;&#x8005;&#x7684;&#x67D0;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#x867D;&#x4E0D;&#x80FD;&#x591F;&#x5B8C;&#x5168;&#x7684;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x4E5F;&#x5DF2;&#x7ECF;&#x5BF9;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x4EA7;&#x751F;&#x4E86;&#x5F71;&#x54CD;&#x3002;&#x4E5F;&#x8BB8;&#x5373;&#x4F7F;&#x4F60;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x8FD9;&#x672C;&#x4E66;&#x8BB2;&#x4E86;&#x54EA;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x5DF2;&#x7ECF;&#x5C06;&#x8FD9;&#x4E9B;&#x89C2;&#x70B9;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x8BB0;&#x4F4F;&#x4E86;&#xFF0C;&#x5728;&#x5C06;&#x6765;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x78B0;&#x5230;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x5173;&#x952E;&#x5C31;&#x4ECE;&#x5982;&#x4F55;&#x5728;&#x9605;&#x8BFB;&#x5B8C;&#x4E00;&#x672C;&#x4E66;&#x4EE5;&#x540E;&#x60F3;&#x8D77;&#x6765;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x5982;&#x4F55;&#x5C06;&#x4F5C;&#x8005;&#x7684;&#x89C2;&#x70B9;&#x8F6C;&#x5316;&#x6210;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x90A3;&#x4E48;&#x9605;&#x8BFB;&#x4E2D;&#x7684;&#x601D;&#x8003;&#x5C31;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x7684;&#x5173;&#x952E;&#xFF0C;&#x6709;&#x601D;&#x8003;&#x624D;&#x80FD;&#x5C06;&#x81EA;&#x5DF1;&#x5DF2;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x4E0E;&#x5176;&#x53D1;&#x751F;&#x8054;&#x7CFB;&#x3002;</p>
<h3 id="&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;"><a href="#&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;" class="headerlink" title="&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;"></a>&#x9605;&#x8BFB;&#x7684;&#x65B9;&#x6CD5;</h3><p>&#x6211;&#x89C9;&#x5F97;&#x9605;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x7684;&#x9605;&#x8BFB;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<ol>
<li>&#x521D;&#x6B21;&#x9605;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6700;&#x597D;&#x5E26;&#x6709;&#x76EE;&#x7684;&#x6027;&#x7684;&#x53BB;&#x9605;&#x8BFB;&#x3002;&#x5373;&#x5E0C;&#x671B;&#x4ECE;&#x4E66;&#x4E2D;&#x83B7;&#x5F97;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;&#xFF0C;&#x5E0C;&#x671B;&#x4F5C;&#x8005;&#x5E2E;&#x52A9;&#x4F60;&#x89E3;&#x51B3;&#x90A3;&#x4E9B;&#x56F0;&#x60D1;&#x3002;&#x5E26;&#x7740;&#x7591;&#x95EE;&#x53BB;&#x8BFB;&#x4F1A;&#x8BA9;&#x4F60;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x628A;&#x8BFB;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x5DF2;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x8054;&#x7CFB;&#x3002;</li>
<li>&#x5E8F;&#x548C;&#x524D;&#x8A00;&#x6700;&#x597D;&#x8981;&#x8BFB;&#xFF0C;&#x63A5;&#x7740;&#x5C31;&#x662F;&#x76EE;&#x5F55;&#x3002;&#x8981;&#x5728;&#x8BFB;&#x4E4B;&#x524D;&#x5BF9;&#x4E8E;&#x7AE0;&#x8282;&#x7684;&#x7ED3;&#x6784;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</li>
<li>&#x9605;&#x8BFB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x8981;&#x8FC7;&#x591A;&#x7684;&#x8FDB;&#x884C;&#x6807;&#x6CE8;&#x91CD;&#x70B9;&#xFF0C;&#x9002;&#x5F53;&#x7684;&#x5728;&#x8BFB;&#x5230;&#x6709;&#x611F;&#x609F;&#x7684;&#x65F6;&#x5019;&#x5728;&#x4E66;&#x4E0A;&#x505A;&#x7B14;&#x8BB0;&#x3002;&#x9605;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#x5907;&#x597D;&#x7EB8;&#x7B14;&#xFF0C;&#x5F53;&#x6709;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x4ECE;&#x5927;&#x8111;&#x4E2D;&#x8FF8;&#x53D1;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53CA;&#x65F6;&#x7684;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x56DE;&#x53BB;&#x7EE7;&#x7EED;&#x9605;&#x8BFB;&#x3002;</li>
<li>&#x8BFB;&#x7684;&#x65F6;&#x5019;&#x5982;&#x679C;&#x8D70;&#x795E;&#x7684;&#x8BDD;&#x9A6C;&#x4E0A;&#x505C;&#x6B62;&#x9605;&#x8BFB;&#xFF0C;&#x8D70;&#x795E;&#x7684;&#x9605;&#x8BFB;&#x7EAF;&#x5C5E;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x9891;&#x7E41;&#x7684;&#x5BF9;&#x81EA;&#x5DF1;&#x8BFB;&#x5230;&#x7684;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x6BCF;&#x8282;&#x3001;&#x6BCF;&#x7AE0;&#x4E4B;&#x540E;&#xFF0C;&#x60F3;&#x60F3;&#x4F5C;&#x8005;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F5C;&#x8005;&#x524D;&#x540E;&#x6587;&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x3002;</li>
<li>&#x6709;&#x6761;&#x4EF6;&#x7684;&#x8BDD;&#xFF0C;&#x5728;&#x9605;&#x8BFB;&#x5B8C;&#x4E00;&#x7AE0;&#x4EE5;&#x540E;&#x5728;&#x8131;&#x79BB;&#x4E66;&#x672C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x8FD9;&#x4E00;&#x7AE0;&#x8BB2;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x77E5;&#x8BC6;&#x70B9;&#x4EE5;&#x53CA;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x3002;&#x53EF;&#x4EE5;&#x753B;&#x56FE;&#x3001;&#x5199;&#x5B57;&#x3001;&#x5F62;&#x5F0F;&#x4E0D;&#x9650;&#x3002;</li>
<li>&#x5982;&#x679C;&#x559C;&#x6B22;&#x53EF;&#x4EE5;&#x8DF3;&#x7740;&#x8BFB;&#x3002;</li>
<li>&#x8BFB;&#x5B8C;&#x5168;&#x672C;&#xFF0C;&#x5408;&#x4E0A;&#x4E66;&#x672C;&#xFF0C;&#x6781;&#x529B;&#x56DE;&#x60F3;&#x3002;&#x7136;&#x540E;&#x53BB;&#x91CD;&#x65B0;&#x7FFB;&#x4E00;&#x4E0B;&#x4E66;&#x672C;/&#x6BCF;&#x7AE0;&#x505A;&#x7684;&#x7B14;&#x8BB0;&#xFF0C;&#x505A;&#x4E00;&#x4E0B;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#x5FEB;&#x901F;&#x91CD;&#x8BFB;&#x4E00;&#x904D;&#xFF0C;&#x5728;&#x89C9;&#x5F97;&#x91CD;&#x8981;&#x7684;&#x7AE0;&#x8282;&#x8FDB;&#x884C;&#x6DF1;&#x5EA6;&#x9605;&#x8BFB;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x91CD;&#x8BFB;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x5728;&#x8BFB;&#x5B8C;&#x4E00;&#x904D;&#x4E4B;&#x540E;&#x9A6C;&#x4E0A;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x9694;&#x4E0A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x518D;&#x8FDB;&#x884C;&#x3002;&#x8FD9;&#x4F1A;&#x6709;&#x66F4;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</li>
<li>&#x91CD;&#x590D;5~10&#x3002;</li>
</ol>
<h3 id="&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;"><a href="#&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;" class="headerlink" title="&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;"></a>&#x9605;&#x8BFB;&#x7684;&#x4F5C;&#x7528;</h3><p>&#x987A;&#x4FBF;&#x7406;&#x4E00;&#x7406;&#x4E0B;&#x5173;&#x4E8E;&#x9605;&#x8BFB;&#x4F5C;&#x7528;&#x7684;&#x60F3;&#x6CD5;</p>
<ol>
<li>&#x7EAF;&#x5C5E;&#x5A31;&#x4E50;&#x3002;</li>
<li>&#x5E0C;&#x671B;&#x4F5C;&#x8005;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x67D0;&#x4E2A;&#x7591;&#x95EE;&#x3001;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x5E0C;&#x671B;&#x4ECE;&#x4E66;&#x4E2D;&#x6C72;&#x53D6;&#x67D0;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x77E5;&#x8BC6;&#x3002;</li>
<li>&#x5728;&#x9605;&#x8BFB;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x8FDB;&#x800C;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x60F3;&#x6CD5;&#x3001;&#x7591;&#x95EE;&#x7B49;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5230;&#x66F4;&#x591A;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x4E16;&#x754C;&#x548C;&#x53EF;&#x80FD;&#x6027;&#x3002;</li>
</ol>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/阅读相关/">阅读相关</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/阅读/">阅读</a><a href="/tags/思考/">思考</a>
  </div>

</div>




<div class="comments-count">
	
	  	<span></span>
		<a href="/2016/05/14/some-thought-about-reading/#disqus_thread" class="comments-count-link">Comments</a>
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="page-number current">2</span><a class="page-number" href="/page/3/">3</a><a class="extend next" rel="next" href="/page/3/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>8</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/linux/" title="linux">linux<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/操作系统/" title="操作系统">操作系统<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
