
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>“知行合一” | yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="&amp;#x77E5;&amp;#x8BC6;&amp;#x5BF9;&amp;#x4E8E;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x6709;&amp;#x4E09;&amp;#x79CD;&amp;#x72B6;&amp;#x6001;&amp;#xFF0C;&amp;#x4E0D;&amp;#x77E5;&amp;#x9053;&amp;#x7684;&amp;#xFF0C;&amp;#x77E5;&amp;#x9053;&amp;#x7684;&amp;#xFF0C;&amp;#x505A;&amp;#x5230;&amp;#x7684;">
<meta property="og:type" content="article">
<meta property="og:title" content="“知行合一”">
<meta property="og:url" content="http://zhengyi.me/2016/05/27/unity-of-knowlede-and-action/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="&amp;#x77E5;&amp;#x8BC6;&amp;#x5BF9;&amp;#x4E8E;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x6709;&amp;#x4E09;&amp;#x79CD;&amp;#x72B6;&amp;#x6001;&amp;#xFF0C;&amp;#x4E0D;&amp;#x77E5;&amp;#x9053;&amp;#x7684;&amp;#xFF0C;&amp;#x77E5;&amp;#x9053;&amp;#x7684;&amp;#xFF0C;&amp;#x505A;&amp;#x5230;&amp;#x7684;">
<meta property="og:image" content="http://zhengyi.me/img/know_vs_action.png">
<meta property="og:updated_time" content="2016-05-28T13:47:27.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="“知行合一”">
<meta name="twitter:description" content="&amp;#x77E5;&amp;#x8BC6;&amp;#x5BF9;&amp;#x4E8E;&amp;#x4E00;&amp;#x4E2A;&amp;#x4EBA;&amp;#x6709;&amp;#x4E09;&amp;#x79CD;&amp;#x72B6;&amp;#x6001;&amp;#xFF0C;&amp;#x4E0D;&amp;#x77E5;&amp;#x9053;&amp;#x7684;&amp;#xFF0C;&amp;#x77E5;&amp;#x9053;&amp;#x7684;&amp;#xFF0C;&amp;#x505A;&amp;#x5230;&amp;#x7684;">
<meta name="twitter:image" content="http://zhengyi.me/img/know_vs_action.png">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/27/unity-of-knowlede-and-action/" title="“知行合一”" itemprop="url">“知行合一”</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-27T12:50:23.000Z" itemprop="datePublished"> 发表于 2016-05-27</time>
    
  </p>
</header>
	<div class="article-content">
		
		<p>&#x77E5;&#x8BC6;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4EBA;&#x6709;&#x4E09;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x505A;&#x5230;&#x7684;&#x3002;&#x672C;&#x6587;&#x4E0D;&#x8BA8;&#x8BBA;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="/img/know_vs_action.png" alt="&#x77E5;&#x884C;&#x5408;&#x4E00;"></p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x7684;&#x77E5;&#x8BC6;&#x505C;&#x7559;&#x5728;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F88;&#x591A;&#x9014;&#x5F84;&#x5B66;&#x4E60;&#x3001;&#x5438;&#x6536;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9A71;&#x52A8;&#x6211;&#x4EEC;&#x7684;&#x4E0D;&#x662F;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x662F;&#x4E60;&#x60EF;&#x548C;&#x6F5C;&#x610F;&#x8BC6;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x5B66;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#xFF0C;&#x4E00;&#x4E2A;&#x65B0;&#x624B;&#x901A;&#x8FC7;&#x770B;&#x89C6;&#x9891;&#x3001;&#x770B;&#x52A8;&#x4F5C;&#x8981;&#x9886;&#x7B49;&#x5B66;&#x4E60;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x8981;&#x9886;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x8DDF;&#x6253;&#x597D;&#x7FBD;&#x6BDB;&#x7403;&#x5176;&#x5B9E;&#x5E76;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x53EA;&#x80FD;&#x8BF4;&#x638C;&#x63E1;&#x4E86;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x53EF;&#x80FD;&#x80FD;&#x8BA9;&#x4F60;&#x5B66;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#xFF0C;&#x7B49;&#x4F60;&#x6700;&#x7EC8;&#x5B66;&#x4F1A;&#x4E86;&#x6253;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x8111;&#x5B50;&#x91CC;&#x60F3;&#x7684;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x52A8;&#x4F5C;&#x8981;&#x9886;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x52A8;&#x4F5C;&#x5DF2;&#x7ECF;&#x8F6C;&#x5316;&#x6210;&#x4F60;&#x8111;&#x5B50;&#x91CC;&#x7684;&#x4E00;&#x4E2A;memory chunk&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x4ECE;&#x4E66;&#x672C;&#x4E0A;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x5927;&#x9053;&#x7406;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x5F88;&#x591A;&#x52B1;&#x5FD7;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4F46;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4EC5;&#x4EC5;&#x53EA;&#x662F;&#x505C;&#x7559;&#x5728;&#x77E5;&#x9053;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x662F;&#x5E26;&#x7740;&#x4E00;&#x79CD;&#x60EF;&#x6027;&#x53BB;&#x505A;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x5728;&#x67D0;&#x4E00;&#x65B9;&#x9762;&#x5F88;&#x725B;&#x903C;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x5982;&#x679C;&#x95EE;&#x4ED6;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x725B;&#xFF1F;&#x4ED6;&#x53EF;&#x80FD;&#x4F1A;&#x8DDF;&#x4F60;&#x8BF4;&#x51FA;&#x5F88;&#x591A;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4F60;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x4E9B;&#x70B9;&#x4F60;&#x5C31;&#x80FD;&#x6210;&#x4E3A;&#x8DDF;&#x4ED6;&#x4E00;&#x6837;&#x7684;&#x4EBA;&#x3002;&#x4E00;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x89C9;&#x7684;&#x5F88;&#x725B;&#x903C;&#x4E8B;&#x60C5;&#xFF0C;&#x5728;&#x4ED6;&#x770B;&#x6765;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x4E00;&#x4EF6;&#x968F;&#x968F;&#x4FBF;&#x4FBF;&#x5C31;&#x80FD;&#x505A;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4ED6;&#x80CC;&#x540E;&#x5305;&#x542B;&#x7684;&#x662F;&#x4ED6;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x5F62;&#x6210;&#x7684;&#x60EF;&#x6027;&#x3002;&#x800C;&#x4ED6;&#x7ED9;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x70B9;&#x5F80;&#x5F80;&#x53EA;&#x662F;&#x4ED6;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x5B8C;&#x5168;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x91CD;&#x590D;&#x4ED6;&#x7684;&#x6210;&#x957F;&#x8F68;&#x8FF9;&#x3002;</p>
<p>&#x5F80;&#x5F80;&#x8D8A;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x4EBA;&#x7ED9;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x7EA6;&#x7CBE;&#x70BC;&#x3002;&#x5982;&#x679C;&#x4F60;&#x95EE;&#x4F60;&#x7684;manager&#x8BA9;&#x4ED6;&#x7ED9;&#x4F60;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x4F1A;&#x8DDF;&#x4F60;&#x8BF4;&#x4E00;&#x5806;&#x5982;&#x679C;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x505A;&#x597D;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x5DE7;&#x3002;&#x5982;&#x679C;&#x4F60;&#x95EE;&#x4F60;&#x4EEC;&#x516C;&#x53F8;&#x8001;&#x677F;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x4F1A;&#x8DDF;&#x4F60;&#x8BF4;&#x4E00;&#x4E9B;&#x4EBA;&#x751F;&#x5C0F;&#x5EFA;&#x8BAE;&#xFF0C;&#x800C;&#x4E0D;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x53BB;&#x95EE;&#x4E54;&#x5E03;&#x65AF;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x5C31;&#x8DDF;&#x4F60;&#x8BF4;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;Stay Hungry Stay Foolish&#x201D;&#x3002;</p>
<p>&#x4ECE;&#x77E5;&#x9053;&#x5230;&#x505A;&#x5230;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x9E3F;&#x6C9F;&#x7684;&#xFF0C;&#x800C;&#x4ECE;&#x505A;&#x5230;&#x5230;&#x77E5;&#x9053;&#x5F80;&#x5F80;&#x53EA;&#x6709;&#x54AB;&#x5C3A;&#x4E4B;&#x9065;&#x3002;</p>
<p>&#x90A3;&#x662F;&#x4E0D;&#x662F;&#x8BF4;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x5C31;&#x4E0D;&#x91CD;&#x8981;&#x5462;&#xFF1F;&#x5E76;&#x4E0D;&#x7136;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x7CFB;&#x7EDF;&#x662F;&#x9700;&#x8981;&#x77E5;&#x8BC6;&#x7CFB;&#x7EDF;&#x652F;&#x6491;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5176;&#x5B9E;&#x5F88;&#x5C11;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x628A;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7684;&#x5185;&#x5316;&#x6210;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x878D;&#x5165;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x5F53;&#x4E2D;&#x3002;&#x5C4A;&#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x7684;&#x6280;&#x5DE7;&#x77E5;&#x8BC6;&#x90FD;&#x5FD8;&#x4E86;&#xFF0C;&#x4F60;&#x4F9D;&#x7136;&#x53EF;&#x80FD;&#x968F;&#x65F6;&#x4ECE;&#x4F60;&#x7684;&#x5927;&#x8111;&#x6DF1;&#x5904;&#x53EC;&#x5524;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x501A;&#x5929;&#x5C60;&#x9F99;&#x8BB0;&#x91CC;&#x9762;&#x5F20;&#x4E09;&#x4E30;&#x6559;&#x5F20;&#x65E0;&#x5FCC;&#x592A;&#x6781;&#x5251;&#x6CD5;&#xFF0C;&#x6559;&#x5B8C;&#x95EE;&#x5176;&#x8BB0;&#x5F97;&#x4E48;&#xFF1F;&#x5F53;&#x5F20;&#x65E0;&#x5FCC;&#x8BF4;&#x5168;&#x5FD8;&#x4E86;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4ED6;&#x5168;&#x90E8;&#x878D;&#x4F1A;&#x8D2F;&#x901A;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x7EB5;&#x7136;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5F20;&#x65E0;&#x5FCC;&#x8FD9;&#x822C;&#x5929;&#x8D4B;&#x5F02;&#x7980;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x7EC3;&#x4E60;&#x548C;&#x601D;&#x8003;&#x6162;&#x6162;&#x7684;&#x53BB;&#x5FD8;&#x6389;&#x90A3;&#x4E9B;&#x8BA8;&#x4EBA;&#x538C;&#x7684;&#x5404;&#x79CD;&#x6280;&#x5DE7;&#x3001;&#x5404;&#x79CD;&#x9053;&#x7406;&#x3002; &#x6211;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4FEE;&#x70BC;&#xFF1A;</p>
<ol>
<li>&#x5F53;&#x4F60;&#x5728;&#x505A;&#x4E00;&#x4EF6;&#x4F60;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x63D0;&#x4E00;&#x4E9B;&#x66F4;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x601D;&#x8003;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x505A;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x81EA;&#x8EAB;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#x4E60;&#x60EF;&#x4E2D;&#x627E;&#x5230;&#x8FDB;&#x6B65;&#x7684;&#x70B9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x56DE;&#x60F3;&#x4F60;&#x6240;&#x77E5;&#x9053;&#x7684;&#x77E5;&#x8BC6;&#x4E2D;&#x6709;&#x54EA;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x63D0;&#x9AD8;&#x3002;</li>
<li>&#x5728;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4EE5;&#x53CA;&#x505A;&#x5B8C;&#x4E4B;&#x540E;&#x8981;&#x7ECF;&#x5E38;&#x7684;&#x7528;&#x4E00;&#x4E2A;&#x201C;&#x4E0A;&#x5E1D;&#x89C6;&#x89D2;&#x201D;&#x770B;&#x770B;&#x4F60;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6709;&#x54EA;&#x4E9B;&#x505A;&#x7684;&#x4E0D;&#x597D;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x505A;&#x4E0D;&#x597D;&#xFF1F;&#x662F;&#x56E0;&#x4E3A;&#x65E7;&#x7684;&#x4E60;&#x60EF;&#x8FD8;&#x662F;&#x8BF4;&#x67D0;&#x4E9B;&#x77E5;&#x8BC6;&#x7684;&#x7F3A;&#x4E4F;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x7B49;&#x65B9;&#x6CD5;&#x62D3;&#x5BBD;&#x81EA;&#x5DF1;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#xFF0C;&#x5E76;&#x79EF;&#x6781;&#x5C06;&#x5176;&#x8DDF;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x8DF5;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x601D;&#x8003;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x505A;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x70B9;&#x8FD9;&#x5C31;&#x591F;&#x4E86;&#x3002;&#x4F55;&#x51B5;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x7AD9;&#x5728;&#x524D;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#x4E0A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5462;&#xFF1F;</li>
</ol>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x738B;&#x9633;&#x660E;&#x5F53;&#x65F6;&#x63D0;&#x51FA;&#x201C;&#x77E5;&#x884C;&#x5408;&#x4E00;&#x201D;&#x7684;&#x539F;&#x610F;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7406;&#x89E3;&#x7684;&#x201C;&#x77E5;&#x884C;&#x5408;&#x4E00;&#x201D;&#x662F;&#x901A;&#x8FC7;&#x884C;&#x52A8;&#x5C06;&#x4F60;&#x77E5;&#x9053;&#x7684;&#x548C;&#x4F60;&#x80FD;&#x505A;&#x5230;&#x7684;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x201D;&#x5FD8;&#x8BB0;&#x201D;&#x7684;&#x5883;&#x754C;&#x3002;</p>
<p>[end]</p>
<hr>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/思考讨论/">思考讨论</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/思考/">思考</a><a href="/tags/行动/">行动</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://zhengyi.me/2016/05/27/unity-of-knowlede-and-action/" data-title="“知行合一” | yi&#39;s weblog" data-tsina="null" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/05/28/africa-30-kilo-metre-reading-note/" title="《非洲三万里》读书笔记">
  <strong>上一篇：</strong><br/>
  <span>
  《非洲三万里》读书笔记</span>
</a>
</div>


<div class="next">
<a href="/2016/05/25/learning-shell-in-mac-cp/"  title="Mac 命令学习-每日一贴之cp">
 <strong>下一篇：</strong><br/> 
 <span>Mac 命令学习-每日一贴之cp
</span>
</a>
</div>

</nav>

	

<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>10</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/linux/" title="linux">linux<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/操作系统/" title="操作系统">操作系统<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>




<script type="text/javascript">

var disqus_shortname = '2power10';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
