
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  
    <title>Learning how to learn 第二周学习笔记 | yi&#39;s weblog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="Yi">
    

    
    <meta name="description" content="Coursera&amp;#x7ECF;&amp;#x5178;&amp;#x8BFE;&amp;#x7A0B;Learning how to learn&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x3002;
&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x6240;&amp;#x6709;&amp;#x5185;&amp;#x5BB9;&amp;#x90FD;&amp;#x662F;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="Learning how to learn 第二周学习笔记">
<meta property="og:url" content="http://zhengyi.me/2016/05/05/learning-how-to-learn-module-2-note/index.html">
<meta property="og:site_name" content="yi's weblog">
<meta property="og:description" content="Coursera&amp;#x7ECF;&amp;#x5178;&amp;#x8BFE;&amp;#x7A0B;Learning how to learn&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x3002;
&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x6240;&amp;#x6709;&amp;#x5185;&amp;#x5BB9;&amp;#x90FD;&amp;#x662F;&amp;#">
<meta property="og:image" content="http://zhengyi.me/img/learning_how_to_learn_week_2.png">
<meta property="og:updated_time" content="2016-05-05T13:27:03.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Learning how to learn 第二周学习笔记">
<meta name="twitter:description" content="Coursera&amp;#x7ECF;&amp;#x5178;&amp;#x8BFE;&amp;#x7A0B;Learning how to learn&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x5B66;&amp;#x4E60;&amp;#x7B14;&amp;#x8BB0;&amp;#x3002;
&amp;#x7B2C;&amp;#x4E8C;&amp;#x5468;&amp;#x6240;&amp;#x6709;&amp;#x5185;&amp;#x5BB9;&amp;#x90FD;&amp;#x662F;&amp;#">
<meta name="twitter:image" content="http://zhengyi.me/img/learning_how_to_learn_week_2.png">

    
    <link rel="alternative" href="/atom.xml" title="yi&#39;s weblog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css">
</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="yi&#39;s weblog" title="yi&#39;s weblog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="yi&#39;s weblog">yi&#39;s weblog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">主页</a></li>
					
						<li><a href="/archives">归档</a></li>
					
						<li><a href="/douban">读书</a></li>
					
						<li><a href="/about">关于我</a></li>
					
						<li><a href="/atom.xml">RSS</a></li>
					
					<li>
 					
					<form class="search" action="//google.com/search" method="get" accept-charset="utf-8">
						<label>Search</label>
						<input type="search" id="search" name="q" autocomplete="off" maxlength="20" placeholder="搜索" />
						<input type="hidden" name="q" value="site:zhengyi.me">
					</form>
					
					</li>
				</ul>
			</nav>			
</div>
    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2016/05/05/learning-how-to-learn-module-2-note/" title="Learning how to learn 第二周学习笔记" itemprop="url">Learning how to learn 第二周学习笔记</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="Yi" target="_blank" itemprop="author">Yi</a>
		
  <p class="article-time">
    <time datetime="2016-05-05T13:23:02.000Z" itemprop="datePublished"> 发表于 2016-05-05</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#什么是chunk及其作用"><span class="toc-number">1.</span> <span class="toc-text">什么是Chunk及其作用</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#如何形成一个chunk"><span class="toc-number">2.</span> <span class="toc-text">如何形成一个chunk</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#几种错误的学习方法"><span class="toc-number">3.</span> <span class="toc-text">几种错误的学习方法</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#集中高效的学习方法"><span class="toc-number">4.</span> <span class="toc-text">集中高效的学习方法</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#关于思维导图个人观点"><span class="toc-number">5.</span> <span class="toc-text">关于思维导图(个人观点)</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#几个问题"><span class="toc-number">6.</span> <span class="toc-text">几个问题</span></a></li></ol>
		
		</div>
		
		<p>Coursera&#x7ECF;&#x5178;&#x8BFE;&#x7A0B;<a href="https://www.coursera.org/learn/learning-how-to-learn/" target="_blank" rel="external"><em>Learning how to learn</em></a>&#x7B2C;&#x4E8C;&#x5468;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5468;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x56F4;&#x7ED5;&#x7740;Chunking&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x6240;&#x5C55;&#x5F00;&#x7684;&#xFF0C;chunk&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#x4E2D;&#x6587;&#x4E3A;&#x7EC4;&#x5757;&#xFF0C;&#x611F;&#x89C9;&#x6CA1;&#x6709;&#x82F1;&#x6587;&#x6765;&#x7684;&#x5F62;&#x8C61;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x56DE;&#x987E;&#x51E0;&#x4E2A;&#x6211;&#x8BA4;&#x4E3A;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x70B9;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;"><a href="#&#x4EC0;&#x4E48;&#x662F;Chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;Chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;"></a>&#x4EC0;&#x4E48;&#x662F;Chunk&#x53CA;&#x5176;&#x4F5C;&#x7528;</h2><p>Chunk&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6210;&#x67D0;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x5728;&#x4F60;&#x5927;&#x8111;&#x4E2D;&#x5F62;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x8BB0;&#x5FC6;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BB0;&#x5FC6;&#x5757;&#x662F;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#x3002;&#x8BFE;&#x7A0B;&#x4E2D;&#x5C06;&#x8FD9;&#x4E2A;chunk&#x6BD4;&#x55BB;&#x4E3A;&#x4E00;&#x4E2A;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x5012;&#x662F;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;chunk&#x7406;&#x89E3;&#x6210;&#x67D0;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x77E5;&#x8BC6;&#x7684;&#x6982;&#x8981;/&#x7CBE;&#x534E;&#x66F4;&#x52A0;&#x7684;&#x59A5;&#x5F53;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x628A;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x77E5;&#x8BC6;&#x538B;&#x7F29;&#x6210;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#x7684;&#x6982;&#x5FF5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x601D;&#x8003;&#x66F4;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E3E;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5C31;&#x662F;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x8003;&#x8651;&#x7684;&#x662F;&#x5404;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x7279;&#x5F81;&#x3001;&#x4F18;&#x7F3A;&#x70B9;&#x3001;&#x5C40;&#x9650;&#x6027;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6211;&#x8BA4;&#x4E3A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;chunk&#xFF0C;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x67D0;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x987A;&#x7740;&#x8FD9;&#x4E2A;chunk&#x5F80;&#x4E0B;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#xFF0C;&#x6216;&#x8005;&#x63A8;&#x7406;&#x4E00;&#x4E0B;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5177;&#x4F53;&#x7684;&#x7B97;&#x6CD5;&#x7EC6;&#x8282;&#x63A8;&#x7406;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x53EA;&#x6709;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x6709;&#x6DF1;&#x523B;&#x7684;&#x7406;&#x89E3;&#x4EE5;&#x540E;&#x624D;&#x4F1A;&#x4EA7;&#x751F;&#x8FD9;&#x79CD;chunk&#xFF0C;&#x5426;&#x5219;&#x8FD9;&#x4E9B;&#x4F18;&#x7F3A;&#x70B9;&#x5BF9;&#x4E8E;&#x4F60;&#x6765;&#x8BF4;&#x5E76;&#x4E0D;&#x4F1A;&#x663E;&#x5F97;&#x90A3;&#x4E48;&#x7684;&#x81EA;&#x7136;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF0C;chunk&#x6700;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x5BF9;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x610F;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x3002;&#x5F53;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;chunk&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x6574;&#x5408;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;chunk&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x4ECE;&#x66F4;&#x9AD8;&#x7684;&#x5C42;&#x9762;&#x53BB;&#x8003;&#x8651;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x601D;&#x8003;&#x95EE;&#x9898;&#x7684;&#x9AD8;&#x5EA6;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk"><a href="#&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk" class="headerlink" title="&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk"></a>&#x5982;&#x4F55;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk</h2><p>&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5F62;&#x6210;&#x4E00;&#x4E2A;chunk&#xFF1A;</p>
<ol>
<li>&#x9AD8;&#x5EA6;&#x96C6;&#x4E2D;&#x6CE8;&#x610F;&#x529B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x5B66;&#x4E60;&#x3002;&#xFF08;focused attention&#xFF09;</li>
<li>&#x7406;&#x89E3;&#x95EE;&#x9898;&#x3002;&#xFF08;understanding of the basic idea&#xFF09;</li>
<li>&#x523B;&#x610F;&#x7EC3;&#x4E60;&#x3002;&#xFF08;practice&#xFF09;</li>
<li>&#x6CE8;&#x610F;&#x77E5;&#x8BC6;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x800C;&#x975E;&#x4EC5;&#x4EC5;&#x5173;&#x6CE8;&#x77E5;&#x8BC6;&#x70B9;&#x672C;&#x8EAB;&#x3002;&#xFF08;sense of big picture&#xFF09;</li>
</ol>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x6B65;&#x9AA4;&#x5E94;&#x8BE5;&#x90FD;&#x4E0D;&#x4F1A;&#x964C;&#x751F;&#xFF0C;&#x8FD9;&#x91CC;&#x7279;&#x522B;&#x5F3A;&#x8C03;&#x4E00;&#x4E0B;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x505A;&#x7EC3;&#x4E60;&#x662F;&#x6D4B;&#x8BD5;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x7406;&#x89E3;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x9014;&#x5F84;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x9886;&#x57DF;&#x6BD4;&#x5982;&#x7F16;&#x7A0B;&#xFF0C;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x904D;&#x4EE3;&#x7801;&#x7EDD;&#x5BF9;&#x662F;&#x4F1A;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x7406;&#x89E3;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#x7684;&#x3002;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x8981;&#x5408;&#x4E0A;&#x6750;&#x6599;&#xFF0C;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x548C;&#x8BB0;&#x5FC6;&#x5199;&#x4E00;&#x4E2A;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F60;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x548C;&#x63A8;&#x7406;&#x4E00;&#x904D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x662F;&#x8BF4;&#x8981;&#x6CE8;&#x610F;&#x53EA;&#x662F;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x8FD9;&#x4E2A;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x77E5;&#x8BC6;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x5C42;&#x9762;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x5C06;&#x5176;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x5DF2;&#x6709;&#x7684;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3001;&#x8054;&#x7CFB;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x77E5;&#x8BC6;&#x7684;&#x7406;&#x89E3;&#x6DF1;&#x5EA6;&#x3002;</p>
<h2 id="&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"><a href="#&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;" class="headerlink" title="&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"></a>&#x51E0;&#x79CD;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;</h2><p>&#x8BFE;&#x7A0B;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x51E0;&#x4E2A;&#x6BD4;&#x8F83;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5F80;&#x5F80;&#x4F1A;&#x8BA9;&#x5B66;&#x4E60;&#x8005;&#x4EA7;&#x751F;&#x4E00;&#x79CD;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x7684;&#x9519;&#x89C9;&#x3002;&#x8FD9;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x8BFE;&#x672C;&#x4E0A;&#x5212;&#x51FA;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x91CD;&#x70B9;</li>
<li>&#x53CD;&#x590D;&#x7684;&#x53BB;&#x8BFB;&#x4E00;&#x6BB5;&#x6750;&#x6599;</li>
<li>&#x5B66;&#x4E60;&#x5B8C;&#x4EE5;&#x540E;&#x505A;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x5BFC;&#x56FE;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5176;&#x5B9E;&#x66F4;&#x591A;&#x7684;&#x662F;&#x5728;&#x5F62;&#x5F0F;&#x5C42;&#x9762;&#x8FDB;&#x884C;&#x91CD;&#x590D;&#x548C;&#x5DE9;&#x56FA;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x601D;&#x7EF4;&#x4E0A;&#x8FDB;&#x884C;&#x5DE9;&#x56FA;&#x3002;</p>
<h2 id="&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"><a href="#&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;" class="headerlink" title="&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;"></a>&#x96C6;&#x4E2D;&#x9AD8;&#x6548;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;</h2><p>&#x5E94;&#x5BF9;&#x4E0A;&#x9762;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0B;&#x9762;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x5B66;&#x4E60;&#x638C;&#x63E1;&#x4E00;&#x95E8;&#x77E5;&#x8BC6;&#x3002;</p>
<ul>
<li>&#x5728;&#x5B66;&#x4E60;&#x5B8C;&#x4E00;&#x6BB5;&#x6750;&#x6599;&#x4EE5;&#x540E;&#xFF0C;&#x5728;&#x4E0D;&#x770B;&#x7B14;&#x8BB0;&#x548C;&#x6750;&#x6599;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x56DE;&#x60F3;&#x5B66;&#x8FC7;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5728;&#x8111;&#x5B50;&#x91CC;&#x8FC7;&#x4E00;&#x904D;&#x81EA;&#x5DF1;&#x8BB0;&#x4F4F;&#x7684;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x5C3D;&#x529B;&#x56DE;&#x987E;&#x5B8C;&#x4EE5;&#x540E;&#xFF0C;&#x518D;&#x53BB;&#x5DE9;&#x56FA;&#x90A3;&#x4E9B;&#x4F60;&#x5DF2;&#x7ECF;&#x5FD8;&#x8BB0;&#x6216;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x3002;&#x53CD;&#x590D;&#x51E0;&#x6B21;&#x3002;</li>
<li>&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x56DE;&#x60F3;&#x4F1A;&#x5E2E;&#x52A9;&#x4F60;&#x6446;&#x8131;&#x4E00;&#x4E9B;&#x73AF;&#x5883;&#x4E0A;&#x7684;&#x6697;&#x793A;&#x3002;</li>
<li>&#x7740;&#x91CD;&#x53BB;&#x7EC3;&#x4E60;&#x90A3;&#x4E9B;&#x81EA;&#x5DF1;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53CD;&#x590D;&#x505A;&#x90A3;&#x4E9B;&#x5DF2;&#x7ECF;&#x4F1A;&#x7684;&#x7EC3;&#x4E60;&#x3002;</li>
<li>Interleaving learning&#x3002;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x662F;&#x8BF4;&#x5728;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x77E5;&#x8BC6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x591A;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x4EA4;&#x66FF;&#x7684;&#x5B66;&#x4E60;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x8BA9;&#x4F60;&#x62E5;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x5B66;&#x4E60;&#x6548;&#x7387;&#xFF0C;&#x867D;&#x7136;&#x8BF4;&#x5B66;&#x4E60;&#x8005;&#x672C;&#x8EAB;&#x53EF;&#x80FD;&#x6CA1;&#x53D1;&#x89C9;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5B66;&#x4E60;&#x7FBD;&#x6BDB;&#x7403;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x8BF4;&#x5B66;&#x4E60;&#x5B8C;&#x53D1;&#x7403;&#x4EE5;&#x540E;&#x518D;&#x5B66;&#x4E60;&#x6263;&#x6740;&#xFF0C;&#x53EF;&#x4EE5;&#x5B66;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x53D1;&#x7403;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x5B66;&#x6263;&#x6740;&#xFF0C;&#x63A5;&#x7740;&#x518D;&#x56DE;&#x6765;&#x5B66;&#x53D1;&#x7403;&#x3002;&#x8FD9;&#x4F1A;&#x8BA9;&#x4F60;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x540C;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x7ECF;&#x9A8C;&#x5171;&#x4EAB;&#x3002;</li>
</ul>
<h2 id="&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;"><a href="#&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;-&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;" class="headerlink" title="&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;(&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;)"></a>&#x5173;&#x4E8E;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;(&#x4E2A;&#x4EBA;&#x89C2;&#x70B9;)</h2><p>&#x4E0A;&#x9762;&#x7684;&#x9519;&#x8BEF;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E2A;concept mapping&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x89C9;&#x5F97;&#x8DDF;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x5F88;&#x50CF;&#x3002;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x4E00;&#x4E2A;&#x5E2E;&#x52A9;&#x8BB0;&#x5FC6;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x679C;&#x7528;&#x5F97;&#x4E0D;&#x5BF9;&#x7684;&#x8BDD;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x770B;&#x5B8C;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x6216;&#x5B66;&#x4E60;&#x5B8C;&#x4E00;&#x6BB5;&#x77E5;&#x8BC6;&#x4EE5;&#x540E;&#x3002;&#x8131;&#x79BB;&#x5F00;&#x6765;&#x6750;&#x6599;&#xFF0C;&#x9760;&#x8111;&#x5B50;&#x56DE;&#x60F3;&#x77E5;&#x8BC6;&#x70B9;&#x4EE5;&#x53CA;&#x77E5;&#x8BC6;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x7136;&#x540E;&#x501F;&#x52A9;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x628A;&#x8FD9;&#x4E9B;&#x8054;&#x7CFB;&#x4E2A;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x6211;&#x6240;&#x8BF4;&#x7684;&#x56DE;&#x60F3;&#x7684;&#x90A3;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x662F;&#x8BF4;&#x628A;&#x8111;&#x5B50;&#x91CC;&#x7684;&#x201C;chunk&#x201D;&#x901A;&#x8FC7;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#x800C;&#x5DF2;&#x3002;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x4E2D;&#x5404;&#x4E2A;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x53EF;&#x4EE5;&#x8DDF;&#x4E66;&#x672C;&#x4E0A;&#x7684;&#x8054;&#x7CFB;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x5B9A;&#x662F;&#x8981;&#x4F60;&#x8111;&#x5B50;&#x91CC;&#x771F;&#x5B9E;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x5426;&#x5219;&#x7684;&#x8BDD;&#x4E0B;&#x6B21;&#x4F60;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x5C31;&#x4E0D;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x56DE;&#x60F3;&#x8D77;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="&#x51E0;&#x4E2A;&#x95EE;&#x9898;"><a href="#&#x51E0;&#x4E2A;&#x95EE;&#x9898;" class="headerlink" title="&#x51E0;&#x4E2A;&#x95EE;&#x9898;"></a>&#x51E0;&#x4E2A;&#x95EE;&#x9898;</h2><p>&#x4F9D;&#x7136;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x5F88;&#x597D;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<ol>
<li>&#x5982;&#x4F55;&#x514B;&#x670D;&#x601D;&#x7EF4;&#x5B9A;&#x52BF;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5229;&#x7528;&#x597D;diffuse mode&#xFF1F;</li>
</ol>
<p><img src="/img/learning_how_to_learn_week_2.png" alt="Learning how to learn week 2 mindmap"></p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/心理学/">心理学</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/心理学/">心理学</a><a href="/tags/思考方法/">思考方法</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	  <div data-url="http://zhengyi.me/2016/05/05/learning-how-to-learn-module-2-note/" data-title="Learning how to learn 第二周学习笔记 | yi&#39;s weblog" data-tsina="null" class="share clearfix">
	  </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2016/05/14/some-thought-about-reading/" title="读书方法的一些思考">
  <strong>上一篇：</strong><br/>
  <span>
  读书方法的一些思考</span>
</a>
</div>


<div class="next">
<a href="/2016/04/27/learning-how-to-learn-module-1-note/"  title="Learning how to learn 第一周笔记">
 <strong>下一篇：</strong><br/> 
 <span>Learning how to learn 第一周笔记
</span>
</a>
</div>

</nav>

	

<section id="comments" class="comment">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>

</div>  
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#什么是chunk及其作用"><span class="toc-number">1.</span> <span class="toc-text">什么是Chunk及其作用</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#如何形成一个chunk"><span class="toc-number">2.</span> <span class="toc-text">如何形成一个chunk</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#几种错误的学习方法"><span class="toc-number">3.</span> <span class="toc-text">几种错误的学习方法</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#集中高效的学习方法"><span class="toc-number">4.</span> <span class="toc-text">集中高效的学习方法</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#关于思维导图个人观点"><span class="toc-number">5.</span> <span class="toc-text">关于思维导图(个人观点)</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#几个问题"><span class="toc-number">6.</span> <span class="toc-text">几个问题</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  


  <div class="linkslist">
  <p class="asidetitle">公众号</p>
  <img width="100%" src="/img/wechat.logo.jpg" alt="ArmstrongNotes"/> 
</div>

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/心理学/" title="心理学">心理学<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/思考讨论/" title="思考讨论">思考讨论<sup>2</sup></a></li>
		  
		
		  
			<li><a href="/categories/编程工具/" title="编程工具">编程工具<sup>9</sup></a></li>
		  
		
		  
			<li><a href="/categories/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
		  
		
		  
			<li><a href="/categories/阅读相关/" title="阅读相关">阅读相关<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/shell/" title="shell">shell<sup>8</sup></a></li>
			
		
			
				<li><a href="/tags/mac/" title="mac">mac<sup>8</sup></a></li>
			
		
			
				<li><a href="/tags/terminal/" title="terminal">terminal<sup>8</sup></a></li>
			
		
			
				<li><a href="/tags/心理学/" title="心理学">心理学<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考方法/" title="思考方法">思考方法<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/思考/" title="思考">思考<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/写作/" title="写作">写作<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/读书笔记/" title="读书笔记">读书笔记<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/旅行/" title="旅行">旅行<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/非洲/" title="非洲">非洲<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/linux/" title="linux">linux<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/操作系统/" title="操作系统">操作系统<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/阅读/" title="阅读">阅读<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/毕淑敏/" title="毕淑敏">毕淑敏<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/行动/" title="行动">行动<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/git/" title="git">git<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/gitflow/" title="gitflow">gitflow<sup>1</sup></a></li>
			
		
			
				<li><a href="/tags/项目控制/" title="项目控制">项目控制<sup>1</sup></a></li>
			
		
		</ul>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="http://blog.vicoder.com/" target="_blank" title="Victor Jiang">Victor Jiang</a>
            
          </li>
        
    </ul>
</div>

  


</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	
	<section class="info">
		<p> Hello ,I&#39;m 10000000000 <br/>
			</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/wuchong/jacman" target="_blank" title="Jacman">Jacman</a> © 2016 
		
		<a href="/about" target="_blank" title="Yi">Yi</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>
<script src="/js/jquery.qrcode-0.12.0.min.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>


<script type="text/javascript">
$(document).ready(function(){ 
  var $this = $('.share'),
      url = $this.attr('data-url'),
      encodedUrl = encodeURIComponent(url),
      title = $this.attr('data-title'),
      tsina = $this.attr('data-tsina'),
      description = $this.attr('description');
  var html = [
  '<div class="hoverqrcode clearfix"></div>',
  '<a class="overlay" id="qrcode"></a>',
  '<a href="https://www.facebook.com/sharer.php?u=' + encodedUrl + '" class="article-share-facebook" target="_blank" title="Facebook"></a>',
  '<a href="https://twitter.com/intent/tweet?url=' + encodedUrl + '" class="article-share-twitter" target="_blank" title="Twitter"></a>',
  '<a href="#qrcode" class="article-share-qrcode" title="微信"></a>',
  '<a href="http://service.weibo.com/share/share.php?title='+title+'&url='+encodedUrl +'&ralateUid='+ tsina +'&searchPic=true&style=number' +'" class="article-share-weibo" target="_blank" title="微博"></a>',
  '<span title="Share to"></span>'
  ].join('');
  $this.append(html);

  $('.hoverqrcode').hide();

  var myWidth = 0;
  function updatehoverqrcode(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
    var qrsize = myWidth > 1024 ? 200:100;
    var options = {render: 'image', size: qrsize, fill: '#2ca6cb', text: url, radius: 0.5, quiet: 1};
    var p = $('.article-share-qrcode').position();
    $('.hoverqrcode').empty().css('width', qrsize).css('height', qrsize)
                          .css('left', p.left-qrsize/2+20).css('top', p.top-qrsize-10)
                          .qrcode(options);
  };
  $(window).resize(function(){
    $('.hoverqrcode').hide();
  });
  $('.article-share-qrcode').click(function(){
    updatehoverqrcode();
    $('.hoverqrcode').toggle();
  });
  $('.article-share-qrcode').hover(function(){}, function(){
      $('.hoverqrcode').hide();
  });
});   
</script>




<script type="text/javascript">

var disqus_shortname = '2power10';

(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
(function(){
  var dsq = document.createElement('script');
  dsq.type = 'text/javascript';
  dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/count.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
}());
</script>






<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->

<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');
ga('create', 'UA-8661588-8', 'zhengyi.me');  
ga('send', 'pageview');
</script>





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
